[
    {
        "id": "BM.1.1.1",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 1. Halaman: 1. Riwayat: Abu Daud, Ibnu Majah, Tirmidzi, Nasa'i, Ibnu Syaibah. Derajat: Shahih oleh Ibnu Khuzaimah, Shahih oleh Tirmidzi. Perawi dari: Abu Hurairah. Tambahan informasi: Lafadz hadits berasal dari riwayat Ibnu Syaibah. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda tentang (air) laut, \"Air laut itu suci dan menyucikan, bangkainya pun halal hukumnya.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda tentang (air) laut, \"Air laut itu suci dan menyucikan, bangkainya pun halal hukumnya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 1. Halaman: 1. Riwayat: Abu Daud, Ibnu Majah, Tirmidzi, Nasa'i, Ibnu Syaibah. Derajat: Shahih oleh Ibnu Khuzaimah, Shahih oleh Tirmidzi. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.1.10",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 10. Halaman: 3. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: Masih dalam riwayat Muslim, disebutkan, \"Hendaklah ia membuang air itu.\" Sedangkan Menurut riwayat Tirmidzi, \"Yang terakhir atau yang pertama (dicampur) dengan debu tanah.\" . Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Sucinya tempat air seseorang di antara kalian jika telah dijilat anjing ialah dengan mencucinya tujuh kali. Yang pertamanya dicampur dengan debu tanah.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Sucinya tempat air seseorang di antara kalian jika telah dijilat anjing ialah dengan mencucinya tujuh kali. Yang pertamanya dicampur dengan debu tanah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 10. Halaman: 3. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.1.11",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 11. Halaman: 3. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Tirmidzi, Shahih oleh Ibnu Khuzaimah. Perawi dari: Abu Qatadah. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) pernah bersabda perihal kucing, \"Hewan kucing itu tidaklah najis, karena ia termasuk hewan yang berkeliaran di sekitar kalian.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) pernah bersabda perihal kucing, \"Hewan kucing itu tidaklah najis, karena ia termasuk hewan yang berkeliaran di sekitar kalian.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 11. Halaman: 3. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Tirmidzi, Shahih oleh Ibnu Khuzaimah. Perawi dari: Abu Qatadah. "
    },
    {
        "id": "BM.1.1.12",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 12. Halaman: 3-4. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa seseorang Arab Badui datang kemudian buang air kecil di suatu sudut masjid. Maka orang-orang langsung menghardiknya. Namun Rasulullah (saw.) melarang tindakan mereka tersebut. Ketika ia selesai buang air kecil, maka Rasulullah (saw.) memerintahkan untuk diambilkan seember air. Lalu air itu disiramkan di atas bekas buang air kecil tersebut.\"",
        "body": "Ia mengatakan bahwa seseorang Arab Badui datang kemudian buang air kecil di suatu sudut masjid. Maka orang-orang langsung menghardiknya. Namun Rasulullah (saw.) melarang tindakan mereka tersebut. Ketika ia selesai buang air kecil, maka Rasulullah (saw.) memerintahkan untuk diambilkan seember air. Lalu air itu disiramkan di atas bekas buang air kecil tersebut.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 12. Halaman: 3-4. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. "
    },
    {
        "id": "BM.1.1.13",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 13. Halaman: 4. Riwayat: Ahmad, Ibnu Majah. Derajat: -. Perawi dari: Abdullah bin Umar. Tambahan informasi: Di dalam sanadnya terdapat kelemahan. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Dihalalkan bagi kita dua macam bangkai dan dua macam darah. Dua macam bangkai itu adalah belalang dan ikan, sedangkan dua macam darah adalah hati dan jantung.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Dihalalkan bagi kita dua macam bangkai dan dua macam darah. Dua macam bangkai itu adalah belalang dan ikan, sedangkan dua macam darah adalah hati dan jantung.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 13. Halaman: 4. Riwayat: Ahmad, Ibnu Majah. Derajat: -. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.1.1.14",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 14. Halaman: 4. Riwayat: -. Derajat: -. Perawi dari: Abu Hurairah. Tambahan informasi: Dikeluarkan oleh Bukhari dan Abu Daud dengan tambahan, \"Dan hendaknya ia waspada dengan sayap yang ada penyakitnya.\". Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila ada lalat jatuh ke dalam minuman seseorang di antara kamu maka benamkanlah lalat itu kemudian keluarkanlah. Karena pada salah satu sayapnya terdapat penyakit dan pada sayap lainnya ada obat penawar.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila ada lalat jatuh ke dalam minuman seseorang di antara kamu maka benamkanlah lalat itu kemudian keluarkanlah. Karena pada salah satu sayapnya terdapat penyakit dan pada sayap lainnya ada obat penawar.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 14. Halaman: 4. Riwayat: -. Derajat: -. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.1.15",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 15. Halaman: 4. Riwayat: Abu Daud, Tirmidzi. Derajat: Shahih oleh Abu Daud, Shahih oleh Tirmidzi. Perawi dari: Abu Waqid Al-Laitsi. Tambahan informasi: Lafadz hadits ini menurut Tirmidzi.. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Anggota tubuh yang terpotong dari binatang yang masih hidup adalah termasuk bangkai.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Anggota tubuh yang terpotong dari binatang yang masih hidup adalah termasuk bangkai.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 15. Halaman: 4. Riwayat: Abu Daud, Tirmidzi. Derajat: Shahih oleh Abu Daud, Shahih oleh Tirmidzi. Perawi dari: Abu Waqid Al-Laitsi. "
    },
    {
        "id": "BM.1.1.2",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 2. Halaman: 1. Riwayat: Abu Daud, Tirmidzi, Nasa'i. Derajat: Shahih oleh Ahmad. Perawi dari: Abu Said Al-Khudry. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya (hakikat) air adalah suci dan menyucikan, tak ada sesuatu pun yang menajiskannya.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya (hakikat) air adalah suci dan menyucikan, tak ada sesuatu pun yang menajiskannya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 2. Halaman: 1. Riwayat: Abu Daud, Tirmidzi, Nasa'i. Derajat: Shahih oleh Ahmad. Perawi dari: Abu Said Al-Khudry. "
    },
    {
        "id": "BM.1.1.3",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 3. Halaman: 1. Riwayat: Ibnu Majah. Derajat: Dhaif oleh Ibnu Hatim. Perawi dari: Abu Umamah Al-Bahily. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda: \"Sesungguhnya tidak ada sesuatu pun yang dapat menajiskan air kecuali yang dapat merubah bau, rasa atau warnanya.\"\n",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda: \"Sesungguhnya tidak ada sesuatu pun yang dapat menajiskan air kecuali yang dapat merubah bau, rasa atau warnanya.\"\n",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 3. Halaman: 1. Riwayat: Ibnu Majah. Derajat: Dhaif oleh Ibnu Hatim. Perawi dari: Abu Umamah Al-Bahily. "
    },
    {
        "id": "BM.1.1.4",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 4. Halaman: 2. Riwayat: Al-Baihaqi. Derajat: -. Perawi dari: -. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Air itu suci kecuali jika berubah baunya, rasanya atau warnanya dengan suatu najis yang masuk di dalamnya.\"",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Air itu suci kecuali jika berubah baunya, rasanya atau warnanya dengan suatu najis yang masuk di dalamnya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 4. Halaman: 2. Riwayat: Al-Baihaqi. Derajat: -. Perawi dari: -. "
    },
    {
        "id": "BM.1.1.5",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 5. Halaman: 2. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Ibnu Khuzaimah, Shahih oleh Ibnu Hibban. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: bahwa Rasulullah (saw.) bersabda: \"Jika banyaknya air telah mencapai dua kullah maka ia tidak mengandung kotoran.\" Dalam suatu lafadz hadits: \"Tidak najis\". Dikeluarkan oleh Imam Empat dan dinilai shahih oleh Ibnu Khuzaimah, Hakim, dan Ibnu Hibban. ",
        "body": "bahwa Rasulullah (saw.) bersabda: \"Jika banyaknya air telah mencapai dua kullah maka ia tidak mengandung kotoran.\" Dalam suatu lafadz hadits: \"Tidak najis\". Dikeluarkan oleh Imam Empat dan dinilai shahih oleh Ibnu Khuzaimah, Hakim, dan Ibnu Hibban. ",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 5. Halaman: 2. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Ibnu Khuzaimah, Shahih oleh Ibnu Hibban. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.1.1.6",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 6. Halaman: 2. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: Menurut riwayat Bukhari, disebutkan bahwa Rasulullah (saw.) bersabda, \"Janganlah sekali-kali seseorang di antara kalian buang air kecil di dalam air tergenang yang tidak mengalir kemudian dia mandi di dalamnya.\" Menurut riwayat Muslim, \"dari air yang tergenang\" Dan menurut riwayat Abu Daud, disebutkan bahwa Rasulullah (saw.) bersabda, \"Dan janganlah seseorang mandi junub di dalamnya.\". Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Janganlah seseorang di antara kalian mandi di dalam air yang tergenang (tidak mengalir) ketika dalam keadaan junub.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Janganlah seseorang di antara kalian mandi di dalam air yang tergenang (tidak mengalir) ketika dalam keadaan junub.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 6. Halaman: 2. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.1.7",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 7. Halaman: 2. Riwayat: Abu Daud, Nasa'i. Derajat: Shahih. Perawi dari: Seorang Sahabat Nabi. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) melarang perempuan mandi dari sisa air laki-laki atau laki-laki dari sisa air perempuan. Namun hendaklah keduanya menyiduk (mengambil) air bersama-sama.\"\n",
        "body": "Ia berkata, \"Rasulullah (saw.) melarang perempuan mandi dari sisa air laki-laki atau laki-laki dari sisa air perempuan. Namun hendaklah keduanya menyiduk (mengambil) air bersama-sama.\"\n",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 7. Halaman: 2. Riwayat: Abu Daud, Nasa'i. Derajat: Shahih. Perawi dari: Seorang Sahabat Nabi. "
    },
    {
        "id": "BM.1.1.8",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 8. Halaman: 3. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah mandi dari sisa air Maimunah (Istri beliau).",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah mandi dari sisa air Maimunah (Istri beliau).",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 8. Halaman: 3. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.1.1.9",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 9. Halaman: 3. Riwayat: -. Derajat: Shahih oleh Tirmidzi, Shahih oleh Ibnu Khuzaimah. Perawi dari: -. Tambahan informasi: Hadits tersebut disebutkan oleh para pengarang kitab Sunan. Bunyi Hadits: Disebutkan bahwa sebagian istri Rasulullah (saw.) mandi dalam satu tempat air. Lalu ketika Nabi datang hendak mandi dengan air itu, maka istrinya berkata, \"Sesungguhnya aku sedang junub.\" Lantas Rasulullah (saw.) bersabda, \"Sesungguhnya air itu tidak menjadi junub.\"",
        "body": "Disebutkan bahwa sebagian istri Rasulullah (saw.) mandi dalam satu tempat air. Lalu ketika Nabi datang hendak mandi dengan air itu, maka istrinya berkata, \"Sesungguhnya aku sedang junub.\" Lantas Rasulullah (saw.) bersabda, \"Sesungguhnya air itu tidak menjadi junub.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Air. Nomor Hadits: 9. Halaman: 3. Riwayat: -. Derajat: Shahih oleh Tirmidzi, Shahih oleh Ibnu Khuzaimah. Perawi dari: -. "
    },
    {
        "id": "BM.1.2.16",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 16. Halaman: 5. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Hudzaifah bin Yaman. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Janganlah kamu minum dengan bejana yang terbuat dari emas dan perak. Dan jangan pula kamu makan dengan piring yang terbuat dari keduanya. karena memang barang-barang tersebut untuk mereka (orang kafir) di dunia, sedangkan untuk kalian di akhirat.",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Janganlah kamu minum dengan bejana yang terbuat dari emas dan perak. Dan jangan pula kamu makan dengan piring yang terbuat dari keduanya. karena memang barang-barang tersebut untuk mereka (orang kafir) di dunia, sedangkan untuk kalian di akhirat.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 16. Halaman: 5. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Hudzaifah bin Yaman. "
    },
    {
        "id": "BM.1.2.17",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 17. Halaman: 5. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Ummu Salamah. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Orang yang minum dengan bejana yang terbuat dari perak, sesungguhnya ia hanya memasukkan api jahannam ke dalam perutnya.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Orang yang minum dengan bejana yang terbuat dari perak, sesungguhnya ia hanya memasukkan api jahannam ke dalam perutnya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 17. Halaman: 5. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Ummu Salamah. "
    },
    {
        "id": "BM.1.2.18",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 18. Halaman: 5. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: Menurut riwayat Abu Daud, Tirmidzi, Nasa'i, dan Ibnu Majah, disebutkan dengan lafadz, \"Kulit binatang apapun yang telah disamak (maka telah suci)\". Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Jika kulit binatang telah disamak maka ia menjadi suci.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Jika kulit binatang telah disamak maka ia menjadi suci.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 18. Halaman: 5. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.1.2.19",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 19. Halaman: 5. Riwayat: -. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Salamah bin Al-Muhabbiq. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Menyamak kulit bangkai adalah mensucikannya.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Menyamak kulit bangkai adalah mensucikannya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 19. Halaman: 5. Riwayat: -. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Salamah bin Al-Muhabbiq. "
    },
    {
        "id": "BM.1.2.20",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 20. Halaman: 5-6. Riwayat: Abu Daud, Nasa'i. Derajat: -. Perawi dari: Maimunah. Tambahan informasi: -. Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) pernah melintas di hadapan seekor kambing yang sedang diseret orang-orang. Beliau bersabda, \"Alangkah baiknya jika kalian mengambil kulitnya.\" Mereka menjawab, \"Kambing ini benar-benar telah mati.\" Rasulullah (saw.) pun bersabda, \"Kulitnya dapat disucikan dengan air dan daun salam.\"",
        "body": "Ia berkata bahwa Rasulullah (saw.) pernah melintas di hadapan seekor kambing yang sedang diseret orang-orang. Beliau bersabda, \"Alangkah baiknya jika kalian mengambil kulitnya.\" Mereka menjawab, \"Kambing ini benar-benar telah mati.\" Rasulullah (saw.) pun bersabda, \"Kulitnya dapat disucikan dengan air dan daun salam.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 20. Halaman: 5-6. Riwayat: Abu Daud, Nasa'i. Derajat: -. Perawi dari: Maimunah. "
    },
    {
        "id": "BM.1.2.21",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 21. Halaman: 6. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Tsa'labah Al-Khusyani. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Saya pernah bertanya kepada Rasulullah (saw.), 'Wahai Rasulullah, sesungguhnya kami tinggal di daerah Ahli Kitab. Bolehkah kami makan dengan bejana mereka?' Rasulullah (saw.) menjawab, 'Janganlah kalian makan dengan bejana mereka kecuali jika kalian tidak mendapatkan bejana selainnya. Jika seperti itu, maka bersihkanlah dahulu kemudian makanlah dengan bejana tersebut.'\"",
        "body": "Ia berkata, \"Saya pernah bertanya kepada Rasulullah (saw.), 'Wahai Rasulullah, sesungguhnya kami tinggal di daerah Ahli Kitab. Bolehkah kami makan dengan bejana mereka?' Rasulullah (saw.) menjawab, 'Janganlah kalian makan dengan bejana mereka kecuali jika kalian tidak mendapatkan bejana selainnya. Jika seperti itu, maka bersihkanlah dahulu kemudian makanlah dengan bejana tersebut.'\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 21. Halaman: 6. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Tsa'labah Al-Khusyani. "
    },
    {
        "id": "BM.1.2.22",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 22. Halaman: 6. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Imran bin Hushain. Tambahan informasi: Diriwayatkan dalam hadits yang panjang.. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) dan para sahabatnya berwudhu dari <i>mazadah<\/i> (tempat penampungan air yang terbuat dari kulit binatang) milik seorang perempuan musyrik.",
        "body": "Disebutkan bahwa Rasulullah (saw.) dan para sahabatnya berwudhu dari <i>mazadah<\/i> (tempat penampungan air yang terbuat dari kulit binatang) milik seorang perempuan musyrik.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 22. Halaman: 6. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Imran bin Hushain. "
    },
    {
        "id": "BM.1.2.23",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 23. Halaman: 6. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Anas bin Malik. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa bejana Rasulullah (saw.) pernah retak. Kemudian beliau menambal bagian yang retak itu dengan pengikat dari perak.",
        "body": "Disebutkan bahwa bejana Rasulullah (saw.) pernah retak. Kemudian beliau menambal bagian yang retak itu dengan pengikat dari perak.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Bejana-Bejana. Nomor Hadits: 23. Halaman: 6. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Anas bin Malik. "
    },
    {
        "id": "BM.1.3.24",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 24. Halaman: 6. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) pernah ditanya tentang khamar (minuman memabukkan) yang dijadikan cuka. Maka Rasulullah (saw.) bersabda, \"Tidak boleh.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) pernah ditanya tentang khamar (minuman memabukkan) yang dijadikan cuka. Maka Rasulullah (saw.) bersabda, \"Tidak boleh.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 24. Halaman: 6. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. "
    },
    {
        "id": "BM.1.3.25",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 25. Halaman: 7. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa di saat perang Khaibar, Rasulullah (saw.) memerintahkan Abu Thalhah untuk menyampaikan pengumuman. Lantas Abu Thalhah pun berseru, \"Sesungguhnya Allah dan Rasul-Nya melarang kalian memakan daging keledai jinak (bukan yang liar) karena ia dianggap kotor.\"",
        "body": "Ia mengatakan bahwa di saat perang Khaibar, Rasulullah (saw.) memerintahkan Abu Thalhah untuk menyampaikan pengumuman. Lantas Abu Thalhah pun berseru, \"Sesungguhnya Allah dan Rasul-Nya melarang kalian memakan daging keledai jinak (bukan yang liar) karena ia dianggap kotor.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 25. Halaman: 7. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. "
    },
    {
        "id": "BM.1.3.26",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 26. Halaman: 7. Riwayat: Ahmad, Tirmidzi. Derajat: Shahih. Perawi dari: Amru bin Kharijah. Tambahan informasi: -. Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) pernah berkhutbah dari atas tunggangannya di Mina. Saat itu, air liur hewan tunggangan tersebut mengalir di atas pundakku.",
        "body": "Ia berkata bahwa Rasulullah (saw.) pernah berkhutbah dari atas tunggangannya di Mina. Saat itu, air liur hewan tunggangan tersebut mengalir di atas pundakku.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 26. Halaman: 7. Riwayat: Ahmad, Tirmidzi. Derajat: Shahih. Perawi dari: Amru bin Kharijah. "
    },
    {
        "id": "BM.1.3.27",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 27. Halaman: 7. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) pernah mencuci (membasuh) bagian pakaian yang terkena air mani. Setelah itu, Rasulullah keluar untuk menunaikan shalat dengan pakaian tersebut. Saya sendiri masih melihat bekas cucian itu.",
        "body": "Ia berkata bahwa Rasulullah (saw.) pernah mencuci (membasuh) bagian pakaian yang terkena air mani. Setelah itu, Rasulullah keluar untuk menunaikan shalat dengan pakaian tersebut. Saya sendiri masih melihat bekas cucian itu.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 27. Halaman: 7. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.1.3.28",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 28. Halaman: 7. Riwayat: Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: Masih dalam riwayat Muslim, disebutkan, \"Aku benar-benar pernah mengerik air mani yang sudah kering di pakaian beliau dengan kukuku.\". Bunyi Hadits: Disebutkan dengan redaksi \"Aku benar-benar pernah menggosok (bekas air mani) dari pakaian Rasulullah (saw.). Kemudian beliau melaksanakan shalat dengan mengenakan pakaian tersebut.",
        "body": "Disebutkan dengan redaksi \"Aku benar-benar pernah menggosok (bekas air mani) dari pakaian Rasulullah (saw.). Kemudian beliau melaksanakan shalat dengan mengenakan pakaian tersebut.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 28. Halaman: 7. Riwayat: Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.1.3.29",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 29. Halaman: 7. Riwayat: Abu Daud, Nasa'i. Derajat: Shahih oleh Hakim. Perawi dari: Abu Samh. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Bekas air kencing bayi perempuan harus dicuci dan bekas air kencing bayi laki-laki cukup diperciki dengan air.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Bekas air kencing bayi perempuan harus dicuci dan bekas air kencing bayi laki-laki cukup diperciki dengan air.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 29. Halaman: 7. Riwayat: Abu Daud, Nasa'i. Derajat: Shahih oleh Hakim. Perawi dari: Abu Samh. "
    },
    {
        "id": "BM.1.3.30",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 30. Halaman: 8. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Asma binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah bersabda tentang darah haid yang mengenai pakaian, \"Engkau kikis darah tersebut, engkau gosok dengan air kemudian engkau percikkan dengan air. Setelah itu, baru engkau boleh sholat dengan pakaian tersebut.\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah bersabda tentang darah haid yang mengenai pakaian, \"Engkau kikis darah tersebut, engkau gosok dengan air kemudian engkau percikkan dengan air. Setelah itu, baru engkau boleh sholat dengan pakaian tersebut.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 30. Halaman: 8. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Asma binti Abu Bakar. "
    },
    {
        "id": "BM.1.3.31",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 31. Halaman: 8. Riwayat: Tirmidzi. Derajat: Dhaif. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia berkata bahwa Khaulah pernah bertanya, \"Wahai Rasulullah, bagaimana jika darah haid itu tidak hilang? Beliau menjawab, \"Engkau cukup membersihkannya dengan air dan bekasnya tidak menjadi masalah.\"",
        "body": "Ia berkata bahwa Khaulah pernah bertanya, \"Wahai Rasulullah, bagaimana jika darah haid itu tidak hilang? Beliau menjawab, \"Engkau cukup membersihkannya dengan air dan bekasnya tidak menjadi masalah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Menghilangkan Najis dan Penjelasannya. Nomor Hadits: 31. Halaman: 8. Riwayat: Tirmidzi. Derajat: Dhaif. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.4.32",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 32. Halaman: 8. Riwayat: Malik, Ahmad, Nasa'i. Derajat: Shahih oleh Ibnu Khuzaimah, Muallaq oleh Bukhari. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Dari Rasulullah (saw.) bahwa beliau bersabda, \"Seandainya tidak memberatkan atas umatku niscaya aku perintahkan mereka untuk bersiwak (menggosok gigi dengan kayu Arak) pada setiap kali wudhu.\"",
        "body": "Dari Rasulullah (saw.) bahwa beliau bersabda, \"Seandainya tidak memberatkan atas umatku niscaya aku perintahkan mereka untuk bersiwak (menggosok gigi dengan kayu Arak) pada setiap kali wudhu.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 32. Halaman: 8. Riwayat: Malik, Ahmad, Nasa'i. Derajat: Shahih oleh Ibnu Khuzaimah, Muallaq oleh Bukhari. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.4.33",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 33. Halaman: 8-9. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Humran. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Utsman pernah meminta air wudhu. Setelah disuguhkan, ia membasuh kedua telapak tangannya tiga kali, lalu berkumur dan menghisap air ke dalam hidung dan menghembuskannya keluar. kemudian membasuh wajahnya tiga kali, membasuh tangan kanannya hingga siku-siku tiga kali dan tangan kirinya pun begitu pula. Setelah itu, ia mengusap kepalanya, lalu membasuh kaki kanannya hingga kedua mata kaki tiga kali dan kaki kirinya pun begitu pula. Kemudian ia berkata, \"Saya melihat Rasulullah (saw.) berwudhu seperti wudhuku ini.\"",
        "body": "Disebutkan bahwa Utsman pernah meminta air wudhu. Setelah disuguhkan, ia membasuh kedua telapak tangannya tiga kali, lalu berkumur dan menghisap air ke dalam hidung dan menghembuskannya keluar. kemudian membasuh wajahnya tiga kali, membasuh tangan kanannya hingga siku-siku tiga kali dan tangan kirinya pun begitu pula. Setelah itu, ia mengusap kepalanya, lalu membasuh kaki kanannya hingga kedua mata kaki tiga kali dan kaki kirinya pun begitu pula. Kemudian ia berkata, \"Saya melihat Rasulullah (saw.) berwudhu seperti wudhuku ini.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 33. Halaman: 8-9. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Humran. "
    },
    {
        "id": "BM.1.4.34",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 34. Halaman: 9. Riwayat: Abu Daud. Derajat: Shahih. Perawi dari: Ali bin Abi Thalib. Tambahan informasi: Tirmidzi dan Nasa'i juga meriwayatkannya dengan sanad yang shahih bahkan Tirmidzi menyatakan bahwa ini adalah hadits yang paling shahih pada bab tersebut.. Bunyi Hadits: Disebutkan bahwa ia berkata tentang cara Rasulullah (saw.) berwudhu, \"Beliau mengusap kepalanya satu kali saja.\"",
        "body": "Disebutkan bahwa ia berkata tentang cara Rasulullah (saw.) berwudhu, \"Beliau mengusap kepalanya satu kali saja.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 34. Halaman: 9. Riwayat: Abu Daud. Derajat: Shahih. Perawi dari: Ali bin Abi Thalib. "
    },
    {
        "id": "BM.1.4.35",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 35. Halaman: 9. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Yazid bin 'Ashim. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa ia berkata tentang cara berwudhu dia berkata, \"Rasulullah (saw.) mengusap kepalanya dengan kedua tangannya dari muka ke belakang dan dari belakang ke muka.\"",
        "body": "Disebutkan bahwa ia berkata tentang cara berwudhu dia berkata, \"Rasulullah (saw.) mengusap kepalanya dengan kedua tangannya dari muka ke belakang dan dari belakang ke muka.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 35. Halaman: 9. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Yazid bin 'Ashim. "
    },
    {
        "id": "BM.1.4.36",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 36. Halaman: 9. Riwayat: Abu Daud, Nasa'i. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Abdullah bin Amru. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa ia berkata tentang cara berwudhu, \"Kemudian beliau mengusap kepalanya dan memasukkan kedua jari telunjuknya ke dalam kedua telinganya dan mengusap bagian luar kedua telinganya dengan ibu jarinya.\"",
        "body": "Disebutkan bahwa ia berkata tentang cara berwudhu, \"Kemudian beliau mengusap kepalanya dan memasukkan kedua jari telunjuknya ke dalam kedua telinganya dan mengusap bagian luar kedua telinganya dengan ibu jarinya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 36. Halaman: 9. Riwayat: Abu Daud, Nasa'i. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Abdullah bin Amru. "
    },
    {
        "id": "BM.1.4.37",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 37. Halaman: 9-10. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila seseorang di antara kalian bangun dari tidurnya maka hendaklah ia menghisap air ke dalam hidungnya tiga kali dan menghembuskannya keluar. Hal itu disebabkan karena syaithan tidur di dalam rongga hidungnya.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila seseorang di antara kalian bangun dari tidurnya maka hendaklah ia menghisap air ke dalam hidungnya tiga kali dan menghembuskannya keluar. Hal itu disebabkan karena syaithan tidur di dalam rongga hidungnya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 37. Halaman: 9-10. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.4.38",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 38. Halaman: 11. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: Lafadznya menurut riwayat Muslim.. Bunyi Hadits: Disebutkan, \"Apabila seseorang di antara kamu bangun dari tidurnya maka janganlah ia langsung memasukkan tangannya ke dalam tempat air sebelum mencucinya tiga kali terlebih dahulu. Hal tersebut disebabkan ia tidak mengetahui apa yang telah disentuh oleh tangannya di waktu ia tertidur.\"",
        "body": "Disebutkan, \"Apabila seseorang di antara kamu bangun dari tidurnya maka janganlah ia langsung memasukkan tangannya ke dalam tempat air sebelum mencucinya tiga kali terlebih dahulu. Hal tersebut disebabkan ia tidak mengetahui apa yang telah disentuh oleh tangannya di waktu ia tertidur.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 38. Halaman: 11. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.4.39",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 39. Halaman: 10. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Laqith bin Shabirah. Tambahan informasi: Menurut riwayat Abu Daud disebutkan, \"Jika engkau berwudhu, maka berkumurlah.\". Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) bersabda, \"Sempurnakanlah berwudhu, usaplah sela-sela jari, dan isaplah air ke dalam hidung dalam-dalam kecuali jika engkau sedang berpuasa.\"",
        "body": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Sempurnakanlah berwudhu, usaplah sela-sela jari, dan isaplah air ke dalam hidung dalam-dalam kecuali jika engkau sedang berpuasa.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 39. Halaman: 10. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Laqith bin Shabirah. "
    },
    {
        "id": "BM.1.4.40",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 40. Halaman: 10. Riwayat: Tirmidzi. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Utsman bin Affan. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) menyeka-nyeka jenggotnya saat berwudhu. \n",
        "body": "Disebutkan bahwa Rasulullah (saw.) menyeka-nyeka jenggotnya saat berwudhu. \n",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 40. Halaman: 10. Riwayat: Tirmidzi. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Utsman bin Affan. "
    },
    {
        "id": "BM.1.4.41",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 41. Halaman: 10. Riwayat: Ahmad. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Abdullah bin Zaid. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah diberi air sebanyak dua pertiga mud. Kemudian beliau gunakan untuk menggosok kedua tangannya. ",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah diberi air sebanyak dua pertiga mud. Kemudian beliau gunakan untuk menggosok kedua tangannya. ",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 41. Halaman: 10. Riwayat: Ahmad. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Abdullah bin Zaid. "
    },
    {
        "id": "BM.1.4.42",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 42. Halaman: 11. Riwayat: Baihaqi. Derajat: -. Perawi dari: Utsman bin Affan. Tambahan informasi: Sedangkan menurut riwayat Muslim dengan jalan periwayatan yang sama disebutkan, \"Beliau mengusap kepalanya dengan air yang bukan sisa dari yang digunakan untuk mengusap kedua tangannya.\" Inilah lafadz yang mahfudh.. Bunyi Hadits: Disebutkan bahwa ia pernah melihat Rasulullah (saw.) mengambil air untuk mengusap kedua telinganya selain air yang digunakannya untuk mengusap kepalanya.",
        "body": "Disebutkan bahwa ia pernah melihat Rasulullah (saw.) mengambil air untuk mengusap kedua telinganya selain air yang digunakannya untuk mengusap kepalanya.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 42. Halaman: 11. Riwayat: Baihaqi. Derajat: -. Perawi dari: Utsman bin Affan. "
    },
    {
        "id": "BM.1.4.43",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 43. Halaman: 11. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: Lafadz menurut riwayat Muslim.. Bunyi Hadits: Ia berkata, \"Aku mendengar Rasulullah (saw.) bersabda, 'Sesungguhnya umatku akan datang pada hari kiamat dalam keadaan wajah dan tangan yang berkilauan dari bekas wudhu. Maka barangsiapa di antara kalian yang dapat memperpanjang kilauannya hendaklah ia mengerjakannya.",
        "body": "Ia berkata, \"Aku mendengar Rasulullah (saw.) bersabda, 'Sesungguhnya umatku akan datang pada hari kiamat dalam keadaan wajah dan tangan yang berkilauan dari bekas wudhu. Maka barangsiapa di antara kalian yang dapat memperpanjang kilauannya hendaklah ia mengerjakannya.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 43. Halaman: 11. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.4.44",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 44. Halaman: 11. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) suka mendahulukan yang kanan dalam bersandal, menyisir rambut, bersuci, dan dalam segala hal.",
        "body": "Ia berkata bahwa Rasulullah (saw.) suka mendahulukan yang kanan dalam bersandal, menyisir rambut, bersuci, dan dalam segala hal.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 44. Halaman: 11. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.1.4.45",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 45. Halaman: 11. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila kalian berwudhu maka mulailah dengan bagian-bagian anggota wudhu yang kanan.\"",
        "body": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila kalian berwudhu maka mulailah dengan bagian-bagian anggota wudhu yang kanan.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 45. Halaman: 11. Riwayat: Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.4.46",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 46. Halaman: 11. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Mughirah bin Syu'bah. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah berwudhu. Saat itu mengusap ubun-ubunnya, bagian atas sorbannya, dan kedua <i>khuf<\/i>-nya.",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah berwudhu. Saat itu mengusap ubun-ubunnya, bagian atas sorbannya, dan kedua <i>khuf<\/i>-nya.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 46. Halaman: 11. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Mughirah bin Syu'bah. "
    },
    {
        "id": "BM.1.4.47",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 47. Halaman: 12. Riwayat: Nasa'i, Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. Tambahan informasi: Diriwayatkan oleh Nasa'i dengan kalimat perintah sedang Muslim meriwayatkannya dengan kalimat berita.. Bunyi Hadits: Ia berkata tentang cara haji Rasulullah (saw.) disebutkan bahwa beliau pernah bersabda, \"Mulailah dengan apa yang telah dimulai oleh Allah.\"",
        "body": "Ia berkata tentang cara haji Rasulullah (saw.) disebutkan bahwa beliau pernah bersabda, \"Mulailah dengan apa yang telah dimulai oleh Allah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 47. Halaman: 12. Riwayat: Nasa'i, Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. "
    },
    {
        "id": "BM.1.4.48",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 48. Halaman: 12. Riwayat: Daruquthni. Derajat: Dhaif. Perawi dari: Jabir bin Abdullah. Tambahan informasi: -. Bunyi Hadits: Ia berkata jika Rasulullah (saw.) berwudhu, maka beliau mengalirkan air pada kedua siku-sikunya.",
        "body": "Ia berkata jika Rasulullah (saw.) berwudhu, maka beliau mengalirkan air pada kedua siku-sikunya.",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 48. Halaman: 12. Riwayat: Daruquthni. Derajat: Dhaif. Perawi dari: Jabir bin Abdullah. "
    },
    {
        "id": "BM.1.4.49",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 49. Halaman: 12. Riwayat: Ahmad, Abu Daud, Ibnu Majah. Derajat: Dhaif. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "body": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 49. Halaman: 12. Riwayat: Ahmad, Abu Daud, Ibnu Majah. Derajat: Dhaif. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.1.4.50",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 50. Halaman: 12. Riwayat: Tirmidzi. Derajat: -. Perawi dari: Said bin Zaid. Tambahan informasi: Hadits yang serupa dengan hadits nomor 49. Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "body": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 50. Halaman: 12. Riwayat: Tirmidzi. Derajat: -. Perawi dari: Said bin Zaid. "
    },
    {
        "id": "BM.1.4.51",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 51. Halaman: 12. Riwayat: Ahmad. Derajat: -. Perawi dari: Abu Sa'id. Tambahan informasi: Sama seperti hadits nomor 49. Ahmad berkata, \"Tidak dapat ditetapkan suatu hukum apapun berdasarkan hadits itu.\". Bunyi Hadits: Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "body": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 51. Halaman: 12. Riwayat: Ahmad. Derajat: -. Perawi dari: Abu Sa'id. "
    },
    {
        "id": "BM.1.4.52",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 52. Halaman: 12. Riwayat: Abu Daud. Derajat: Dhaif. Perawi dari: Thalhah bin Musharrif. Tambahan informasi: -. Bunyi Hadits: Dari ayahnya, dari kakeknya, ia berkata, \"Aku pernah melihat Rasulullah (saw.) memisahkan antara berkumur dan menghirup air melalui hidung.\"",
        "body": "Dari ayahnya, dari kakeknya, ia berkata, \"Aku pernah melihat Rasulullah (saw.) memisahkan antara berkumur dan menghirup air melalui hidung.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 52. Halaman: 12. Riwayat: Abu Daud. Derajat: Dhaif. Perawi dari: Thalhah bin Musharrif. "
    },
    {
        "id": "BM.1.4.53",
        "content": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 53. Halaman: 12. Riwayat: Abu Daud, Nasa'i. Derajat: -. Perawi dari: Ali bin Abi Thalib. Tambahan informasi: -. Bunyi Hadits: Disebutkan tentang cara berwudhu, \"Kemudian Rasulullah (saw.) berkumur dan menghisap air melalui hidung sebanyak tiga kali dengan telapak tangan yang digunakan untuk mengambil air.\"",
        "body": "Disebutkan tentang cara berwudhu, \"Kemudian Rasulullah (saw.) berkumur dan menghisap air melalui hidung sebanyak tiga kali dengan telapak tangan yang digunakan untuk mengambil air.\"",
        "header": "Kitab: Bulughul Maram. Bab: Thaharah (I). Subbab: Wudhu. Nomor Hadits: 53. Halaman: 12. Riwayat: Abu Daud, Nasa'i. Derajat: -. Perawi dari: Ali bin Abi Thalib. "
    },
    {
        "id": "BM.3.0.534",
        "content": "Kitab: Bulughul Maram. Bab: Jenazah (III). Subbab: Jenazah. Nomor Hadits: 534. Halaman: 126. Riwayat: Tirmidzi, Nasa'i. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Perbanyaklah menyebut penghancur kenikmatan, yaitu kematian.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Perbanyaklah menyebut penghancur kenikmatan, yaitu kematian.\"",
        "header": "Kitab: Bulughul Maram. Bab: Jenazah (III). Subbab: Jenazah. Nomor Hadits: 534. Halaman: 126. Riwayat: Tirmidzi, Nasa'i. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.3.0.535",
        "content": "Kitab: Bulughul Maram. Bab: Jenazah (III). Subbab: Jenazah. Nomor Hadits: 535. Halaman: 126. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Janganlah sekali-kali seseorang di antara kamu mengharapkan kematian karena hanya kesusahan (musibah) yang menimpanya. Dan bila ia terpaksa melakukannya, hendaknya ia berdoa: <i>'Ya Allah hidupkanlah aku selama kehidupan itu lebih baik bagiku dan wafatkanlah aku jika sekiranya itu lebih baik bagiku.'<\/i>\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Janganlah sekali-kali seseorang di antara kamu mengharapkan kematian karena hanya kesusahan (musibah) yang menimpanya. Dan bila ia terpaksa melakukannya, hendaknya ia berdoa: <i>'Ya Allah hidupkanlah aku selama kehidupan itu lebih baik bagiku dan wafatkanlah aku jika sekiranya itu lebih baik bagiku.'<\/i>\"",
        "header": "Kitab: Bulughul Maram. Bab: Jenazah (III). Subbab: Jenazah. Nomor Hadits: 535. Halaman: 126. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. "
    },
    {
        "id": "BM.4.0.600",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat. Nomor Hadits: 600. Halaman: 140-142. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Anas bin Malik. Tambahan informasi: -. Bunyi Hadits: Abu Bakar Ash-Shiddiq (ra.) pernah menulis surat kepadanya. Isinya: \"Ini adalah kewajiban zakat yang diwajibkan oleh Rasulullah (saw.) atas kaum muslimin. Yang diperintahkan Allah atas Rasul-Nya ialah setiap 24 ekor unta ke bawah wajib mengeluarkan kambing, yaitu setiap kelipatan lima ekor unta zakatnya seekor kambing. Jika mencapai 25 hingga 35 ekor unta, maka zakatnya seekor anak unta betina yang umurnya telah menginjak tahun ke dua. Jika tidak ada, maka zakatnya seekor anak unta jantan yang umurnya telah menginjak utahun ketiga.<br>Jika mencapai 46 hingga 60 ekor unta, zakatnya seekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Jika mencapai 61 hingga 75 ekor unta, zakatnya seekor unta betina yang umurnya telah masuk tahun kelima. Jika mencapai 76 hingga 90 ekor unta, zakatnya dua ekor anak unta betina yang umurnya telah menginjak tahun kedua. <br>Jika mencapai 91 hingga 120 ekor unta, maka zakatnya adalah dua ekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Bila jumlahnya lebih dari 120, maka zakat di setiap 40 ekor adalah seekor anak unta betina yang umurnya masuk tahun ke tiga dan setiap 50 ekor zakatnya adalah seekor unta betina yang umurnya masuk tahun keempat. Bagi yang hanya memiliki empat ekor unta, tidak wajib atasnya zakat kecuali bila pemiliknya menginginkannya.<br>Mengenai zakat kambing yang dilepas mencari makan sendiri, jika mencapai 40 hingga 120 ekor kambing, zakatnya seekor kambing. Jika lebih dari 120 hingga 200 ekor kambing, zakatnya dua ekor kambing. Jika lebih dari 200 hingga 300 kambing, zakatnya tiga ekor kambing. Jika lebih dari 300 ekor kambing, maka setiap 100 ekor zakatnya seekor kambing. Apabila jumlah kambing yang dilepas mencari makan sendiri kurang dari 40 ekor, maka tidak wajib atasnya zakat kecuali jika pemiliknya menginginkan. <br>Tidak boleh dikumpulkan antara hewan-hewan ternak terpisah dan tidak boleh dipisahkan antara hewan-hewan ternak yang terkumpul karena takut mengeluarkan zakat. Hewan ternak kumpulan dari dua orang, maka harus kembali dibagi rata antara keduanya pada waktu zakat telah tiba. Tidak boleh dikeluarkan untuk zakat hewan yang tua dan yang cacat, kecuali jika pemiliknya menghendakinya. Tentang zakat perak, setiap 200 dirham zakatnya seperempatnya. Namun, jika hanya 190 dirham, tidak wajib atasnya zakat kecuali bila pemiliknya menghendakinya. <br>Barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang seumurnya masuk tahun kelima, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkannya ditambah dua ekor kambing jika tidak menyulitkannya, atau 20 dirham. Barangsiapa yang sudah wajib mengeluarkan seekor anak unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kelima, maka ia boleh mengeluarkannya ditambah 20 dirham atau dua ekor kambing.\".",
        "body": "Abu Bakar Ash-Shiddiq (ra.) pernah menulis surat kepadanya. Isinya: \"Ini adalah kewajiban zakat yang diwajibkan oleh Rasulullah (saw.) atas kaum muslimin. Yang diperintahkan Allah atas Rasul-Nya ialah setiap 24 ekor unta ke bawah wajib mengeluarkan kambing, yaitu setiap kelipatan lima ekor unta zakatnya seekor kambing. Jika mencapai 25 hingga 35 ekor unta, maka zakatnya seekor anak unta betina yang umurnya telah menginjak tahun ke dua. Jika tidak ada, maka zakatnya seekor anak unta jantan yang umurnya telah menginjak utahun ketiga.<br>Jika mencapai 46 hingga 60 ekor unta, zakatnya seekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Jika mencapai 61 hingga 75 ekor unta, zakatnya seekor unta betina yang umurnya telah masuk tahun kelima. Jika mencapai 76 hingga 90 ekor unta, zakatnya dua ekor anak unta betina yang umurnya telah menginjak tahun kedua. <br>Jika mencapai 91 hingga 120 ekor unta, maka zakatnya adalah dua ekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Bila jumlahnya lebih dari 120, maka zakat di setiap 40 ekor adalah seekor anak unta betina yang umurnya masuk tahun ke tiga dan setiap 50 ekor zakatnya adalah seekor unta betina yang umurnya masuk tahun keempat. Bagi yang hanya memiliki empat ekor unta, tidak wajib atasnya zakat kecuali bila pemiliknya menginginkannya.<br>Mengenai zakat kambing yang dilepas mencari makan sendiri, jika mencapai 40 hingga 120 ekor kambing, zakatnya seekor kambing. Jika lebih dari 120 hingga 200 ekor kambing, zakatnya dua ekor kambing. Jika lebih dari 200 hingga 300 kambing, zakatnya tiga ekor kambing. Jika lebih dari 300 ekor kambing, maka setiap 100 ekor zakatnya seekor kambing. Apabila jumlah kambing yang dilepas mencari makan sendiri kurang dari 40 ekor, maka tidak wajib atasnya zakat kecuali jika pemiliknya menginginkan. <br>Tidak boleh dikumpulkan antara hewan-hewan ternak terpisah dan tidak boleh dipisahkan antara hewan-hewan ternak yang terkumpul karena takut mengeluarkan zakat. Hewan ternak kumpulan dari dua orang, maka harus kembali dibagi rata antara keduanya pada waktu zakat telah tiba. Tidak boleh dikeluarkan untuk zakat hewan yang tua dan yang cacat, kecuali jika pemiliknya menghendakinya. Tentang zakat perak, setiap 200 dirham zakatnya seperempatnya. Namun, jika hanya 190 dirham, tidak wajib atasnya zakat kecuali bila pemiliknya menghendakinya. <br>Barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang seumurnya masuk tahun kelima, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkannya ditambah dua ekor kambing jika tidak menyulitkannya, atau 20 dirham. Barangsiapa yang sudah wajib mengeluarkan seekor anak unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kelima, maka ia boleh mengeluarkannya ditambah 20 dirham atau dua ekor kambing.\".",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat. Nomor Hadits: 600. Halaman: 140-142. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Anas bin Malik. "
    },
    {
        "id": "BM.4.0.601",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat. Nomor Hadits: 601. Halaman: 142-143. Riwayat: Ahmad, Abu Daud, Ibnu Majah, Nasa'i, Tirmidzi. Derajat: Shahih oleh Ibnu Hibban dan Hakim.. Perawi dari: Mu'adz bin Jabal. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah mengutusnya ke negeri Yaman. Beliau memerintahkan untuk mengambil (zakat) dari 30 ekor sapi, seekor anak sapi berumur setahun lebih yang jantan atau betina, dan setiap 40 ekor sapi, seekor sapi betina berumur dua tahun lebih, dan dari setiap orang yang telah baligh diambil satu dinar atau yang sebanding dengan nilai itu pada kaum Mu'afar.",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah mengutusnya ke negeri Yaman. Beliau memerintahkan untuk mengambil (zakat) dari 30 ekor sapi, seekor anak sapi berumur setahun lebih yang jantan atau betina, dan setiap 40 ekor sapi, seekor sapi betina berumur dua tahun lebih, dan dari setiap orang yang telah baligh diambil satu dinar atau yang sebanding dengan nilai itu pada kaum Mu'afar.",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat. Nomor Hadits: 601. Halaman: 142-143. Riwayat: Ahmad, Abu Daud, Ibnu Majah, Nasa'i, Tirmidzi. Derajat: Shahih oleh Ibnu Hibban dan Hakim.. Perawi dari: Mu'adz bin Jabal. "
    },
    {
        "id": "BM.4.1.627",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat Fitrah. Nomor Hadits: 627. Halaman: 148. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) mewajibkan zakat fitrah sebesar satu <i>sha'<\/i> kurma atau satu sha' sya'ir atas seorang hamba, orang merdeka, laki-laki dan perempuan, besar kecil dari orang-orang islam; dan beliau memerintahkan agar dikeluarkan sebelum kaum muslimin keluar menunaikan sholat 'Ied.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) mewajibkan zakat fitrah sebesar satu <i>sha'<\/i> kurma atau satu sha' sya'ir atas seorang hamba, orang merdeka, laki-laki dan perempuan, besar kecil dari orang-orang islam; dan beliau memerintahkan agar dikeluarkan sebelum kaum muslimin keluar menunaikan sholat 'Ied.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat Fitrah. Nomor Hadits: 627. Halaman: 148. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.4.1.630",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat Fitrah. Nomor Hadits: 630. Halaman: 149. Riwayat: Abu Daud, Ibnu Majah. Derajat: Shahih oleh Hakim. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) mewajibkan zakat fitrah sebagai pembersih bagi orang yang berpuasa dari perkataan yang tidak berguna dan kotor, dan sebagai makanan bagi orang-orang miskin. Maka barangsiapa yang mengeluarkannya sebelum sholat 'Ied dilaksanakan, maka menjadi zakat yang diterima dan barangsiapa mengeluarkannya setelah sholat 'Ied, ia menjadi sedekah biasa.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) mewajibkan zakat fitrah sebagai pembersih bagi orang yang berpuasa dari perkataan yang tidak berguna dan kotor, dan sebagai makanan bagi orang-orang miskin. Maka barangsiapa yang mengeluarkannya sebelum sholat 'Ied dilaksanakan, maka menjadi zakat yang diterima dan barangsiapa mengeluarkannya setelah sholat 'Ied, ia menjadi sedekah biasa.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Zakat Fitrah. Nomor Hadits: 630. Halaman: 149. Riwayat: Abu Daud, Ibnu Majah. Derajat: Shahih oleh Hakim. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.4.2.631",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 631. Halaman: 150. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) bersabda, 'Tujuh macam orang yang akan dilindungi Allah pada hari yang tidak ada lindungan kecuali lindungan-Nya' Kemudian ia (perawi) menyebutkan (kelanjutan) hadits dan didalamnya disebutkan 'Orang yang bersedekah namun ia menyembunyikannya sehingga tangan kirinya tidak mengetahui apa yang dikeluarkan oleh tangan kanannya.\".",
        "body": "Ia berkata, \"Rasulullah (saw.) bersabda, 'Tujuh macam orang yang akan dilindungi Allah pada hari yang tidak ada lindungan kecuali lindungan-Nya' Kemudian ia (perawi) menyebutkan (kelanjutan) hadits dan didalamnya disebutkan 'Orang yang bersedekah namun ia menyembunyikannya sehingga tangan kirinya tidak mengetahui apa yang dikeluarkan oleh tangan kanannya.\".",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 631. Halaman: 150. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.4.2.634",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 634. Halaman: 150-151. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Hakim bin Hazm. Tambahan informasi: Lafadznya milik Bukhari. Bunyi Hadits: Dari Rasulullah (saw.), beliau bersabda, \"Tangan yang di atas (pemberi) lebih baik daripada tangan yang di bawah (penerima). Dan mulailah (memberi) kepada orang-orang yang banyak tanggungannya. Sebaik-baik sedekah adalah yang diambil dari sisa kebutuhan sendiri. Barangsiapa yang menjaga kehormatannya, maka Allah akan menjaganya. Dan barangsiapa merasa cukup, maka Allah akan mencukupkan kebutuhannya.\"",
        "body": "Dari Rasulullah (saw.), beliau bersabda, \"Tangan yang di atas (pemberi) lebih baik daripada tangan yang di bawah (penerima). Dan mulailah (memberi) kepada orang-orang yang banyak tanggungannya. Sebaik-baik sedekah adalah yang diambil dari sisa kebutuhan sendiri. Barangsiapa yang menjaga kehormatannya, maka Allah akan menjaganya. Dan barangsiapa merasa cukup, maka Allah akan mencukupkan kebutuhannya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 634. Halaman: 150-151. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Hakim bin Hazm. "
    },
    {
        "id": "BM.4.2.637",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 637. Halaman: 151-152. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Apabila seorang perempuan menginfakkan sebagian makanan di rumahnya tanpa merusak (keunganan rumah tangga) maka ia mendapatkan pahala atas apa yang ia infakkan. Bahkan suaminya juga mendapatkan pahalanya karena ia yang bekerja mencari rezeki, dan begitu pula bagi yang menyimpannya. Sebagian dari mereka tidak mengurangi sedikit pun pahala dari sebagian lainnya.\" ",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Apabila seorang perempuan menginfakkan sebagian makanan di rumahnya tanpa merusak (keunganan rumah tangga) maka ia mendapatkan pahala atas apa yang ia infakkan. Bahkan suaminya juga mendapatkan pahalanya karena ia yang bekerja mencari rezeki, dan begitu pula bagi yang menyimpannya. Sebagian dari mereka tidak mengurangi sedikit pun pahala dari sebagian lainnya.\" ",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 637. Halaman: 151-152. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.4.2.639",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 639. Halaman: 152. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Orang yang selalu mengemis kepada orang lain, maka di hari kiamat kelak ia akan datang (bangkit) dengan tidak memiliki segumpal daging pun di bagian wajahnya.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Orang yang selalu mengemis kepada orang lain, maka di hari kiamat kelak ia akan datang (bangkit) dengan tidak memiliki segumpal daging pun di bagian wajahnya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 639. Halaman: 152. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.4.2.640",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 640. Halaman: 152. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa meminta-minta kepada orang lain dengan tujuan memperkaya diri, maka sesungguhnya ia meminta bara api. Oleh karenanya, ia dipersilakan meminta sedikit atau banyak.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa meminta-minta kepada orang lain dengan tujuan memperkaya diri, maka sesungguhnya ia meminta bara api. Oleh karenanya, ia dipersilakan meminta sedikit atau banyak.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 640. Halaman: 152. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.4.2.641",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 641. Halaman: 152-153. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Zubair bin 'Awwam. Tambahan informasi: -. Bunyi Hadits: Dari Rasulullah (saw.), beliau bersabda, \"Seorang di antara kalian yang mengambil talinya, lalu bekerja mencari dan membawa seonggok kayu di atas punggungnya, kemudian menjualnya dan dengan hasilnya ia menjaga kehormatannya adalah lebih baik ketimbang ia mengemis kepada orang lain, baik mereka memberinya atau menolaknya.\"",
        "body": "Dari Rasulullah (saw.), beliau bersabda, \"Seorang di antara kalian yang mengambil talinya, lalu bekerja mencari dan membawa seonggok kayu di atas punggungnya, kemudian menjualnya dan dengan hasilnya ia menjaga kehormatannya adalah lebih baik ketimbang ia mengemis kepada orang lain, baik mereka memberinya atau menolaknya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 641. Halaman: 152-153. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Zubair bin 'Awwam. "
    },
    {
        "id": "BM.4.2.642",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 642. Halaman: 153. Riwayat: Tirmidzi. Derajat: Shahih oleh Tirmidzi. Perawi dari: Samurah bin Jundab. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Meminta-minta (mengemis) adalah tindakan seseorang yang mencakar mukanya sendiri. Kecuali jika ia meminta-minta kepada penguasa atau karena suatu hal yang amat perlu dan mendesak.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Meminta-minta (mengemis) adalah tindakan seseorang yang mencakar mukanya sendiri. Kecuali jika ia meminta-minta kepada penguasa atau karena suatu hal yang amat perlu dan mendesak.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Sedekah. Nomor Hadits: 642. Halaman: 153. Riwayat: Tirmidzi. Derajat: Shahih oleh Tirmidzi. Perawi dari: Samurah bin Jundab. "
    },
    {
        "id": "BM.4.3.645",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Penyaluran Zakat. Nomor Hadits: 645. Halaman: 154. Riwayat: Muslim, Abu Daud, Ibnu Khuzaimah, Ibnu Hibban. Derajat: Shahih. Perawi dari: Qabishah bin Mukhoriq. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya meminta-minta (mengemis) tidak dihalalkan kecuali untuk salah satu golongan dari tiga golongan yang dihalalkan. Yaitu orang yang menanggung utang orang lain, maka dibolehkan baginya untuk meminta-minta sampai ia mampu melunasinya dan kemudian ia harus berhenti. Lalu orang yang tertimpa musibah hingga menghabiskan seluruh hartanya, maka dibolehkan baginya untuk meminta-minta sampai ia mendapatkan sandaran (rezeki) hidup. Dan orang yang ditimpa kesengsaraan hidup hingga tiga orang dari kaumnya yang mengetahuinya menyatakan, 'Si fulan ditimpa kesengsaraan hidup.' Maka dibolehkan baginya untuk meminta-minta sampai mendapatkan sandaran (rezeki) hidup. Jadi, tindakan meminta-minta yang dilakukan oleh selain tiga golongan tersebut, wahai Qabishah, adalah haram dan orang yang memakannya telah memakan yang haram.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya meminta-minta (mengemis) tidak dihalalkan kecuali untuk salah satu golongan dari tiga golongan yang dihalalkan. Yaitu orang yang menanggung utang orang lain, maka dibolehkan baginya untuk meminta-minta sampai ia mampu melunasinya dan kemudian ia harus berhenti. Lalu orang yang tertimpa musibah hingga menghabiskan seluruh hartanya, maka dibolehkan baginya untuk meminta-minta sampai ia mendapatkan sandaran (rezeki) hidup. Dan orang yang ditimpa kesengsaraan hidup hingga tiga orang dari kaumnya yang mengetahuinya menyatakan, 'Si fulan ditimpa kesengsaraan hidup.' Maka dibolehkan baginya untuk meminta-minta sampai mendapatkan sandaran (rezeki) hidup. Jadi, tindakan meminta-minta yang dilakukan oleh selain tiga golongan tersebut, wahai Qabishah, adalah haram dan orang yang memakannya telah memakan yang haram.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Penyaluran Zakat. Nomor Hadits: 645. Halaman: 154. Riwayat: Muslim, Abu Daud, Ibnu Khuzaimah, Ibnu Hibban. Derajat: Shahih. Perawi dari: Qabishah bin Mukhoriq. "
    },
    {
        "id": "BM.4.3.646",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Penyaluran Zakat. Nomor Hadits: 646. Halaman: 154. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdul Muttholib bin Rabi'ah bin Harits. Tambahan informasi: Dalam sebuah riwayat, disebutkan: \"Sesungguhnya zakat tidak halal bagi Muhammad dan keluarga Muhammad\". Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya zakat itu tidak patut diberikan kepada keluarga Muhammad, karena ia sebenarnya adalah kotoran manusia.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya zakat itu tidak patut diberikan kepada keluarga Muhammad, karena ia sebenarnya adalah kotoran manusia.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Penyaluran Zakat. Nomor Hadits: 646. Halaman: 154. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdul Muttholib bin Rabi'ah bin Harits. "
    },
    {
        "id": "BM.4.3.649",
        "content": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Penyaluran Zakat. Nomor Hadits: 649. Halaman: 155. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Salim bin Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Dari ayahnya, disebutkan bahwa Rasulullah (saw.) pernah memberikan sesuatu kepada Umar bin Khattab (ra.). Lalu ia berkata, \"Berikanlah ini kepada orang yang lebih membutuhkan daripada diriku.\" Beliau bersabda, \"Ambillah, lalu simpanlah atau bersedekahlah dengannya. Dan apa yang datang kepadamu dari harta semacam ini, padahal engkau tidak membutuhkannya dan tidak memintanya, maka ambillah. Jika tidak demikian, maka jangan turuti nafsumu.\"",
        "body": "Dari ayahnya, disebutkan bahwa Rasulullah (saw.) pernah memberikan sesuatu kepada Umar bin Khattab (ra.). Lalu ia berkata, \"Berikanlah ini kepada orang yang lebih membutuhkan daripada diriku.\" Beliau bersabda, \"Ambillah, lalu simpanlah atau bersedekahlah dengannya. Dan apa yang datang kepadamu dari harta semacam ini, padahal engkau tidak membutuhkannya dan tidak memintanya, maka ambillah. Jika tidak demikian, maka jangan turuti nafsumu.\"",
        "header": "Kitab: Bulughul Maram. Bab: Zakat (IV). Subbab: Penyaluran Zakat. Nomor Hadits: 649. Halaman: 155. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Salim bin Abdullah bin Umar. "
    },
    {
        "id": "BM.5.0.650",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 650. Halaman: 156. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Janganlah engkau mendahului Ramadhan dengan berpuasa sehari atau dua hari sebelumnya. Kecuali bagi orang yang terbiasa berpuasa, maka dibolehkan baginya untuk berpuasa.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Janganlah engkau mendahului Ramadhan dengan berpuasa sehari atau dua hari sebelumnya. Kecuali bagi orang yang terbiasa berpuasa, maka dibolehkan baginya untuk berpuasa.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 650. Halaman: 156. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.5.0.654",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 654. Halaman: 157. Riwayat: Abu Daud. Derajat: Shahih oleh Hakim dan Ibnu Hibban. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Orang-orang melihat bulan sabit, lalu aku beritahukan kepada Rasulullah (saw.) bahwa aku benar-benar telah melihatnya. Akhirnya beliau berpuasa dan menyuruh orang-orang agar berpuasa.\"",
        "body": "Ia berkata, \"Orang-orang melihat bulan sabit, lalu aku beritahukan kepada Rasulullah (saw.) bahwa aku benar-benar telah melihatnya. Akhirnya beliau berpuasa dan menyuruh orang-orang agar berpuasa.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 654. Halaman: 157. Riwayat: Abu Daud. Derajat: Shahih oleh Hakim dan Ibnu Hibban. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.5.0.658",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 658. Halaman: 158. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Sahal bin Sa'ad. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) bersabda, \"Orang-orang akan tetap berada dalam kebaikan selama mereka menyegerakan berbuka puasa.\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) bersabda, \"Orang-orang akan tetap berada dalam kebaikan selama mereka menyegerakan berbuka puasa.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 658. Halaman: 158. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Sahal bin Sa'ad. "
    },
    {
        "id": "BM.5.0.660",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 660. Halaman: 158. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Santaplah hidangan sahur kalian, karena sesungguhnya dalam menyantap hidangan sahur itu mengandung keberkahan.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Santaplah hidangan sahur kalian, karena sesungguhnya dalam menyantap hidangan sahur itu mengandung keberkahan.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 660. Halaman: 158. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Anas bin Malik. "
    },
    {
        "id": "BM.5.0.664",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 664. Halaman: 160. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: Lafadznya menurut riwayat Muslim. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) pernah mencium sewaktu berpuasa dan mencumbu saat berpuasa. Namun beliau adalah orang yang paling kuat menahan nafsunya di antara kalian semua.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) pernah mencium sewaktu berpuasa dan mencumbu saat berpuasa. Namun beliau adalah orang yang paling kuat menahan nafsunya di antara kalian semua.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 664. Halaman: 160. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.5.0.673",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 673. Halaman: 162. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Hamzah bin Amru. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Wahai Rasulullah, sesungguhnya aku kuat untuk tetap berpuasa dalam perjalanan. Namun apakah aku berdosa (jika melakukannya)?\" Rasulullah (saw.) menjawab, \"Ia (tidak berpuasa dalam perjalanan) adalah keringanan dari Allah, barangsiapa yang melaksanakan keringanan itu maka dianggap baik. Namun barangsiapa memilih untuk berpuasa, maka ia tidak berdosa.\"",
        "body": "Ia berkata, \"Wahai Rasulullah, sesungguhnya aku kuat untuk tetap berpuasa dalam perjalanan. Namun apakah aku berdosa (jika melakukannya)?\" Rasulullah (saw.) menjawab, \"Ia (tidak berpuasa dalam perjalanan) adalah keringanan dari Allah, barangsiapa yang melaksanakan keringanan itu maka dianggap baik. Namun barangsiapa memilih untuk berpuasa, maka ia tidak berdosa.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 673. Halaman: 162. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Hamzah bin Amru. "
    },
    {
        "id": "BM.5.0.677",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 677. Halaman: 163. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar, Ummu Salamah. Tambahan informasi: Muslim menambahkan di dalam hadits Ummu Salamah: \"Dan beliau tidak meng-<i>qadha<\/i> puasanya\". Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah memasuki waktu pagi dalam keadaan junub karena bersetubuh. Kemudian beliau mandi dan tetap berpuasa.",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah memasuki waktu pagi dalam keadaan junub karena bersetubuh. Kemudian beliau mandi dan tetap berpuasa.",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 677. Halaman: 163. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar, Ummu Salamah. "
    },
    {
        "id": "BM.5.0.679",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 679. Halaman: 163. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) bersabda, \"Barangsiapa meninggal dunia sedangkan ia masih memiliki tanggungan puasa (wajib), maka walinya yang berpuasa untuknya (melunasinya).\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) bersabda, \"Barangsiapa meninggal dunia sedangkan ia masih memiliki tanggungan puasa (wajib), maka walinya yang berpuasa untuknya (melunasinya).\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa. Nomor Hadits: 679. Halaman: 163. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.5.1.680",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 680. Halaman: 164. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Qatadah. Tambahan informasi: -. Bunyi Hadits: Rasulullah (saw.) pernah ditanya mengenai puasa hari Arafah. Lalu beliau menjawab, \"Puasa Arafah dapat menghapus dosa-dosa tahun lalu dan yang akan datang.\" Beliau juga ditanya tentang puasa hari Asyura, lalu beliau menjawab, \"Puasa itu dapat menghapus dosa-dosa tahun yang lalu.\" Dan ketika ditanya tentang puasa hari Senin, beliau menjawab, \"Ia adalah hari kelahiranku, hari aku diutus, dan hari diturunkan Al-Qur'an kepadaku.\"",
        "body": "Rasulullah (saw.) pernah ditanya mengenai puasa hari Arafah. Lalu beliau menjawab, \"Puasa Arafah dapat menghapus dosa-dosa tahun lalu dan yang akan datang.\" Beliau juga ditanya tentang puasa hari Asyura, lalu beliau menjawab, \"Puasa itu dapat menghapus dosa-dosa tahun yang lalu.\" Dan ketika ditanya tentang puasa hari Senin, beliau menjawab, \"Ia adalah hari kelahiranku, hari aku diutus, dan hari diturunkan Al-Qur'an kepadaku.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 680. Halaman: 164. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Qatadah. "
    },
    {
        "id": "BM.5.1.681",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 681. Halaman: 164. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Ayyub Al-Anshary. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa telah berpuasa Ramadhan, kemudian diikutinya dengan berpuasa enam hari di bulan Syawal, maka ia seperti berpuasa setahun lamanya.\"",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa telah berpuasa Ramadhan, kemudian diikutinya dengan berpuasa enam hari di bulan Syawal, maka ia seperti berpuasa setahun lamanya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 681. Halaman: 164. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Ayyub Al-Anshary. "
    },
    {
        "id": "BM.5.1.682",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 682. Halaman: 164. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Said Al-Khudry. Tambahan informasi: Lafadz ada pada Muslim. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Tidaklah seorang hamba berpuasa sehari saat perang di jalan Allah, melainkan Dia akan menjauhkan dirinya dengan puasa itu dari api neraka sejauh jarak perjalanan 70 tahun.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Tidaklah seorang hamba berpuasa sehari saat perang di jalan Allah, melainkan Dia akan menjauhkan dirinya dengan puasa itu dari api neraka sejauh jarak perjalanan 70 tahun.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 682. Halaman: 164. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Said Al-Khudry. "
    },
    {
        "id": "BM.5.1.684",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 684. Halaman: 165. Riwayat: Nasa'i, Tirmidzi. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Abu Dzar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) memerintahkan kita untuk puasa tiga hari dalam sebulan, yaitu pada tanggal 13,14, dan 15.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) memerintahkan kita untuk puasa tiga hari dalam sebulan, yaitu pada tanggal 13,14, dan 15.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 684. Halaman: 165. Riwayat: Nasa'i, Tirmidzi. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Abu Dzar. "
    },
    {
        "id": "BM.5.1.685",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 685. Halaman: 165. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: Lafadznya menurut riwayat Bukhari. Abu Daud menambahkann: \"Kecuali pada bulan Ramadhan.\". Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) bersabda, \"Tidak diperbolehkan bagi seorang perempuan berpuasa di saat suaminya di rumah (bersamanya), kecuali dengan seizinnya.\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) bersabda, \"Tidak diperbolehkan bagi seorang perempuan berpuasa di saat suaminya di rumah (bersamanya), kecuali dengan seizinnya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 685. Halaman: 165. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.5.1.686",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 686. Halaman: 165. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Said Al-Khudry. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) melarang berpuasa pada dua hari, yaitu pada hari raya Idul Fitri dan hari raya Idul Adha.",
        "body": "Disebutkan bahwa Rasulullah (saw.) melarang berpuasa pada dua hari, yaitu pada hari raya Idul Fitri dan hari raya Idul Adha.",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 686. Halaman: 165. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Said Al-Khudry. "
    },
    {
        "id": "BM.5.1.688",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 688. Halaman: 165-166. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Umar, 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Keduanya berkata, \"Tidak diizinkan berpuasa pada hari-hari <i>tasyriq<\/i>, kecuali bagi orang yang tidak mendapatkan hewan <i>hady<\/i> (hewan kurban di Mina saat ibadah haji).\"",
        "body": "Keduanya berkata, \"Tidak diizinkan berpuasa pada hari-hari <i>tasyriq<\/i>, kecuali bagi orang yang tidak mendapatkan hewan <i>hady<\/i> (hewan kurban di Mina saat ibadah haji).\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 688. Halaman: 165-166. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Umar, 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.5.1.689",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 689. Halaman: 166. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Dari Rasulullah (saw.), beliau bersabda, \"Janganlah mengkhususkan malam Jum'at dibanding malam-malam lainnya untuk melaksanakan <i>qiyamul lail<\/i>. Dan janganlah kalian mengkhususkan hari Jum'at untuk berpuasa dibanding hari-hari lainnya, kecuali jika seseorang di antara kamu sudah terbiasa berpuasa sebelumnya (hari Jum'at).\"",
        "body": "Dari Rasulullah (saw.), beliau bersabda, \"Janganlah mengkhususkan malam Jum'at dibanding malam-malam lainnya untuk melaksanakan <i>qiyamul lail<\/i>. Dan janganlah kalian mengkhususkan hari Jum'at untuk berpuasa dibanding hari-hari lainnya, kecuali jika seseorang di antara kamu sudah terbiasa berpuasa sebelumnya (hari Jum'at).\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 689. Halaman: 166. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.5.1.693",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 693. Halaman: 167. Riwayat: Nasa'i. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Ummu Salamah. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) paling sering puasa pada hari Sabtu dan Ahad dibanding dengan hari-hari lainnya. Beliau bersabda, \"Dua hari tersebut adalah hari-hari raya orang musyrik dan aku ingin menentang mereka.\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) paling sering puasa pada hari Sabtu dan Ahad dibanding dengan hari-hari lainnya. Beliau bersabda, \"Dua hari tersebut adalah hari-hari raya orang musyrik dan aku ingin menentang mereka.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: Puasa Sunnah dan yang Dilarang. Nomor Hadits: 693. Halaman: 167. Riwayat: Nasa'i. Derajat: Shahih oleh Ibnu Khuzaimah. Perawi dari: Ummu Salamah. "
    },
    {
        "id": "BM.5.2.697",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 697. Halaman: 167. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa melakukan ibadah Ramadhan dengan penuh keimanan dan mengharap ridha-Nya, maka diampuni dosa-dosanya yang telah lewat.\"",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa melakukan ibadah Ramadhan dengan penuh keimanan dan mengharap ridha-Nya, maka diampuni dosa-dosanya yang telah lewat.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 697. Halaman: 167. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.5.2.698",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 698. Halaman: 167-168. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Jika Rasulullah (saw.) telah memasuki sepuluh hari terakhir dari bulan Ramadhan, maka beliau mengencangkan kain sarungnya (bersungguh-sungguh), menghidupkan malamnya (dengan ibadah), dan membangunkan keluarganya.\"",
        "body": "Ia berkata, \"Jika Rasulullah (saw.) telah memasuki sepuluh hari terakhir dari bulan Ramadhan, maka beliau mengencangkan kain sarungnya (bersungguh-sungguh), menghidupkan malamnya (dengan ibadah), dan membangunkan keluarganya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 698. Halaman: 167-168. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.5.2.699",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 699. Halaman: 168. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) selalu beri'tikaf pada sepuluh hari terakhir dari bulan Ramadhan hingga beliau wafat. Setelah wafatnya, para istri Rasulullah (saw.) juga beri'tikaf.",
        "body": "Disebutkan bahwa Rasulullah (saw.) selalu beri'tikaf pada sepuluh hari terakhir dari bulan Ramadhan hingga beliau wafat. Setelah wafatnya, para istri Rasulullah (saw.) juga beri'tikaf.",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 699. Halaman: 168. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.5.2.701",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 701. Halaman: 168. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: Lafadznya milik Bukhari. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) pernah memasukkan kepalanya ke dalam rumah (sementara beliau di dalam masjid), lalu aku menyisir rambutnya. Dan jika beliau beri'tikaf, maka beliau tidak masuk ke rumah, kecuali untuk suatu keperluan.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) pernah memasukkan kepalanya ke dalam rumah (sementara beliau di dalam masjid), lalu aku menyisir rambutnya. Dan jika beliau beri'tikaf, maka beliau tidak masuk ke rumah, kecuali untuk suatu keperluan.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 701. Halaman: 168. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.5.2.704",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 704. Halaman: 169. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa beberapa shahabat Rasulullah (saw.) melihat <i>lailatul qadr<\/i> di dalam mimpi, yang jatuh di tujuh malam terakhir. Maka Rasulallah (saw.) bersabda, \"Aku telah ditunjukkan kebenaran tentang mimpimu pada tujuh malam yang terakhir, maka barangsiapa ingin mencarinya hendaknya ia mencari pada tujuh malam terakhir.\"",
        "body": "Disebutkan bahwa beberapa shahabat Rasulullah (saw.) melihat <i>lailatul qadr<\/i> di dalam mimpi, yang jatuh di tujuh malam terakhir. Maka Rasulallah (saw.) bersabda, \"Aku telah ditunjukkan kebenaran tentang mimpimu pada tujuh malam yang terakhir, maka barangsiapa ingin mencarinya hendaknya ia mencari pada tujuh malam terakhir.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 704. Halaman: 169. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.5.2.707",
        "content": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 707. Halaman: 170. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Said Al-Khudry. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Tidak ada perjalanan kecuali ke tiga masjid, yaitu Masjidil Haram, Masjidku ini, dan Masjidil Aqsha.\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Tidak ada perjalanan kecuali ke tiga masjid, yaitu Masjidil Haram, Masjidku ini, dan Masjidil Aqsha.\"",
        "header": "Kitab: Bulughul Maram. Bab: Puasa (V). Subbab: I'tikaf dan Qiyam Ramadhan. Nomor Hadits: 707. Halaman: 170. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Said Al-Khudry. "
    },
    {
        "id": "BM.6.1.708",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 708. Halaman: 171. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Umrah ke umrah menghapus dosa-dosa (yang dilakukan) di antara keduanya, dan tidak ada pahala bagi haji mabrur kecuali surga.\"",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Umrah ke umrah menghapus dosa-dosa (yang dilakukan) di antara keduanya, dan tidak ada pahala bagi haji mabrur kecuali surga.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 708. Halaman: 171. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.6.1.714",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 714. Halaman: 172. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah bertemu dengan suatu kafilah di Rauhaa, lalu beliau bertanya, \"Siapa rombongan ini?\" Mereka berkata, \"Siapa engkau?\" Beliau menjawab, \"Rasulullah.\" Kemudian seorang perempuan mengangkat seorang anak kecil seraya bertanya: \"Apakah yang ini boleh berhaji?\" Beliau bersabda, \"Ya boleh, dan engkau mendapatkan pahalanya.\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah bertemu dengan suatu kafilah di Rauhaa, lalu beliau bertanya, \"Siapa rombongan ini?\" Mereka berkata, \"Siapa engkau?\" Beliau menjawab, \"Rasulullah.\" Kemudian seorang perempuan mengangkat seorang anak kecil seraya bertanya: \"Apakah yang ini boleh berhaji?\" Beliau bersabda, \"Ya boleh, dan engkau mendapatkan pahalanya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 714. Halaman: 172. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.6.1.716",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 716. Halaman: 173. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Ada seorang perempuan dari Juhainah datang menemui Rasulullah (saw.), lalu berkata, \"Sesungguhnya ibuku telah bernadzar untuk menunaikan haji. Namun ia belum melaksanakannya hingga akhirnya meninggal dunia. Jadi apakah aku harus berhaji untuknya?\" Beliau bersabda, \"Ya, berhajilah untuknya. Bagaimana pendapatmu seandainya ibumu menanggung beban hutang, tidakkah engkau akan melunasinya?! Bayarlah pada Allah, karena Allah lebih berhak untuk ditepati janji-Nya (dilaksanakan hak-Nya, yaitu haji).\"",
        "body": "Disebutkan bahwa Ada seorang perempuan dari Juhainah datang menemui Rasulullah (saw.), lalu berkata, \"Sesungguhnya ibuku telah bernadzar untuk menunaikan haji. Namun ia belum melaksanakannya hingga akhirnya meninggal dunia. Jadi apakah aku harus berhaji untuknya?\" Beliau bersabda, \"Ya, berhajilah untuknya. Bagaimana pendapatmu seandainya ibumu menanggung beban hutang, tidakkah engkau akan melunasinya?! Bayarlah pada Allah, karena Allah lebih berhak untuk ditepati janji-Nya (dilaksanakan hak-Nya, yaitu haji).\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 716. Halaman: 173. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.6.1.718",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 718. Halaman: 173-174. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: Lafadznya milik Muslim. Bunyi Hadits: Ia berkata, \"Aku pernah mendengar Rasulullah (saw.) menyampaikan khutbah dan beliau bersabda, 'Janganlah sekali-kali seorang laki-laki menyepi dengan seorang perempuan kecuali dengan mahramnya, dan janganlah seorang perempuan bepergian kecuali bersama mahramnya.' Lalu seorang laki-laki berdiri dan berkata, 'Wahai Rasulullah, sesungguhnya istriku pergi haji sedang aku diwajibkan ikut perang ini dan itu.' Maka beliau bersabda, 'Berangkatlah dan berhajilah bersama istrimu.'\"",
        "body": "Ia berkata, \"Aku pernah mendengar Rasulullah (saw.) menyampaikan khutbah dan beliau bersabda, 'Janganlah sekali-kali seorang laki-laki menyepi dengan seorang perempuan kecuali dengan mahramnya, dan janganlah seorang perempuan bepergian kecuali bersama mahramnya.' Lalu seorang laki-laki berdiri dan berkata, 'Wahai Rasulullah, sesungguhnya istriku pergi haji sedang aku diwajibkan ikut perang ini dan itu.' Maka beliau bersabda, 'Berangkatlah dan berhajilah bersama istrimu.'\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Keutamaan Haji dan Pihak yang Wajib Melaksanakannya. Nomor Hadits: 718. Halaman: 173-174. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.6.2.722",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Miqat-Miqat. Nomor Hadits: 722. Halaman: 175. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) menentukan Dzul Khulaifah sebagai miqat penduduk Madinah, Juhfah sebagai miqat penduduk Syam, Qarnul Manazil sebagai miqat penduduk Najd, dan Yalamlam sebagai miqat penduduk Yaman. Tempat-tempat tersebut adalah miqat bagi penduduknya, dan bagi mereka yang datang ke sana dari penduduk (negeri lain) yang ingin menunaikan haji dan umrah. Barangsiapa yang tinggal (di dalam lokasi yang letaknya lebih dekat ke Makkah dari miqat-miqat itu), maka dia berihram dari tempat tinggalnya, hingga penduduk Makkah pun miqatnya dari Makkah.\"",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) menentukan Dzul Khulaifah sebagai miqat penduduk Madinah, Juhfah sebagai miqat penduduk Syam, Qarnul Manazil sebagai miqat penduduk Najd, dan Yalamlam sebagai miqat penduduk Yaman. Tempat-tempat tersebut adalah miqat bagi penduduknya, dan bagi mereka yang datang ke sana dari penduduk (negeri lain) yang ingin menunaikan haji dan umrah. Barangsiapa yang tinggal (di dalam lokasi yang letaknya lebih dekat ke Makkah dari miqat-miqat itu), maka dia berihram dari tempat tinggalnya, hingga penduduk Makkah pun miqatnya dari Makkah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Miqat-Miqat. Nomor Hadits: 722. Halaman: 175. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.6.3.727",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan Sifatnya. Nomor Hadits: 727. Halaman: 176. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Kami pernah pergi bersama Rasulullah (saw.) pada waktu Haji Wada'. Saat itu, di antara kami ada yang berihram untuk umrah, ada yang berihram untuk haji dan umrah, dan ada yang berihram untuk haji. Sedangkan Rasulullah (saw.) berihram untuk haji. Bagi yang berihram untuk umrah, ia boleh menanggalkan ihramnya (tahallul) sewaktu datang (ke kota Makkah). Adapun bagi yang berihram untuk haji atau menggabungkan antara haji dan umrah, ia tidak boleh menanggalkan ihramnya sampai pada hari Raya Qurban.\"",
        "body": "Ia berkata, \"Kami pernah pergi bersama Rasulullah (saw.) pada waktu Haji Wada'. Saat itu, di antara kami ada yang berihram untuk umrah, ada yang berihram untuk haji dan umrah, dan ada yang berihram untuk haji. Sedangkan Rasulullah (saw.) berihram untuk haji. Bagi yang berihram untuk umrah, ia boleh menanggalkan ihramnya (tahallul) sewaktu datang (ke kota Makkah). Adapun bagi yang berihram untuk haji atau menggabungkan antara haji dan umrah, ia tidak boleh menanggalkan ihramnya sampai pada hari Raya Qurban.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan Sifatnya. Nomor Hadits: 727. Halaman: 176. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.6.4.728",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 728. Halaman: 176. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) tidak pernah berihram kecuali dari masjid.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) tidak pernah berihram kecuali dari masjid.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 728. Halaman: 176. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.6.4.731",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 731. Halaman: 177. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: Lafadznya milik riwayat Muslim.. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah ditanya, \"Pakaian apa yang boleh dikenakan oleh orang yang berihram?\" Beliau menjawab, \"Janganlah kalian memakai baju, surban, celana, penutup kepala (topi dan sejenisnya), dan sepatu (<i>khuf<\/i>) kecuali seseorang yang tidak memiliki sandal, ia boleh menggunakan sepatu. Namun hendaknya ia memotong bagian yang lebih bawah dari mata kaki. Selain itu, janganlah memakai pakaian yang diolesi dengan minyak <i>Za'faran<\/i> dan <i>Wars<\/i>.'\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah ditanya, \"Pakaian apa yang boleh dikenakan oleh orang yang berihram?\" Beliau menjawab, \"Janganlah kalian memakai baju, surban, celana, penutup kepala (topi dan sejenisnya), dan sepatu (<i>khuf<\/i>) kecuali seseorang yang tidak memiliki sandal, ia boleh menggunakan sepatu. Namun hendaknya ia memotong bagian yang lebih bawah dari mata kaki. Selain itu, janganlah memakai pakaian yang diolesi dengan minyak <i>Za'faran<\/i> dan <i>Wars<\/i>.'\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 731. Halaman: 177. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.6.4.733",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 733. Halaman: 177. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Utsman bin Affan. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Orang yang sedang berihram tidak diperbolehkan menikah, menikahkan, dan melamar.\"",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Orang yang sedang berihram tidak diperbolehkan menikah, menikahkan, dan melamar.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 733. Halaman: 177. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Utsman bin Affan. "
    },
    {
        "id": "BM.6.4.736",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 736. Halaman: 178. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Ada lima binatang yang semuanya jahat, yang boleh dibunuh baik di tanah halal maupun haram. Yaitu kalajengking, burung elang, burung gagak, tikus, dan anjing galak.'\"",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Ada lima binatang yang semuanya jahat, yang boleh dibunuh baik di tanah halal maupun haram. Yaitu kalajengking, burung elang, burung gagak, tikus, dan anjing galak.'\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 736. Halaman: 178. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.6.4.737",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 737. Halaman: 178. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) pernah berbekam ketika beliau sedang berihram.",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) pernah berbekam ketika beliau sedang berihram.",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 737. Halaman: 178. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.6.4.738",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 738. Halaman: 178. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Ka'ab bin Ujrah. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Aku pernah dihadapkan kepada Rasulullah (saw.) sementara kutu-kutu bertaburan di mukaku. Lalu Rasulullah (saw.) berkata, \"Aku tidak mengira penyakitmu begitu parah seperti yang kulihat, apakah engkau mampu (berkurban) seekor kambing?\" Aku menjawab, \"Tidak.\" Beliau berkata, \"Puasalah tiga hari, atau berilah makan enam orang miskin masing-masing setengah <i>sha'<\/i>.\"",
        "body": "Ia berkata, \"Aku pernah dihadapkan kepada Rasulullah (saw.) sementara kutu-kutu bertaburan di mukaku. Lalu Rasulullah (saw.) berkata, \"Aku tidak mengira penyakitmu begitu parah seperti yang kulihat, apakah engkau mampu (berkurban) seekor kambing?\" Aku menjawab, \"Tidak.\" Beliau berkata, \"Puasalah tiga hari, atau berilah makan enam orang miskin masing-masing setengah <i>sha'<\/i>.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 738. Halaman: 178. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Ka'ab bin Ujrah. "
    },
    {
        "id": "BM.6.4.739",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 739. Halaman: 179. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Ketika Allah menundukkan kota Makkah untuk Rasulullah (saw.), beliau berdiri di tengah orang-orang, lalu memuji Allah dan menyanjung-Nya, kemudian bersabda, 'Sesungguhnya Allah telah melindungi kota Makkah dari pasukan gajah dan menyerahkan kekuasaannya kepada Rasul-Nya dan orang-orang yang beriman. Dan sesungguhnya kota ini tidak halal bagi seorang pun sebelumku. Ia hanya dihalalkan bagiku sebentar pada waktu siang, dan tidak dihalalkan bagi seorang pun setelahku. Oleh karena itu, binatang buruan yang ada di dalamnya tidak boleh dikejar, duri pohon yang tumbuh di dalamnya tidak boleh dipatahkan, benda-benda yang jatuh tidak boleh diambil kecuali bagi orang yang mengumumkannya. Dan barangsiapa terbunuh, maka keluarganya boleh memilih yang terbaik antara dua perkara (denda atau qishash).' lalu Abbas berkata, 'kecuali tumbuhan <i>idzkhar<\/i>, wahai Rasulullah. Sebab kami menggunakannya di kuburan dan rumah kami.' Beliau bersabda, 'Kecuali tumbuhan <i>idzkhar<\/i>.'\"",
        "body": "Ia berkata, \"Ketika Allah menundukkan kota Makkah untuk Rasulullah (saw.), beliau berdiri di tengah orang-orang, lalu memuji Allah dan menyanjung-Nya, kemudian bersabda, 'Sesungguhnya Allah telah melindungi kota Makkah dari pasukan gajah dan menyerahkan kekuasaannya kepada Rasul-Nya dan orang-orang yang beriman. Dan sesungguhnya kota ini tidak halal bagi seorang pun sebelumku. Ia hanya dihalalkan bagiku sebentar pada waktu siang, dan tidak dihalalkan bagi seorang pun setelahku. Oleh karena itu, binatang buruan yang ada di dalamnya tidak boleh dikejar, duri pohon yang tumbuh di dalamnya tidak boleh dipatahkan, benda-benda yang jatuh tidak boleh diambil kecuali bagi orang yang mengumumkannya. Dan barangsiapa terbunuh, maka keluarganya boleh memilih yang terbaik antara dua perkara (denda atau qishash).' lalu Abbas berkata, 'kecuali tumbuhan <i>idzkhar<\/i>, wahai Rasulullah. Sebab kami menggunakannya di kuburan dan rumah kami.' Beliau bersabda, 'Kecuali tumbuhan <i>idzkhar<\/i>.'\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 739. Halaman: 179. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Hurairah. "
    },
    {
        "id": "BM.6.4.740",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 740. Halaman: 179. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Zaid bin 'Ashim. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya Ibrahim mengharamkan kota Makkah dan mendoakan kebaikan untuk penghuninya. Dan aku mengharamkan kota Madinah sebagaimana Ibrahim mengharamkan kota Makkah. Dan aku mendoakan (keberkahan) untuk <i>sha'<\/i> dan <i>mud<\/i>-nya seperti yang didoakan Ibrahim untuk penghuni Makkah.\"",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya Ibrahim mengharamkan kota Makkah dan mendoakan kebaikan untuk penghuninya. Dan aku mengharamkan kota Madinah sebagaimana Ibrahim mengharamkan kota Makkah. Dan aku mendoakan (keberkahan) untuk <i>sha'<\/i> dan <i>mud<\/i>-nya seperti yang didoakan Ibrahim untuk penghuni Makkah.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Ihram dan segala yang Berkenaan Dengannya. Nomor Hadits: 740. Halaman: 179. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Zaid bin 'Ashim. "
    },
    {
        "id": "BM.6.5.763",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 763. Halaman: 187. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa ia melempar <i>Jumrah Ula<\/i> dengan tujuh batu kecil, ia mengiringi dengan takbir pada setiap lemparan. Kemudian maju dan mencari tanah yang rata. Ia berdiri menghadap kiblat, berdoa dengan mengangkat tangannya dan berdiri lama. Lalu melempar <i>Jumrah Wustha<\/i>, kemudian mengambil arah kiri untuk mencari tempat yang rata. Ia berdiri menghadap kiblat, kemudian berdoa dengan mengangkat kedua tangannya dan berdiri lama. Kemudian melempar <i>Jumrah Aqabah<\/i> dari tengah lembah. Ia tidak berdiri di situ dan langsung kembali. Ia mengatakan, \"Beginilah aku melihat Rasulullah (saw.) melakukannya.\".",
        "body": "Disebutkan bahwa ia melempar <i>Jumrah Ula<\/i> dengan tujuh batu kecil, ia mengiringi dengan takbir pada setiap lemparan. Kemudian maju dan mencari tanah yang rata. Ia berdiri menghadap kiblat, berdoa dengan mengangkat tangannya dan berdiri lama. Lalu melempar <i>Jumrah Wustha<\/i>, kemudian mengambil arah kiri untuk mencari tempat yang rata. Ia berdiri menghadap kiblat, kemudian berdoa dengan mengangkat kedua tangannya dan berdiri lama. Kemudian melempar <i>Jumrah Aqabah<\/i> dari tengah lembah. Ia tidak berdiri di situ dan langsung kembali. Ia mengatakan, \"Beginilah aku melihat Rasulullah (saw.) melakukannya.\".",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 763. Halaman: 187. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.6.5.764",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 764. Halaman: 187. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) berdoa, \"Ya Allah rahmatilah orang-orang yang mencukur rambutnya.\" Lantas mereka bertanya, \"dan orang-orang yang memendekkan rambutnya, wahai Rasulullah.\" Beliau berdoa untuk yang ketiga kali, \"Dan orang-orang yang memendekkan rambutnya.\".",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) berdoa, \"Ya Allah rahmatilah orang-orang yang mencukur rambutnya.\" Lantas mereka bertanya, \"dan orang-orang yang memendekkan rambutnya, wahai Rasulullah.\" Beliau berdoa untuk yang ketiga kali, \"Dan orang-orang yang memendekkan rambutnya.\".",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 764. Halaman: 187. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.6.5.766",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 766. Halaman: 188. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Al-Miswar bin Makhramah. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) menyembelih kurban sebelum mencukur rambut dan menyuruh para shahabat untuk melakukannya.",
        "body": "Disebutkan bahwa Rasulullah (saw.) menyembelih kurban sebelum mencukur rambut dan menyuruh para shahabat untuk melakukannya.",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 766. Halaman: 188. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Al-Miswar bin Makhramah. "
    },
    {
        "id": "BM.6.5.768",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 768. Halaman: 188. Riwayat: Abu Daud. Derajat: Hasan. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Rasulullah (saw.) bersabda, \"Tidak ada kewajiban mencukur bagi perempuan, namun mereka cukup memendekkannya.\"",
        "body": "Rasulullah (saw.) bersabda, \"Tidak ada kewajiban mencukur bagi perempuan, namun mereka cukup memendekkannya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 768. Halaman: 188. Riwayat: Abu Daud. Derajat: Hasan. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.6.5.777",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 777. Halaman: 190. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Orang-orang diperintahkan agar akhir dari ibadah haji yang mereka lakukan adalah thawaf di Baitullah, tetapi diberikan keringanan bagi perempuan haid (dalam hal ini).\".",
        "body": "Ia berkata, \"Orang-orang diperintahkan agar akhir dari ibadah haji yang mereka lakukan adalah thawaf di Baitullah, tetapi diberikan keringanan bagi perempuan haid (dalam hal ini).\".",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 777. Halaman: 190. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Abbas. "
    },
    {
        "id": "BM.6.5.778",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 778. Halaman: 190. Riwayat: Ahmad. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Abdullah bin Zubair. Tambahan informasi: -. Bunyi Hadits: Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sekali sholat di masjidku ini lebih utama daripada 1000 kali sholat di masjid lainnya kecuali Masjidil Haram, dan sekali sholat di Masjidil Haram lebih utama daripada 100 kali sholat di masjidku ini.\".",
        "body": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sekali sholat di masjidku ini lebih utama daripada 1000 kali sholat di masjid lainnya kecuali Masjidil Haram, dan sekali sholat di Masjidil Haram lebih utama daripada 100 kali sholat di masjidku ini.\".",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Sifat Haji dan Memasuki Kota Makkah. Nomor Hadits: 778. Halaman: 190. Riwayat: Ahmad. Derajat: Shahih oleh Ibnu Hibban. Perawi dari: Abdullah bin Zubair. "
    },
    {
        "id": "BM.6.6.780",
        "content": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Halangan dari Pelaksanaan Haji. Nomor Hadits: 780. Halaman: 191. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) masuk ke rumah Dhuba'ah binti Az-Zubair bin Abdul Muthalib. Lalu berkata, 'Wahai Rasulullah, sesungguhnya aku ingin menunaikan haji, namun aku sakit.' Rasulullah (saw.) bersabda, 'Berhajilah dan tetapkanlah syarat bahwa tempat <i>tahallul<\/i>-ku adalah di mana aku terhalang.'\"",
        "body": "Ia berkata, \"Rasulullah (saw.) masuk ke rumah Dhuba'ah binti Az-Zubair bin Abdul Muthalib. Lalu berkata, 'Wahai Rasulullah, sesungguhnya aku ingin menunaikan haji, namun aku sakit.' Rasulullah (saw.) bersabda, 'Berhajilah dan tetapkanlah syarat bahwa tempat <i>tahallul<\/i>-ku adalah di mana aku terhalang.'\"",
        "header": "Kitab: Bulughul Maram. Bab: Haji (VI). Subbab: Halangan dari Pelaksanaan Haji. Nomor Hadits: 780. Halaman: 191. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.7.1.782",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 782. Halaman: 192. Riwayat: Al-Bazzar. Derajat: Shahih oleh Hakim. Perawi dari: Rifa'ah bin Rafi'. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) pernah ditanya, \"Pekerjaan apakah yang paling baik?.\" Beliau bersabda, \"Pekerjaan seseorang dengan tangannya dan setiap jual-beli yang bersih.\"",
        "body": "Disebutkan bahwa Rasulullah (saw.) pernah ditanya, \"Pekerjaan apakah yang paling baik?.\" Beliau bersabda, \"Pekerjaan seseorang dengan tangannya dan setiap jual-beli yang bersih.\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 782. Halaman: 192. Riwayat: Al-Bazzar. Derajat: Shahih oleh Hakim. Perawi dari: Rifa'ah bin Rafi'. "
    },
    {
        "id": "BM.7.1.783",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 783. Halaman: 193. Riwayat: Ahmad, Abu Daud, Ibnu Majah, Tirmidzi, Nasa'i. Derajat: Shahih oleh Hakim. Perawi dari: Ibnu Mas'ud. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Aku mendengar Rasulullah (saw.) bersabda, 'Apabila dua orang yang berjual beli berselisih, sedang di antara mereka tidak ada keterangan (bukti) yang jelas, maka perkataan yang benar (yang menjadi pegangan) adalah yang dikatakan oleh pemilik barang atau mereka membatalkan transaksi.'\"",
        "body": "Ia berkata, \"Aku mendengar Rasulullah (saw.) bersabda, 'Apabila dua orang yang berjual beli berselisih, sedang di antara mereka tidak ada keterangan (bukti) yang jelas, maka perkataan yang benar (yang menjadi pegangan) adalah yang dikatakan oleh pemilik barang atau mereka membatalkan transaksi.'\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 783. Halaman: 193. Riwayat: Ahmad, Abu Daud, Ibnu Majah, Tirmidzi, Nasa'i. Derajat: Shahih oleh Hakim. Perawi dari: Ibnu Mas'ud. "
    },
    {
        "id": "BM.7.1.784",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 784. Halaman: 193. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Mas'ud Al-Anshory. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwasanya Rasulullah (saw.) melarang mengambil uang hasil penjualan anjing, uang hasil pelacuran, dan uang hasil pertenungan (perdukunan).",
        "body": "Disebutkan bahwasanya Rasulullah (saw.) melarang mengambil uang hasil penjualan anjing, uang hasil pelacuran, dan uang hasil pertenungan (perdukunan).",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 784. Halaman: 193. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abu Mas'ud Al-Anshory. "
    },
    {
        "id": "BM.7.1.785",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 785. Halaman: 193-194. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. Tambahan informasi: Susunan kalimatnya milik riwayat Muslim.. Bunyi Hadits: Disebutkan bahwa ia menunggangi untanya yang sudah lemah dan ia ingin membiarkannya. Ia berkata, \"Aku bertemu Rasulullah (saw.), lalu beliau berdoa untukku dan memukul untaku.\" Kemudian unta itu berjalan tidak seperti biasanya. Lalu beliau bersabda, \"Juallah ia padaku dengan satu <i>uqiyyah<\/i>.\" Aku berkata, \"Tidak.\" Beliau bersabda lagi, \"Juallah unta itu padaku dengan harga satu <i>uqiyyah<\/i>.\" Lalu aku menjualnya dengan satu <i>uqiyyah<\/i>, namun dengan syarat aku membawanya dahulu pada keluargaku. Setelah aku melakukannya aku datang pada beliau dengan unta itu dan beliau membayar harganya kepadaku. Kemudian aku pulang dan beliau mengirim seseorang membuntutiku. Lalu beliau bersabda, \"Apakah engkau mengira aku menawarmu untuk mengambil untamu? Ambillah untamu dan uangmu, sebagai hadiah untukmu.\"",
        "body": "Disebutkan bahwa ia menunggangi untanya yang sudah lemah dan ia ingin membiarkannya. Ia berkata, \"Aku bertemu Rasulullah (saw.), lalu beliau berdoa untukku dan memukul untaku.\" Kemudian unta itu berjalan tidak seperti biasanya. Lalu beliau bersabda, \"Juallah ia padaku dengan satu <i>uqiyyah<\/i>.\" Aku berkata, \"Tidak.\" Beliau bersabda lagi, \"Juallah unta itu padaku dengan harga satu <i>uqiyyah<\/i>.\" Lalu aku menjualnya dengan satu <i>uqiyyah<\/i>, namun dengan syarat aku membawanya dahulu pada keluargaku. Setelah aku melakukannya aku datang pada beliau dengan unta itu dan beliau membayar harganya kepadaku. Kemudian aku pulang dan beliau mengirim seseorang membuntutiku. Lalu beliau bersabda, \"Apakah engkau mengira aku menawarmu untuk mengambil untamu? Ambillah untamu dan uangmu, sebagai hadiah untukmu.\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 785. Halaman: 193-194. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. "
    },
    {
        "id": "BM.7.1.786",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 786. Halaman: 194. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Seseorang di antara kami berwasiat memerdekakan seorang budak miliknya setelah ia meninggal dunia, padahal ia tidak memiliki harta selain budak tersebut. Lalu Rasulullah (saw.) memanggil budak itu dan menjualnya.\"",
        "body": "Ia berkata, \"Seseorang di antara kami berwasiat memerdekakan seorang budak miliknya setelah ia meninggal dunia, padahal ia tidak memiliki harta selain budak tersebut. Lalu Rasulullah (saw.) memanggil budak itu dan menjualnya.\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 786. Halaman: 194. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. "
    },
    {
        "id": "BM.7.1.787",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 787. Halaman: 194. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Maimunah. Tambahan informasi: Ahmad dan Nasa'i menambahkan: \"Dalam samin yang beku.\". Bunyi Hadits: Disebutkan bahwa ada seekor tikus yang jatuh ke dalam samin (minyak sejenis mentega), lalu mati di dalamnya. Kemudian hal itu ditanyakan kepada Rasulullah (saw.) dan beliau menjawab, \"Buanglah tikus dan bagian samin yang ada di sekitarnya (bangkai tikus tersebut), dan makanlah (samin yang tersisa).\"",
        "body": "Disebutkan bahwa ada seekor tikus yang jatuh ke dalam samin (minyak sejenis mentega), lalu mati di dalamnya. Kemudian hal itu ditanyakan kepada Rasulullah (saw.) dan beliau menjawab, \"Buanglah tikus dan bagian samin yang ada di sekitarnya (bangkai tikus tersebut), dan makanlah (samin yang tersisa).\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 787. Halaman: 194. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Maimunah. "
    },
    {
        "id": "BM.7.1.789",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 789. Halaman: 194. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Az-Zubair. Tambahan informasi: Nasa'i menambahan: \"Kecuali anjing pemburu.\". Bunyi Hadits: Ia berkata, \"Aku pernah bertanya kepada Jabir (ra.) tentang harga kucing dan anjing. Ia berkata, 'Rasulullah (saw.) melarang hal itu (menggunakan hasil penjualannya).'\"",
        "body": "Ia berkata, \"Aku pernah bertanya kepada Jabir (ra.) tentang harga kucing dan anjing. Ia berkata, 'Rasulullah (saw.) melarang hal itu (menggunakan hasil penjualannya).'\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 789. Halaman: 194. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Abu Az-Zubair. "
    },
    {
        "id": "BM.7.1.790",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 790. Halaman: 196. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. Tambahan informasi: Lafadznya menurut riwayat Bukhari. Menurut riwayat Muslim: \"Belilah dan merdekakanlah, dan berilah persyaratan <i>wala'<\/i> kepadanya.\". Bunyi Hadits: Ia berkata, \"Barirah datang kepadaku seraya berkata, 'Aku telah ber-<i>mukatabah<\/i> (perjanjian antara seorang budak dengan majikannya bahwa budak tersebut akan merdeka bila dapat membayar sejumlah uang yang mereka sepakati) dengan majikanku sebesar sembilan <i>uqiyyah<\/i>, dengan membayar setiap tahunnya satu <i>uqiyyah<\/i>, maka tolonglah aku.'\" Aku berkata, \"Jika majikanmu bersedia aku membayarnya kepadanya dengan syarat <i>wala'<\/i>-nya (harta warisan bagi yang memerdekakan budak) nanti untukku, maka aku akan menolongmu.\" Kemudian Barirah menghadap majikannya dan mengungkapkan hal itu, namun majikannya menolak. Barirah datang lagi sewaktu Rasulullah (saw.) sedang duduk seraya berkata, \"Aku telah menyampaikannya kepadanya, tetapi ia menolak kecuali jika wala' itu tetap miliknya.\" Rasulullah (saw.) mendengar dan 'Aisyah memberitahukan hal itu kepada Rasulullah (saw.), lalu beliau bersabda, \"Ambillah dan berilah persyaratan wala' itu kepadanya, sebab wala' itu hanya bagi orang yang memerdekakan.\" Lalu 'Aisyah melakukan hal itu. Kemudian Rasulullah (saw.) berdiri di hadapan orang-orang dan setelah memuji Allah dan menyanjung-Nya beliau bersabda, \"Amma ba'du, mengapa ada orang-orang yang memberikan persyaratan yang tidak ada dalam Al-Qur'an?. Setiap syarat yang tidak tercantum dalam Al-Qur'an adalah batil, walaupun seratus syarat. Ketetapan Allah itu lebih berhak (untuk dilaksanakan) dan syarat (yang ditetapkan) Allah itu lebih kuat, dan wala' itu hanya bagi orang yang memerdekakan.\"",
        "body": "Ia berkata, \"Barirah datang kepadaku seraya berkata, 'Aku telah ber-<i>mukatabah<\/i> (perjanjian antara seorang budak dengan majikannya bahwa budak tersebut akan merdeka bila dapat membayar sejumlah uang yang mereka sepakati) dengan majikanku sebesar sembilan <i>uqiyyah<\/i>, dengan membayar setiap tahunnya satu <i>uqiyyah<\/i>, maka tolonglah aku.'\" Aku berkata, \"Jika majikanmu bersedia aku membayarnya kepadanya dengan syarat <i>wala'<\/i>-nya (harta warisan bagi yang memerdekakan budak) nanti untukku, maka aku akan menolongmu.\" Kemudian Barirah menghadap majikannya dan mengungkapkan hal itu, namun majikannya menolak. Barirah datang lagi sewaktu Rasulullah (saw.) sedang duduk seraya berkata, \"Aku telah menyampaikannya kepadanya, tetapi ia menolak kecuali jika wala' itu tetap miliknya.\" Rasulullah (saw.) mendengar dan 'Aisyah memberitahukan hal itu kepada Rasulullah (saw.), lalu beliau bersabda, \"Ambillah dan berilah persyaratan wala' itu kepadanya, sebab wala' itu hanya bagi orang yang memerdekakan.\" Lalu 'Aisyah melakukan hal itu. Kemudian Rasulullah (saw.) berdiri di hadapan orang-orang dan setelah memuji Allah dan menyanjung-Nya beliau bersabda, \"Amma ba'du, mengapa ada orang-orang yang memberikan persyaratan yang tidak ada dalam Al-Qur'an?. Setiap syarat yang tidak tercantum dalam Al-Qur'an adalah batil, walaupun seratus syarat. Ketetapan Allah itu lebih berhak (untuk dilaksanakan) dan syarat (yang ditetapkan) Allah itu lebih kuat, dan wala' itu hanya bagi orang yang memerdekakan.\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 790. Halaman: 196. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: 'Aisyah binti Abu Bakar. "
    },
    {
        "id": "BM.7.1.793",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 793. Halaman: 196. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. Tambahan informasi: Dalam suatu riwayat ia menambahkan: \"Dan mengupahkan persetubuhan unta jantan.\". Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) melarang menjual sisa kelebihan air.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) melarang menjual sisa kelebihan air.\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 793. Halaman: 196. Riwayat: Muslim. Derajat: Shahih. Perawi dari: Jabir bin Abdullah. "
    },
    {
        "id": "BM.7.1.794",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 794. Halaman: 196. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Ia berkata, \"Rasulullah (saw.) melarang mengupahkan persetubuhan binatang jantan.\"",
        "body": "Ia berkata, \"Rasulullah (saw.) melarang mengupahkan persetubuhan binatang jantan.\"",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 794. Halaman: 196. Riwayat: Bukhari. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    },
    {
        "id": "BM.7.1.796",
        "content": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 796. Halaman: 197. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. Tambahan informasi: -. Bunyi Hadits: Disebutkan bahwa Rasulullah (saw.) melarang menjual-belikan wala' dan menghadiahkannya.",
        "body": "Disebutkan bahwa Rasulullah (saw.) melarang menjual-belikan wala' dan menghadiahkannya.",
        "header": "Kitab: Bulughul Maram. Bab: Jual Beli (VII). Subbab: Syarat-Syarat Jual Beli dan Beberapa Larangannya. Nomor Hadits: 796. Halaman: 197. Riwayat: Bukhari, Muslim. Derajat: Shahih. Perawi dari: Abdullah bin Umar. "
    }
]