[
    {
        "id": "BM.1.1.1",
        "narrator": "Abu Hurairah",
        "ar_hadith": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْبَحْرِ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ أَخْرَجَهُ الْأَرْبَعَةُ وَابْنُ أَبِي شَيْبَةَ  وَاللَّفْظُ لَهُ وَصَحَّحَهُ ابْنُ خُزَيْمَةَ وَالتِّرْمِذِيُّ وَرَوَاهُ مَالِكٌ وَالشَّافِعِيُّ وَأَحْمَدُ ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda tentang (air) laut, \"Air laut itu suci dan menyucikan, bangkainya pun halal hukumnya.\"",
        "hadith_no": "1",
        "degree": "Shahih oleh Ibnu Khuzaimah, Shahih oleh Tirmidzi",
        "comment": "Lafadz hadits berasal dari riwayat Ibnu Syaibah",
        "page": "1",
        "chapter": "Thaharah",
        "chapter_no": "1",
        "collector": "Abu Daud, Ibnu Majah, Tirmidzi, Nasa'i, Ibnu Syaibah",
        "source": "Bulughul Maram",
        "sub_chapter": "Air"
    },
    {
        "id": "BM.1.1.10",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َوَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طُهُورُ إنَاءِ أَحَدِكُمْ إذَا وَلَغَ فِيهِ الْكَلْبُ أَنْ يَغْسِلَهُ سَبْعَ مَرَّاتٍ أُولَاهُنَّ بِالتُّرَابِ أَخْرَجَهُ مُسْلِمٌ وَفِي لَفْظٍ لَهُ فَلْيُرِقْهُ وَلِلتِّرْمِذِيِّ  أُخْرَاهُنَّ أَوْ أُولَاهُنَّ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Sucinya tempat air seseorang di antara kalian jika telah dijilat anjing ialah dengan mencucinya tujuh kali. Yang pertamanya dicampur dengan debu tanah.\"",
        "degree": "Shahih",
        "comment": "Masih dalam riwayat Muslim, disebutkan, \"Hendaklah ia membuang air itu.\" Sedangkan Menurut riwayat Tirmidzi, \"Yang terakhir atau yang pertama (dicampur) dengan debu tanah.\" ",
        "page": "3",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "10",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.11",
        "narrator": "Abu Qatadah",
        "ar_hadith": "َوَعَنْ أَبِي قَتَادَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ - فِي الْهِرَّةِ - : إنَّهَا لَيْسَتْ بِنَجَسٍ إنَّمَا هِيَ مِنْ الطَّوَّافِينَ عَلَيْكُمْ أَخْرَجَهُ الْأَرْبَعَةُ وَصَحَّحَهُ التِّرْمِذِيُّ وَابْنُ خُزَيْمَة",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) pernah bersabda perihal kucing, \"Hewan kucing itu tidaklah najis, karena ia termasuk hewan yang berkeliaran di sekitar kalian.\"",
        "degree": "Shahih oleh Tirmidzi, Shahih oleh Ibnu Khuzaimah",
        "comment": "-",
        "page": "3",
        "collector": "Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "11",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.12",
        "narrator": "Anas bin Malik",
        "ar_hadith": "َوَعَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ : جَاءَ أَعْرَابِيٌّ فَبَالَ فِي طَائِفَةِ الْمَسْجِدِ فَزَجَرَهُ النَّاسُ فَنَهَاهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَى بَوْلَهُ أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَنُوبٍ مِنْ مَاءٍ؛ فَأُهْرِيقَ عَلَيْهِ مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwa seseorang Arab Badui datang kemudian buang air kecil di suatu sudut masjid. Maka orang-orang langsung menghardiknya. Namun Rasulullah (saw.) melarang tindakan mereka tersebut. Ketika ia selesai buang air kecil, maka Rasulullah (saw.) memerintahkan untuk diambilkan seember air. Lalu air itu disiramkan di atas bekas buang air kecil tersebut.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "3-4",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "12",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.13",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "َوَعَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُحِلَّتْ لَنَا مَيْتَتَانِ وَدَمَانِ. فَأَمَّا الْمَيْتَتَانِ : فَالْجَرَادُ وَالْحُوتُ وَأَمَّا الدَّمَانِ : فَالطِّحَالُ وَالْكَبِدُ أَخْرَجَهُ أَحْمَدُ وَابْنُ مَاجَهْ وَفِيهِ ضَعْفٌ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Dihalalkan bagi kita dua macam bangkai dan dua macam darah. Dua macam bangkai itu adalah belalang dan ikan, sedangkan dua macam darah adalah hati dan jantung.\"",
        "degree": "-",
        "comment": "Di dalam sanadnya terdapat kelemahan",
        "page": "4",
        "collector": "Ahmad, Ibnu Majah",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "13",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.14",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َوَعَنْ أَبِي هُرَيْرَةَ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إذَا وَقَعَ الذُّبَابُ فِي شَرَابِ أَحَدِكُمْ فَلْيَغْمِسْهُ ثُمَّ لِيَنْزِعْهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً وَفِي الْآخَرِ شِفَاءً أَخْرَجَهُ الْبُخَارِيُّ وَأَبُو دَاوُد . وَزَادَ وَإِنَّهُ يَتَّقِي بِجَنَاحِهِ الَّذِي فِيهِ الدَّاءُ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila ada lalat jatuh ke dalam minuman seseorang di antara kamu maka benamkanlah lalat itu kemudian keluarkanlah. Karena pada salah satu sayapnya terdapat penyakit dan pada sayap lainnya ada obat penawar.\"",
        "degree": "-",
        "comment": "Dikeluarkan oleh Bukhari dan Abu Daud dengan tambahan, \"Dan hendaknya ia waspada dengan sayap yang ada penyakitnya.\"",
        "page": "4",
        "collector": "-",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "14",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.15",
        "narrator": "Abu Waqid Al-Laitsi",
        "ar_hadith": "َوَعَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قُطِعَ مِنْ الْبَهِيمَةِ - وَهِيَ حَيَّةٌ - فَهُوَ مَيِّتٌ أَخْرَجَهُ أَبُو دَاوُد وَالتِّرْمِذِيُّ وَحَسَّنَهُ وَاللَّفْظُ لَهُ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Anggota tubuh yang terpotong dari binatang yang masih hidup adalah termasuk bangkai.\"",
        "degree": "Shahih oleh Abu Daud, Shahih oleh Tirmidzi",
        "comment": "Lafadz hadits ini menurut Tirmidzi.",
        "page": "4",
        "collector": "Abu Daud, Tirmidzi",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "15",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.2",
        "narrator": "Abu Said Al-Khudry",
        "ar_hadith": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إنَّ الْمَاءَ طَهُورٌ لَا يُنَجِّسُهُ شَيْءٌ أَخْرَجَهُ الثَّلَاثَةُ وَصَحَّحَهُ أَحْمَدُ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya (hakikat) air adalah suci dan menyucikan, tak ada sesuatu pun yang menajiskannya.\"",
        "hadith_no": "2",
        "degree": "Shahih oleh Ahmad",
        "comment": "-",
        "page": "1",
        "chapter": "Thaharah",
        "chapter_no": "1",
        "collector": "Abu Daud, Tirmidzi, Nasa'i",
        "source": "Bulughul Maram",
        "sub_chapter": "Air"
    },
    {
        "id": "BM.1.1.3",
        "narrator": "Abu Umamah Al-Bahily",
        "ar_hadith": "وَعَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إنَّ الْمَاءَ لَا يُنَجِّسُهُ شَيْءٌ إلَّا مَا غَلَبَ عَلَى رِيحِهِ وَطَعْمِهِ وَلَوْنِهِ  أَخْرَجَهُ ابْنُ مَاجَهْ وَضَعَّفَهُ أَبُو حَاتِمٍ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda: \"Sesungguhnya tidak ada sesuatu pun yang dapat menajiskan air kecuali yang dapat merubah bau, rasa atau warnanya.\"\n",
        "hadith_no": "3",
        "degree": "Dhaif oleh Ibnu Hatim",
        "comment": "-",
        "page": "1",
        "chapter": "Thaharah",
        "chapter_no": "1",
        "collector": "Ibnu Majah",
        "source": "Bulughul Maram",
        "sub_chapter": "Air"
    },
    {
        "id": "BM.1.1.4",
        "narrator": "-",
        "ar_hadith": "وَلِلْبَيْهَقِيِّ الْمَاءُ طَهُورٌ إلَّا إنْ تَغَيَّرَ رِيحُهُ أَوْ طَعْمُهُ أَوْ لَوْنُهُ بِنَجَاسَةٍ تَحْدُثُ فِيهِ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Air itu suci kecuali jika berubah baunya, rasanya atau warnanya dengan suatu najis yang masuk di dalamnya.\"",
        "degree": "-",
        "comment": "-",
        "page": "2",
        "collector": "Al-Baihaqi",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "4",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.5",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إذَا كَانَ الْمَاءُ قُلَّتَيْنِ لَمْ يَحْمِلْ الْخَبَثَ وَفِي لَفْظٍ لَمْ يَنْجُسْ  أَخْرَجَهُ الْأَرْبَعَةُ  وَصَحَّحَهُ ابْنُ خُزَيْمَةَ وَالْحَاكِمُ وَابْنُ حِبَّانَ",
        "hadith": "bahwa Rasulullah (saw.) bersabda: \"Jika banyaknya air telah mencapai dua kullah maka ia tidak mengandung kotoran.\" Dalam suatu lafadz hadits: \"Tidak najis\". Dikeluarkan oleh Imam Empat dan dinilai shahih oleh Ibnu Khuzaimah, Hakim, dan Ibnu Hibban. ",
        "degree": "Shahih oleh Ibnu Khuzaimah, Shahih oleh Ibnu Hibban",
        "comment": "-",
        "page": "2",
        "collector": "Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "5",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.6",
        "narrator": "Abu Hurairah",
        "ar_hadith": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ أَخْرَجَهُ مُسْلِمٌ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Janganlah seseorang di antara kalian mandi di dalam air yang tergenang (tidak mengalir) ketika dalam keadaan junub.\"",
        "degree": "Shahih",
        "comment": "Menurut riwayat Bukhari, disebutkan bahwa Rasulullah (saw.) bersabda, \"Janganlah sekali-kali seseorang di antara kalian buang air kecil di dalam air tergenang yang tidak mengalir kemudian dia mandi di dalamnya.\" Menurut riwayat Muslim, \"dari air yang tergenang\" Dan menurut riwayat Abu Daud, disebutkan bahwa Rasulullah (saw.) bersabda, \"Dan janganlah seseorang mandi junub di dalamnya.\"",
        "page": "2",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "6",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.7",
        "narrator": "Seorang Sahabat Nabi",
        "ar_hadith": "َوَعَنْ رَجُلٍ صَحِبَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَغْتَسِلَ الْمَرْأَةُ بِفَضْلِ الرَّجُلِ أَوْ الرَّجُلُ بِفَضْلِ الْمَرْأَةِ وَلْيَغْتَرِفَا جَمِيعًا أَخْرَجَهُ أَبُو دَاوُد وَالنَّسَائِيُّ وَإِسْنَادُهُ صَحِيحٌ",
        "hadith": "Ia berkata, \"Rasulullah (saw.) melarang perempuan mandi dari sisa air laki-laki atau laki-laki dari sisa air perempuan. Namun hendaklah keduanya menyiduk (mengambil) air bersama-sama.\"\n",
        "degree": "Shahih",
        "comment": "-",
        "page": "2",
        "collector": "Abu Daud, Nasa'i",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "7",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.8",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "َوَعَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ بِفَضْلِ مَيْمُونَةَ رَضِيَ اللَّهُ عَنْهَا أَخْرَجَهُ مُسْلِمٌ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah mandi dari sisa air Maimunah (Istri beliau).",
        "degree": "Shahih",
        "comment": "-",
        "page": "3",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "8",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.1.9",
        "narrator": "-",
        "ar_hadith": "َوَلِأَصْحَابِ السُّنَنِ : اغْتَسَلَ بَعْضُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَفْنَةٍ فَجَاءَ يَغْتَسِلُ مِنْهَا فَقَالَتْ : إنِّي كُنْت جُنُبًا فَقَالَ : إنَّ الْمَاءَ لَا يَجْنُبُ وَصَحَّحَهُ التِّرْمِذِيُّ وَابْنُ خُزَيْمَةَ",
        "hadith": "Disebutkan bahwa sebagian istri Rasulullah (saw.) mandi dalam satu tempat air. Lalu ketika Nabi datang hendak mandi dengan air itu, maka istrinya berkata, \"Sesungguhnya aku sedang junub.\" Lantas Rasulullah (saw.) bersabda, \"Sesungguhnya air itu tidak menjadi junub.\"",
        "degree": "Shahih oleh Tirmidzi, Shahih oleh Ibnu Khuzaimah",
        "comment": "Hadits tersebut disebutkan oleh para pengarang kitab Sunan",
        "page": "3",
        "collector": "-",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Air",
        "hadith_no": "9",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.16",
        "narrator": "Hudzaifah bin Yaman",
        "ar_hadith": "عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَلَا تَأْكُلُوا فِي صِحَافِهِمَا فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَلَكُمْ فِي الْآخِرَةِ مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Janganlah kamu minum dengan bejana yang terbuat dari emas dan perak. Dan jangan pula kamu makan dengan piring yang terbuat dari keduanya. karena memang barang-barang tersebut untuk mereka (orang kafir) di dunia, sedangkan untuk kalian di akhirat.",
        "degree": "Shahih",
        "comment": "-",
        "page": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "16",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.17",
        "narrator": "Ummu Salamah",
        "ar_hadith": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَشْرَبُ فِي إنَاءِ الْفِضَّةِ إنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Orang yang minum dengan bejana yang terbuat dari perak, sesungguhnya ia hanya memasukkan api jahannam ke dalam perutnya.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "17",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.18",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ الْلَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ الْلَّهِ صلى الله عليه وسلم إِذَا دُبِغَ الْإِهَابُ فَقَدْ طَهُرَ أَخْرَجَهُ مُسْلِمٌ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Jika kulit binatang telah disamak maka ia menjadi suci.\"",
        "degree": "Shahih",
        "comment": "Menurut riwayat Abu Daud, Tirmidzi, Nasa'i, dan Ibnu Majah, disebutkan dengan lafadz, \"Kulit binatang apapun yang telah disamak (maka telah suci)\"",
        "page": "5",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "18",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.19",
        "narrator": "Salamah bin Al-Muhabbiq",
        "ar_hadith": "وَعَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ رضي الله عنه قَالَ: قَالَ رَسُولُ الْلَّهِ صلى الله عليه وسلم دِبَاغُ جُلُودِ الْمَيْتَةِ طُهُورُهاَ صَحَّحَهُ ابْنُ حِبَّانَ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Menyamak kulit bangkai adalah mensucikannya.\"",
        "degree": "Shahih oleh Ibnu Hibban",
        "comment": "-",
        "page": "5",
        "collector": "-",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "19",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.20",
        "narrator": "Maimunah",
        "ar_hadith": "وَعَنْ مَيْمُونَةَ رَضِيَ الْلَّهُ عَنْهَا قَالَتْ: مَرَّ رَسُولُ الْلَّهِ صلى الله عليه وسلم بِشَاةٍ يَجُرُّونَهَا فَقَالَ: لَوْ أَخَذْتُمْ إِهَابَهَا؟ فَقَالُوا: إِنَّهَا مَيْتَةٌ فَقَالَ: يُطَهِّرُهَا الْمَاءُ وَالْقَرَظُ أَخْرَجَهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) pernah melintas di hadapan seekor kambing yang sedang diseret orang-orang. Beliau bersabda, \"Alangkah baiknya jika kalian mengambil kulitnya.\" Mereka menjawab, \"Kambing ini benar-benar telah mati.\" Rasulullah (saw.) pun bersabda, \"Kulitnya dapat disucikan dengan air dan daun salam.\"",
        "degree": "-",
        "comment": "-",
        "page": "5-6",
        "collector": "Abu Daud, Nasa'i",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "20",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.21",
        "narrator": "Abu Tsa'labah Al-Khusyani",
        "ar_hadith": "وَعَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ : قُلْت : يَا رَسُولَ اللَّهِ إنَّا بِأَرْضِ قَوْمٍ أَهْلِ كِتَابٍ أَفَنَأْكُلُ فِي آنِيَتِهِمْ ؟ قَالَ : لَا تَأْكُلُوا فِيهَا  إلَّا أَنْ لَا تَجِدُوا غَيْرَهَا فَاغْسِلُوهَا وَكُلُوا فِيهَا مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Saya pernah bertanya kepada Rasulullah (saw.), 'Wahai Rasulullah, sesungguhnya kami tinggal di daerah Ahli Kitab. Bolehkah kami makan dengan bejana mereka?' Rasulullah (saw.) menjawab, 'Janganlah kalian makan dengan bejana mereka kecuali jika kalian tidak mendapatkan bejana selainnya. Jika seperti itu, maka bersihkanlah dahulu kemudian makanlah dengan bejana tersebut.'\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "21",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.22",
        "narrator": "Imran bin Hushain",
        "ar_hadith": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ تَوَضَّئُوا مِنْ مَزَادَةِ امْرَأَةٍ مُشْرِكَةٍ .مُتَّفَقٌ عَلَيْهِ فِي حَدِيثٍ طَوِيلٍ.",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) dan para sahabatnya berwudhu dari <i>mazadah<\/i> (tempat penampungan air yang terbuat dari kulit binatang) milik seorang perempuan musyrik.",
        "degree": "Shahih",
        "comment": "Diriwayatkan dalam hadits yang panjang.",
        "page": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "22",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.2.23",
        "narrator": "Anas bin Malik",
        "ar_hadith": "وَعَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ : أَنَّ قَدَحَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْكَسَرَ فَاِتَّخَذَ مَكَانَ الشَّعْبِ سَلْسَلَةً مِنْ فِضَّةٍ أَخْرَجَهُ الْبُخَارِيُّ",
        "hadith": "Disebutkan bahwa bejana Rasulullah (saw.) pernah retak. Kemudian beliau menambal bagian yang retak itu dengan pengikat dari perak.",
        "degree": "Shahih",
        "comment": "-",
        "page": "6",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Bejana-Bejana",
        "hadith_no": "23",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.24",
        "narrator": "Anas bin Malik",
        "ar_hadith": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ : سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ تُتَّخَذُ خَلًّا ؟ قَالَ : لَا أَخْرَجَهُ مُسْلِمٌ وَالتِّرْمِذِيُّ وَقَالَ حَسَنٌ صَحِيحٌ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) pernah ditanya tentang khamar (minuman memabukkan) yang dijadikan cuka. Maka Rasulullah (saw.) bersabda, \"Tidak boleh.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "6",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "24",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.25",
        "narrator": "Anas bin Malik",
        "ar_hadith": "وَعَنْهُ رَضِيَ اللَّهُ عَنْهُ قَالَ : لَمَّا كَانَ يَوْمُ خَيْبَرَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا طَلْحَةَ فَنَادَى إنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ فَإِنَّهَا رِجْسٌ مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwa di saat perang Khaibar, Rasulullah (saw.) memerintahkan Abu Thalhah untuk menyampaikan pengumuman. Lantas Abu Thalhah pun berseru, \"Sesungguhnya Allah dan Rasul-Nya melarang kalian memakan daging keledai jinak (bukan yang liar) karena ia dianggap kotor.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "7",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "25",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.26",
        "narrator": "Amru bin Kharijah",
        "ar_hadith": "وَعَنْ عَمْرِو بْنِ خَارِجَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ : خَطَبَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى وَهُوَ عَلَى رَاحِلَتِهِ وَلُعَابُهَا يَسِيلُ عَلَى كَتِفِي أَخْرَجَهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَصَحَّحَهُ",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) pernah berkhutbah dari atas tunggangannya di Mina. Saat itu, air liur hewan tunggangan tersebut mengalir di atas pundakku.",
        "degree": "Shahih",
        "comment": "-",
        "page": "7",
        "collector": "Ahmad, Tirmidzi",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "26",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.27",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْسِلُ الْمَنِيَّ ثُمَّ يَخْرُجُ إلَى الصَّلَاةِ فِي ذَلِكَ الثَّوْبِ وَأَنَا أَنْظُرُ إلَى أَثَرِ الْغَسْلِ. مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) pernah mencuci (membasuh) bagian pakaian yang terkena air mani. Setelah itu, Rasulullah keluar untuk menunaikan shalat dengan pakaian tersebut. Saya sendiri masih melihat bekas cucian itu.",
        "degree": "Shahih",
        "comment": "-",
        "page": "7",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "27",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.28",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "وَلِمُسْلِمٍ : لَقَدْ كُنْت أَفْرُكُهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرْكًا فَيُصَلِّي فِيهِ ",
        "hadith": "Disebutkan dengan redaksi \"Aku benar-benar pernah menggosok (bekas air mani) dari pakaian Rasulullah (saw.). Kemudian beliau melaksanakan shalat dengan mengenakan pakaian tersebut.",
        "degree": "Shahih",
        "comment": "Masih dalam riwayat Muslim, disebutkan, \"Aku benar-benar pernah mengerik air mani yang sudah kering di pakaian beliau dengan kukuku.\"",
        "page": "7",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "28",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.29",
        "narrator": "Abu Samh",
        "ar_hadith": "َعَنْ أَبِي السَّمْحِ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُغْسَلُ مِنْ بَوْلِ الْجَارِيَةِ وَيُرَشُّ مِنْ بَوْلِ الْغُلَامِ أَخْرَجَهُ أَبُو دَاوُد وَالنَّسَائِيُّ وَصَحَّحَهُ الْحَاكِمُ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Bekas air kencing bayi perempuan harus dicuci dan bekas air kencing bayi laki-laki cukup diperciki dengan air.\"",
        "degree": "Shahih oleh Hakim",
        "comment": "-",
        "page": "7",
        "collector": "Abu Daud, Nasa'i",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "29",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.30",
        "narrator": "Asma binti Abu Bakar",
        "ar_hadith": "َوَعَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ - فِي دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ تَحُتُّهُ ثُمَّ تَقْرُصُهُ بِالْمَاءِ ثُمَّ تَنْضَحُهُ ثُمَّ تُصَلِّي فِيهِ مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah bersabda tentang darah haid yang mengenai pakaian, \"Engkau kikis darah tersebut, engkau gosok dengan air kemudian engkau percikkan dengan air. Setelah itu, baru engkau boleh sholat dengan pakaian tersebut.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "8",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "30",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.3.31",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َوَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَتْ خَوْلَةُ يَا رَسُولَ اللَّهِ فَإِنْ لَمْ يَذْهَبْ الدَّمُ ؟ قَالَ : يَكْفِيك الْمَاءُ وَلَا يَضُرُّك أَثَرُهُ أَخْرَجَهُ التِّرْمِذِيُّ وَسَنَدُهُ ضَعِيفٌ",
        "hadith": "Ia berkata bahwa Khaulah pernah bertanya, \"Wahai Rasulullah, bagaimana jika darah haid itu tidak hilang? Beliau menjawab, \"Engkau cukup membersihkannya dengan air dan bekasnya tidak menjadi masalah.\"",
        "degree": "Dhaif",
        "comment": "-",
        "page": "8",
        "collector": "Tirmidzi",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Menghilangkan Najis dan Penjelasannya",
        "hadith_no": "31",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.32",
        "narrator": "Abu Hurairah",
        "ar_hadith": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ : لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ وُضُوءٍ أَخْرَجَهُ مَالِكٌ وَأَحْمَدُ وَالنَّسَائِيُّ. وَصَحَّحَهُ ابْنُ خُزَيْمَةَ وَذَكَرَهُ الْبُخَارِيُّ تَعْلِيقًا",
        "hadith": "Dari Rasulullah (saw.) bahwa beliau bersabda, \"Seandainya tidak memberatkan atas umatku niscaya aku perintahkan mereka untuk bersiwak (menggosok gigi dengan kayu Arak) pada setiap kali wudhu.\"",
        "degree": "Shahih oleh Ibnu Khuzaimah, Muallaq oleh Bukhari",
        "comment": "-",
        "page": "8",
        "collector": "Malik, Ahmad, Nasa'i",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "32",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.33",
        "narrator": "Humran",
        "ar_hadith": "وَعَنْ حُمْرَانَ أَنَّ عُثْمَانَ دَعَا بِوَضُوءٍ فَغَسَلَ كَفَّيْهِ ثَلَاثَ مَرَّاتٍ ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ وَاسْتَنْثَرَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثَ مَرَّاتٍ ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى إلَى الْمِرْفَقِ ثَلَاثَ مَرَّاتٍ ثُمَّ الْيُسْرَى مِثْلَ ذَلِكَ ثُمَّ مَسَحَ بِرَأْسِهِ ثُمَّ غَسَلَ رِجْلَهُ الْيُمْنَى إلَى الْكَعْبَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ الْيُسْرَى مِثْلَ ذَلِكَ ثُمَّ قَالَ : رَأَيْت رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwa Utsman pernah meminta air wudhu. Setelah disuguhkan, ia membasuh kedua telapak tangannya tiga kali, lalu berkumur dan menghisap air ke dalam hidung dan menghembuskannya keluar. kemudian membasuh wajahnya tiga kali, membasuh tangan kanannya hingga siku-siku tiga kali dan tangan kirinya pun begitu pula. Setelah itu, ia mengusap kepalanya, lalu membasuh kaki kanannya hingga kedua mata kaki tiga kali dan kaki kirinya pun begitu pula. Kemudian ia berkata, \"Saya melihat Rasulullah (saw.) berwudhu seperti wudhuku ini.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "8-9",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "33",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.34",
        "narrator": "Ali bin Abi Thalib",
        "ar_hadith": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ - فِي صِفَةِ وُضُوءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - قَالَ : وَمَسَحَ بِرَأْسِهِ وَاحِدَةً أَخْرَجَهُ أَبُو دَاوُد وَأَخْرَجَهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ بِإِسْنَادٍ صَحِيحٍ. بَلْ قَالَ التِّرْمِذِيُّ : إنَّهُ أَصَحُّ شَيْءٍ فِي الْبَابِ",
        "hadith": "Disebutkan bahwa ia berkata tentang cara Rasulullah (saw.) berwudhu, \"Beliau mengusap kepalanya satu kali saja.\"",
        "degree": "Shahih",
        "comment": "Tirmidzi dan Nasa'i juga meriwayatkannya dengan sanad yang shahih bahkan Tirmidzi menyatakan bahwa ini adalah hadits yang paling shahih pada bab tersebut.",
        "page": "9",
        "collector": "Abu Daud",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "34",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.35",
        "narrator": "Abdullah bin Yazid bin 'Ashim",
        "ar_hadith": "وَعَنْ عَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ رَضِيَ اللَّهُ عَنْهُمَا - فِي صِفَةِ الْوُضُوءِ قَالَ : وَمَسَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَأْسِهِ فَأَقْبَلَ بِيَدَيْهِ وَأَدْبَرَ.مُتَّفَقٌ عَلَيْه",
        "hadith": "Disebutkan bahwa ia berkata tentang cara berwudhu dia berkata, \"Rasulullah (saw.) mengusap kepalanya dengan kedua tangannya dari muka ke belakang dan dari belakang ke muka.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "9",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "35",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.36",
        "narrator": "Abdullah bin Amru",
        "ar_hadith": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا - فِي صِفَةِ الْوُضُوءِ - قَالَ : ثُمَّ مَسَحَ بِرَأْسِهِ وَأَدْخَلَ إصْبَعَيْهِ السَّبَّاحَتَيْنِ فِي أُذُنَيْهِ وَمَسَحَ بِإِبْهَامَيْهِ ظَاهِرَ أُذُنَيْهِ أَخْرَجَهُ أَبُو دَاوُد وَالنَّسَائِيُّ. وَصَحَّحَهُ ابْنُ خُزَيْمَةَ",
        "hadith": "Disebutkan bahwa ia berkata tentang cara berwudhu, \"Kemudian beliau mengusap kepalanya dan memasukkan kedua jari telunjuknya ke dalam kedua telinganya dan mengusap bagian luar kedua telinganya dengan ibu jarinya.\"",
        "degree": "Shahih oleh Ibnu Khuzaimah",
        "comment": "-",
        "page": "9",
        "collector": "Abu Daud, Nasa'i",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "36",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.37",
        "narrator": "Abu Hurairah",
        "ar_hadith": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَسْتَنْثِرْ ثَلَاثًا فَإِنَّ الشَّيْطَانَ يَبِيتُ عَلَى خَيْشُومِهِ مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila seseorang di antara kalian bangun dari tidurnya maka hendaklah ia menghisap air ke dalam hidungnya tiga kali dan menghembuskannya keluar. Hal itu disebabkan karena syaithan tidur di dalam rongga hidungnya.\"",
        "degree": "Shahih",
        "comment": "-",
        "page": "9-10",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "37",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.38",
        "narrator": "Abu Hurairah",
        "ar_hadith": "وَعَنْهُ إذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلَا يَغْمِسْ يَدَهُ فِي الْإِنَاءِ حَتَّى يَغْسِلَهَا ثَلَاثًا فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ مُتَّفَقٌ عَلَيْهِ وَهَذَا لَفْظُ مُسْلِمٍ",
        "hadith": "Disebutkan, \"Apabila seseorang di antara kamu bangun dari tidurnya maka janganlah ia langsung memasukkan tangannya ke dalam tempat air sebelum mencucinya tiga kali terlebih dahulu. Hal tersebut disebabkan ia tidak mengetahui apa yang telah disentuh oleh tangannya di waktu ia tertidur.\"",
        "degree": "Shahih",
        "comment": "Lafadznya menurut riwayat Muslim.",
        "page": "11",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "38",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.39",
        "narrator": "Laqith bin Shabirah",
        "ar_hadith": "وَعَنْ لَقِيطِ بْنِ صَبِرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْبِغْ الْوُضُوءَ وَخَلِّلْ بَيْنَ الْأَصَابِعِ وَبَالِغْ فِي الِاسْتِنْشَاقِ إلَّا أَنْ تَكُونَ صَائِمًا أَخْرَجَهُ الْأَرْبَعَةُ وَصَحَّحَهُ ابْنُ خُزَيْمَةَ",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Sempurnakanlah berwudhu, usaplah sela-sela jari, dan isaplah air ke dalam hidung dalam-dalam kecuali jika engkau sedang berpuasa.\"",
        "degree": "Shahih oleh Ibnu Khuzaimah",
        "comment": "Menurut riwayat Abu Daud disebutkan, \"Jika engkau berwudhu, maka berkumurlah.\"",
        "page": "10",
        "collector": "Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "39",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.40",
        "narrator": "Utsman bin Affan",
        "ar_hadith": "وَعَنْ عُثْمَانَ رَضِيَ اللَّهُ تَعَالَى عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخَلِّلُ لِحْيَتَهُ فِي الْوُضُوءِ. أَخْرَجَهُ التِّرْمِذِيُّ وَصَحَّحَهُ ابْنُ خُزَيْمَةَ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) menyeka-nyeka jenggotnya saat berwudhu. \n",
        "degree": "Shahih oleh Ibnu Khuzaimah",
        "comment": "-",
        "page": "10",
        "collector": "Tirmidzi",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "40",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.41",
        "narrator": "Abdullah bin Zaid",
        "ar_hadith": "وَعَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ قَالَ : إنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بِثُلُثَيْ مُدٍّ فَجَعَلَ يَدْلُكُ ذِرَاعَيْهِ أَخْرَجَهُ أَحْمَدُ وَصَحَّحَهُ ابْنُ خُزَيْمَةَ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah diberi air sebanyak dua pertiga mud. Kemudian beliau gunakan untuk menggosok kedua tangannya. ",
        "degree": "Shahih oleh Ibnu Khuzaimah",
        "comment": "-",
        "page": "10",
        "collector": "Ahmad",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "41",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.42",
        "narrator": "Utsman bin Affan",
        "ar_hadith": "وَعَنْهُ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْخُذُ لِأُذُنَيْهِ مَاءً غَيْرَ الْمَاءِ الَّذِي أَخَذَهُ لِرَأْسِهِ. أَخْرَجَهُ الْبَيْهَقِيُّ وَهُوَ عِنْدَ مُسْلِمٍ مِنْ هَذَا الْوَجْهِ بِلَفْظِ : وَمَسَحَ بِرَأْسِهِ بِمَاءٍ غَيْرِ فَضْلِ يَدَيْهِ وَهُوَ الْمَحْفُوظُ",
        "hadith": "Disebutkan bahwa ia pernah melihat Rasulullah (saw.) mengambil air untuk mengusap kedua telinganya selain air yang digunakannya untuk mengusap kepalanya.",
        "degree": "-",
        "comment": "Sedangkan menurut riwayat Muslim dengan jalan periwayatan yang sama disebutkan, \"Beliau mengusap kepalanya dengan air yang bukan sisa dari yang digunakan untuk mengusap kedua tangannya.\" Inilah lafadz yang mahfudh.",
        "page": "11",
        "collector": "Baihaqi",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "42",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.43",
        "narrator": "Abu Hurairah",
        "ar_hadith": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ : سَمِعْت رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : إنَّ أُمَّتِي يَأْتُونَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ أَثَرِ الْوُضُوءِ فَمَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ مُتَّفَقٌ عَلَيْهِ وَاللَّفْظُ لِمُسْلِمٍ",
        "hadith": "Ia berkata, \"Aku mendengar Rasulullah (saw.) bersabda, 'Sesungguhnya umatku akan datang pada hari kiamat dalam keadaan wajah dan tangan yang berkilauan dari bekas wudhu. Maka barangsiapa di antara kalian yang dapat memperpanjang kilauannya hendaklah ia mengerjakannya.",
        "degree": "Shahih",
        "comment": "Lafadz menurut riwayat Muslim.",
        "page": "11",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "43",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.44",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ التَّيَمُّنُ فِي تَنَعُّلِهِ وَتَرَجُّلِهِ وَطَهُورِهِ وَفِي شَأْنِهِ كُلِّهِ مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) suka mendahulukan yang kanan dalam bersandal, menyisir rambut, bersuci, dan dalam segala hal.",
        "degree": "Shahih",
        "comment": "-",
        "page": "11",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "44",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.45",
        "narrator": "Abu Hurairah",
        "ar_hadith": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( إِذَا تَوَضَّأْتُمْ فابدأوا بِمَيَامِنِكُمْ )  أَخْرَجَهُ اَلْأَرْبَعَةُ وَصَحَّحَهُ اِبْنُ خُزَيْمَةِ",
        "hadith": "Ia mengatakan bahwa Rasulullah (saw.) bersabda, \"Apabila kalian berwudhu maka mulailah dengan bagian-bagian anggota wudhu yang kanan.\"",
        "degree": "Shahih oleh Ibnu Khuzaimah",
        "comment": "-",
        "page": "11",
        "collector": "Abu Daud, Tirmidzi, Nasa'i, Ibnu Majah",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "45",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.46",
        "narrator": "Mughirah bin Syu'bah",
        "ar_hadith": "عَنْ اَلْمُغِيرَةِ بْنِ شُعْبَةٍ رضي الله عنه ( أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ فَمَسَحَ بِنَاصِيَتِهِ وَعَلَى اَلْعِمَامَةِ وَالْخُفَّيْنِ )  أَخْرَجَهُ مُسْلِم",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah berwudhu. Saat itu mengusap ubun-ubunnya, bagian atas sorbannya, dan kedua <i>khuf<\/i>-nya.",
        "degree": "Shahih",
        "comment": "-",
        "page": "11",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "46",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.47",
        "narrator": "Jabir bin Abdullah",
        "ar_hadith": "عَنْ جَابِرٍ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا -فِي صِفَةِ حَجِّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ- قَالَ صلى الله عليه وسلم ( اِبْدَؤُوا بِمَا بَدَأَ اَللَّهُ بِهِ )  أَخْرَجَهُ النَّسَائِيُّ هَكَذَا بِلَفْظِ اَلْأَمْر ِ وَهُوَ عِنْدَ مُسْلِمٍ بِلَفْظِ اَلْخَبَر",
        "hadith": "Ia berkata tentang cara haji Rasulullah (saw.) disebutkan bahwa beliau pernah bersabda, \"Mulailah dengan apa yang telah dimulai oleh Allah.\"",
        "degree": "Shahih",
        "comment": "Diriwayatkan oleh Nasa'i dengan kalimat perintah sedang Muslim meriwayatkannya dengan kalimat berita.",
        "page": "12",
        "collector": "Nasa'i, Muslim",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "47",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.48",
        "narrator": "Jabir bin Abdullah",
        "ar_hadith": "عَنْهُ قَالَ: ( كَانَ اَلنَّبِيَّ صلى الله عليه وسلم إِذَا تَوَضَّأَ أَدَارَ اَلْمَاءَ عَلَى مُرْفَقَيْهِ )  أَخْرَجَهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادِ ضَعِيف \n",
        "hadith": "Ia berkata jika Rasulullah (saw.) berwudhu, maka beliau mengalirkan air pada kedua siku-sikunya.",
        "degree": "Dhaif",
        "comment": "-",
        "page": "12",
        "collector": "Daruquthni",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "48",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.49",
        "narrator": "Abu Hurairah",
        "ar_hadith": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( لَا وُضُوءَ لِمَنْ لَمْ يَذْكُرِ اِسْمَ اَللَّهِ عَلَيْهِ )  أَخْرَجَهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ بِإِسْنَادٍ ضَعِيف",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "degree": "Dhaif",
        "comment": "-",
        "page": "12",
        "collector": "Ahmad, Abu Daud, Ibnu Majah",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "49",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.50",
        "narrator": "Said bin Zaid",
        "ar_hadith": "لِلترْمِذِيِّ: عَنْ سَعِيدِ بْنِ زَيْد",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "degree": "-",
        "comment": "Hadits yang serupa dengan hadits nomor 49",
        "page": "12",
        "collector": "Tirmidzi",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "50",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.51",
        "narrator": "Abu Sa'id",
        "ar_hadith": "وَأَبِي سَعِيدٍ نَحْوُه ُقَالَ أَحْمَدُ: لَا يَثْبُتُ فِيهِ شَيْء",
        "hadith": "Ia berkata bahwa Rasulullah (saw.) bersabda, \"Tidak sah wudhu seseorang yang tidak menyebut nama Allah.\"",
        "degree": "-",
        "comment": "Sama seperti hadits nomor 49. Ahmad berkata, \"Tidak dapat ditetapkan suatu hukum apapun berdasarkan hadits itu.\"",
        "page": "12",
        "collector": "Ahmad",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "51",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.52",
        "narrator": "Thalhah bin Musharrif",
        "ar_hadith": "عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: ( رَأَيْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم يَفْصِلُ بَيْنَ اَلْمَضْمَضَةِ وَالِاسْتِنْشَاقِ )  أَخْرَجَهُ أَبُو دَاوُدَ بِإِسْنَادِ ضَعِيف ",
        "hadith": "Dari ayahnya, dari kakeknya, ia berkata, \"Aku pernah melihat Rasulullah (saw.) memisahkan antara berkumur dan menghirup air melalui hidung.\"",
        "degree": "Dhaif",
        "comment": "-",
        "page": "12",
        "collector": "Abu Daud",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "52",
        "chapter_no": "1"
    },
    {
        "id": "BM.1.4.53",
        "narrator": "Ali bin Abi Thalib",
        "ar_hadith": "عَنْ عَلِيٍّ رضي الله عنه -فِي صِفَةِ اَلْوُضُوءِ- ( ثُمَّ تَمَضْمَضَ صلى الله عليه وسلم وَاسْتَنْثَرَ ثَلَاثًا يُمَضْمِضُ وَيَنْثِرُ مِنْ اَلْكَفِّ اَلَّذِي يَأْخُذُ مِنْهُ اَلْمَاءَ )  أَخْرَجَهُ أَبُو دَاوُدَ وَالنَّسَائِيّ",
        "hadith": "Disebutkan tentang cara berwudhu, \"Kemudian Rasulullah (saw.) berkumur dan menghisap air melalui hidung sebanyak tiga kali dengan telapak tangan yang digunakan untuk mengambil air.\"",
        "degree": "-",
        "comment": "-",
        "page": "12",
        "collector": "Abu Daud, Nasa'i",
        "source": "Bulughul Maram",
        "chapter": "Thaharah",
        "sub_chapter": "Wudhu",
        "hadith_no": "53",
        "chapter_no": "1"
    },
    {
        "id": "BM.3.0.534",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َعَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( أَكْثِرُوا ذِكْرَ هَاذِمِ  اَللَّذَّاتِ: اَلْمَوْتِ )  رَوَاهُ اَلتِّرْمِذِيُّ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Perbanyaklah menyebut penghancur kenikmatan, yaitu kematian.\"",
        "hadith_no": "534",
        "degree": "Shahih oleh Ibnu Hibban",
        "comment": "-",
        "page": "126",
        "chapter": "Jenazah",
        "chapter_no": "3",
        "collector": "Tirmidzi, Nasa'i",
        "source": "Bulughul Maram",
        "sub_chapter": "Jenazah"
    },
    {
        "id": "BM.3.0.535",
        "narrator": "Anas bin Malik",
        "ar_hadith": "َوَعَنْ أَنَسٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( لَا يَتَمَنَّيَنَّ أَحَدُكُمُ اَلْمَوْتَ لِضُرٍّ يَنْزِلُ بِهِ, فَإِنْ كَانَ لَا بُدَّ مُتَمَنِّيًا فَلْيَقُلْ: اَللَّهُمَّ أَحْيِنِي مَا كَانَتِ اَلْحَيَاةُ خَيْرًا لِي, وَتَوَفَّنِي إِذَا كَانَتِ اَلْوَفَاةُ خَيْرًا لِي )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Janganlah sekali-kali seseorang di antara kamu mengharapkan kematian karena hanya kesusahan (musibah) yang menimpanya. Dan bila ia terpaksa melakukannya, hendaknya ia berdoa: <i>'Ya Allah hidupkanlah aku selama kehidupan itu lebih baik bagiku dan wafatkanlah aku jika sekiranya itu lebih baik bagiku.'<\/i>\"",
        "hadith_no": "535",
        "degree": "Shahih",
        "comment": "-",
        "page": "126",
        "chapter": "Jenazah",
        "chapter_no": "3",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Jenazah"
    },
    {
        "id": "BM.4.0.600",
        "narrator": "Anas bin Malik",
        "ar_hadith": "َوَعَنْ أَنَسٍ رضي الله عنه أَنَّ أَبَا بَكْرٍ اَلصِّدِّيقَ رضي الله عنه كَتَبَ لَه ُ ( هَذِهِ فَرِيضَةُ اَلصَّدَقَةِ اَلَّتِي فَرَضَهَا رَسُولُ اَللَّهِ صلى الله عليه وسلم عَلَى اَلْمُسْلِمِينَ, وَاَلَّتِي أَمَرَ اَللَّهُ بِهَا رَسُولَه ُ فِي أَرْبَعٍ وَعِشْرِينَ مِنَ اَلْإِبِلِ فَمَا دُونَهَا اَلْغَنَم ُ فِي كُلِّ خَمْسٍ شَاةٌ, فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ إِلَى خَمْسٍ وَثَلَاثِينَ فَفِيهَا بِنْتُ مَخَاضٍ أُنْثَى فَإِنْ لَمْ تَكُنْ فَابْنُ لَبُونٍ ذَكَر ٍ فَإِذَا بَلَغَتْ سِتًّا وَثَلَاثِينَ إِلَى خَمْسٍ وَأَرْبَعِينَ فَفِيهَا بِنْتُ لَبُون ٍ أُنْثَى, فَإِذَا بَلَغَتْ سِتًّا وَأَرْبَعِينَ إِلَى سِتِّينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ اَلْجَمَل ِ فَإِذَا بَلَغَتْ وَاحِدَةً وَسِتِّينَ إِلَى خَمْسٍ وَسَبْعِينَ فَفِيهَا جَذَعَة ٌ فَإِذَا بَلَغَتْ سِتًّا وَسَبْعِينَ إِلَى تِسْعِينَ فَفِيهَا بِنْتَا لَبُونٍ, فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ إِلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا حِقَّتَانِ طَرُوقَتَا اَلْجَمَلِ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ, وَفِي كُلِّ خَمْسِينَ حِقَّةٌ, وَمَنْ لَمْ يَكُنْ مَعَهُ إِلَّا أَرْبَعٌ مِنَ اَلْإِبِلِ فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي صَدَقَةِ اَلْغَنَمِ سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ إِلَى عِشْرِينَ وَمِائَةِ شَاة ٍ شَاةٌ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ إِلَى مِائَتَيْنِ فَفِيهَا شَاتَانِ, فَإِذَا زَادَتْ عَلَى مِائَتَيْنِ إِلَى ثَلَاثمِائَةٍ فَفِيهَا ثَلَاثُ شِيَاه ٍ فَإِذَا زَادَتْ عَلَى ثَلَاثِمِائَةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ، فَإِذَا كَانَتْ سَائِمَةُ اَلرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاة ٍ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا صَدَقَةٌ, إِلَّا أَنْ يَشَاءَ رَبُّهَا. وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ اَلصَّدَقَةِ, وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ, وَلَا يُخْرَجُ فِي اَلصَّدَقَةِ هَرِمَة ٌ وَلَا ذَاتُ عَوَارٍ, إِلَّا أَنْ يَشَاءَ اَلْمُصَّدِّقُ، وَفِي اَلرِّقَة ِ رُبُعُ اَلْعُشْرِ, فَإِنْ لَمْ تَكُن ْ إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا, وَمَنْ بَلَغَتْ عِنْدَهُ مِنَ اَلْإِبِلِ صَدَقَةُ اَلْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْحِقَّةُ, وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اِسْتَيْسَرَتَا لَهُ, أَوْ عِشْرِينَ دِرْهَمًا, وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ اَلْحِقَّةِ وَلَيْسَتْ عِنْدَهُ اَلْحِقَّةُ, وَعِنْدَهُ اَلْجَذَعَةُ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْجَذَعَةُ, وَيُعْطِيهِ اَلْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ )  رَوَاهُ اَلْبُخَارِيّ",
        "hadith": "Abu Bakar Ash-Shiddiq (ra.) pernah menulis surat kepadanya. Isinya: \"Ini adalah kewajiban zakat yang diwajibkan oleh Rasulullah (saw.) atas kaum muslimin. Yang diperintahkan Allah atas Rasul-Nya ialah setiap 24 ekor unta ke bawah wajib mengeluarkan kambing, yaitu setiap kelipatan lima ekor unta zakatnya seekor kambing. Jika mencapai 25 hingga 35 ekor unta, maka zakatnya seekor anak unta betina yang umurnya telah menginjak tahun ke dua. Jika tidak ada, maka zakatnya seekor anak unta jantan yang umurnya telah menginjak utahun ketiga.<br>Jika mencapai 46 hingga 60 ekor unta, zakatnya seekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Jika mencapai 61 hingga 75 ekor unta, zakatnya seekor unta betina yang umurnya telah masuk tahun kelima. Jika mencapai 76 hingga 90 ekor unta, zakatnya dua ekor anak unta betina yang umurnya telah menginjak tahun kedua. <br>Jika mencapai 91 hingga 120 ekor unta, maka zakatnya adalah dua ekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Bila jumlahnya lebih dari 120, maka zakat di setiap 40 ekor adalah seekor anak unta betina yang umurnya masuk tahun ke tiga dan setiap 50 ekor zakatnya adalah seekor unta betina yang umurnya masuk tahun keempat. Bagi yang hanya memiliki empat ekor unta, tidak wajib atasnya zakat kecuali bila pemiliknya menginginkannya.<br>Mengenai zakat kambing yang dilepas mencari makan sendiri, jika mencapai 40 hingga 120 ekor kambing, zakatnya seekor kambing. Jika lebih dari 120 hingga 200 ekor kambing, zakatnya dua ekor kambing. Jika lebih dari 200 hingga 300 kambing, zakatnya tiga ekor kambing. Jika lebih dari 300 ekor kambing, maka setiap 100 ekor zakatnya seekor kambing. Apabila jumlah kambing yang dilepas mencari makan sendiri kurang dari 40 ekor, maka tidak wajib atasnya zakat kecuali jika pemiliknya menginginkan. <br>Tidak boleh dikumpulkan antara hewan-hewan ternak terpisah dan tidak boleh dipisahkan antara hewan-hewan ternak yang terkumpul karena takut mengeluarkan zakat. Hewan ternak kumpulan dari dua orang, maka harus kembali dibagi rata antara keduanya pada waktu zakat telah tiba. Tidak boleh dikeluarkan untuk zakat hewan yang tua dan yang cacat, kecuali jika pemiliknya menghendakinya. Tentang zakat perak, setiap 200 dirham zakatnya seperempatnya. Namun, jika hanya 190 dirham, tidak wajib atasnya zakat kecuali bila pemiliknya menghendakinya. <br>Barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang seumurnya masuk tahun kelima, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkannya ditambah dua ekor kambing jika tidak menyulitkannya, atau 20 dirham. Barangsiapa yang sudah wajib mengeluarkan seekor anak unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kelima, maka ia boleh mengeluarkannya ditambah 20 dirham atau dua ekor kambing.\".",
        "hadith_no": "600",
        "degree": "Shahih",
        "comment": "-",
        "page": "140-142",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Zakat"
    },
    {
        "id": "BM.4.0.601",
        "narrator": "Mu'adz bin Jabal",
        "ar_hadith": "َوَعَنْ مُعَاذِ بْنِ جَبَلٍ رضي الله عنه ( أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم بَعَثَهُ إِلَى اَلْيَمَنِ, فَأَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ ثَلَاثِينَ بَقَرَةً تَبِيعًا أَوْ تَبِيعَةً, وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً, وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عَدْلَهُ مُعَافِرَ )  رَوَاهُ اَلْخَمْسَةُ, وَاللَّفْظُ لِأَحْمَدَ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ وَأَشَارَ إِلَى اِخْتِلَافٍ فِي وَصْلِهِ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِم",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah mengutusnya ke negeri Yaman. Beliau memerintahkan untuk mengambil (zakat) dari 30 ekor sapi, seekor anak sapi berumur setahun lebih yang jantan atau betina, dan setiap 40 ekor sapi, seekor sapi betina berumur dua tahun lebih, dan dari setiap orang yang telah baligh diambil satu dinar atau yang sebanding dengan nilai itu pada kaum Mu'afar.",
        "hadith_no": "601",
        "degree": "Shahih oleh Ibnu Hibban dan Hakim.",
        "comment": "-",
        "page": "142-143",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Ahmad, Abu Daud, Ibnu Majah, Nasa'i, Tirmidzi",
        "source": "Bulughul Maram",
        "sub_chapter": "Zakat"
    },
    {
        "id": "BM.4.1.627",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "َعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: ( فَرَضَ رَسُولُ اَللَّهِ صلى الله عليه وسلم زَكَاةَ اَلْفِطْرِ, صَاعًا مِنْ تَمْرٍ, أَوْ صَاعًا مِنْ شَعِيرٍ: عَلَى اَلْعَبْدِ وَالْحُرِّ, وَالذَّكَرِ, وَالْأُنْثَى, وَالصَّغِيرِ, وَالْكَبِيرِ, مِنَ اَلْمُسْلِمِينَ, وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ اَلنَّاسِ إِلَى اَلصَّلَاةِ )  مُتَّفَقٌ عَلَيْه",
        "hadith": "Ia berkata, \"Rasulullah (saw.) mewajibkan zakat fitrah sebesar satu <i>sha'<\/i> kurma atau satu sha' sya'ir atas seorang hamba, orang merdeka, laki-laki dan perempuan, besar kecil dari orang-orang islam; dan beliau memerintahkan agar dikeluarkan sebelum kaum muslimin keluar menunaikan sholat 'Ied.\"",
        "hadith_no": "627",
        "degree": "Shahih",
        "comment": "-",
        "page": "148",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Zakat Fitrah"
    },
    {
        "id": "BM.4.1.630",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "َوَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: ( فَرَضَ رَسُولُ اَللَّهِ صلى الله عليه وسلم زَكَاةَ اَلْفِطْرِ; طُهْرَةً لِلصَّائِمِ مِنَ اَللَّغْوِ, وَالرَّفَثِ, وَطُعْمَةً لِلْمَسَاكِينِ, فَمَنْ أَدَّاهَا قَبْلَ اَلصَّلَاةِ فَهِيَ زَكَاةٌ مَقْبُولَةٌ, وَمَنْ أَدَّاهَا بَعْدَ اَلصَّلَاةِ فَهِيَ صَدَقَةٌ مِنَ اَلصَّدَقَاتِ. )  رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اَلْحَاكِم",
        "hadith": "Ia berkata, \"Rasulullah (saw.) mewajibkan zakat fitrah sebagai pembersih bagi orang yang berpuasa dari perkataan yang tidak berguna dan kotor, dan sebagai makanan bagi orang-orang miskin. Maka barangsiapa yang mengeluarkannya sebelum sholat 'Ied dilaksanakan, maka menjadi zakat yang diterima dan barangsiapa mengeluarkannya setelah sholat 'Ied, ia menjadi sedekah biasa.\"",
        "hadith_no": "630",
        "degree": "Shahih oleh Hakim",
        "comment": "-",
        "page": "149",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Abu Daud, Ibnu Majah",
        "source": "Bulughul Maram",
        "sub_chapter": "Zakat Fitrah"
    },
    {
        "id": "BM.4.2.631",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َعَنْ أَبِي هُرَيْرَةَ رضي الله عنه عَنِ اَلنَّبِيِّ صلى الله عليه وسلم قَالَ: ( سَبْعَةٌ يُظِلُّهُمُ اَللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ.... )  فَذَكَرَ اَلْحَدِيثَ وَفِيهِ: ( وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لَا تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Rasulullah (saw.) bersabda, 'Tujuh macam orang yang akan dilindungi Allah pada hari yang tidak ada lindungan kecuali lindungan-Nya' Kemudian ia (perawi) menyebutkan (kelanjutan) hadits dan didalamnya disebutkan 'Orang yang bersedekah namun ia menyembunyikannya sehingga tangan kirinya tidak mengetahui apa yang dikeluarkan oleh tangan kanannya.\".",
        "hadith_no": "631",
        "degree": "Shahih",
        "comment": "-",
        "page": "150",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Sedekah"
    },
    {
        "id": "BM.4.2.634",
        "narrator": "Hakim bin Hazm",
        "ar_hadith": "َوَعَنْ حَكِيمِ بْنِ حِزَامٍ رضي الله عنه عَنِ اَلنَّبِيِّ صلى الله عليه وسلم قَالَ: ( اَلْيَدُ اَلْعُلْيَا خَيْرٌ مِنَ اَلْيَدِ اَلسُّفْلَى, وَابْدَأْ بِمَنْ تَعُولُ, وَخَيْرُ اَلصَّدَقَةِ عَنْ ظَهْرِ غِنًى, وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اَللَّهُ, وَمَنْ يَسْتَغْنِ يُغْنِهِ اَللَّهُ )  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ",
        "hadith": "Dari Rasulullah (saw.), beliau bersabda, \"Tangan yang di atas (pemberi) lebih baik daripada tangan yang di bawah (penerima). Dan mulailah (memberi) kepada orang-orang yang banyak tanggungannya. Sebaik-baik sedekah adalah yang diambil dari sisa kebutuhan sendiri. Barangsiapa yang menjaga kehormatannya, maka Allah akan menjaganya. Dan barangsiapa merasa cukup, maka Allah akan mencukupkan kebutuhannya.\"",
        "hadith_no": "634",
        "degree": "Shahih",
        "comment": "Lafadznya milik Bukhari",
        "page": "150-151",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Sedekah"
    },
    {
        "id": "BM.4.2.637",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ اَلنَّبِيُّ صلى الله عليه وسلم ( إِذَا أَنْفَقَتِ اَلْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا, غَيْرَ مُفْسِدَةٍ, كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا اِكْتَسَبَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ, وَلَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا )  مُتَّفَقٌ عَلَيْهِ.",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Apabila seorang perempuan menginfakkan sebagian makanan di rumahnya tanpa merusak (keunganan rumah tangga) maka ia mendapatkan pahala atas apa yang ia infakkan. Bahkan suaminya juga mendapatkan pahalanya karena ia yang bekerja mencari rezeki, dan begitu pula bagi yang menyimpannya. Sebagian dari mereka tidak mengurangi sedikit pun pahala dari sebagian lainnya.\" ",
        "hadith_no": "637",
        "degree": "Shahih",
        "comment": "-",
        "page": "151-152",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Sedekah"
    },
    {
        "id": "BM.4.2.639",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "َوَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ اَلنَّبِيُّ صلى الله عليه وسلم ( مَا يَزَالُ اَلرَّجُلُ يَسْأَلُ اَلنَّاسَ حَتَّى يَأْتِيَ يَوْمَ اَلْقِيَامَةِ لَيْسَ فِي وَجْهِهِ مُزْعَةُ لَحْمٍ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Orang yang selalu mengemis kepada orang lain, maka di hari kiamat kelak ia akan datang (bangkit) dengan tidak memiliki segumpal daging pun di bagian wajahnya.\"",
        "hadith_no": "639",
        "degree": "Shahih",
        "comment": "-",
        "page": "152",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Sedekah"
    },
    {
        "id": "BM.4.2.640",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َوَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( مَنْ سَأَلَ اَلنَّاسَ أَمْوَالَهُمْ تَكَثُّرًا, فَإِنَّمَا يَسْأَلُ جَمْرًا, فَلْيَسْتَقِلَّ أَوْ لِيَسْتَكْثِرْ )  رَوَاهُ مُسْلِمٌ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa meminta-minta kepada orang lain dengan tujuan memperkaya diri, maka sesungguhnya ia meminta bara api. Oleh karenanya, ia dipersilakan meminta sedikit atau banyak.\"",
        "hadith_no": "640",
        "degree": "Shahih",
        "comment": "-",
        "page": "152",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Sedekah"
    },
    {
        "id": "BM.4.2.641",
        "narrator": "Zubair bin 'Awwam",
        "ar_hadith": "َوَعَنِ اَلزُّبَيْرِ بْنِ اَلْعَوَّامِ رضي الله عنه عَنِ اَلنَّبِيِّ صلى الله عليه وسلم قَالَ: ( لَأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ, فَيَأْتِي بِحُزْمَةِ اَلْحَطَبِ عَلَى ظَهْرِهِ, فَيَبِيعَهَا, فَيَكُفَّ اَللَّهُ بِهَا وَجْهَهُ, خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ اَلنَّاسَ أَعْطَوهُ أَوْ مَنَعُوهُ )  رَوَاهُ اَلْبُخَارِيُّ",
        "hadith": "Dari Rasulullah (saw.), beliau bersabda, \"Seorang di antara kalian yang mengambil talinya, lalu bekerja mencari dan membawa seonggok kayu di atas punggungnya, kemudian menjualnya dan dengan hasilnya ia menjaga kehormatannya adalah lebih baik ketimbang ia mengemis kepada orang lain, baik mereka memberinya atau menolaknya.\"",
        "hadith_no": "641",
        "degree": "Shahih",
        "comment": "-",
        "page": "152-153",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Sedekah"
    },
    {
        "id": "BM.4.2.642",
        "narrator": "Samurah bin Jundab",
        "ar_hadith": "َوَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( اَلْمَسْأَلَةُ كَدٌّ يَكُدُّ بِهَا اَلرَّجُلُ وَجْهَهُ, إِلَّا أَنْ يَسْأَلَ اَلرَّجُلُ سُلْطَانًا, أَوْ فِي أَمْرٍ لَا بُدَّ مِنْهُ )  رَوَاهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Meminta-minta (mengemis) adalah tindakan seseorang yang mencakar mukanya sendiri. Kecuali jika ia meminta-minta kepada penguasa atau karena suatu hal yang amat perlu dan mendesak.\"",
        "hadith_no": "642",
        "degree": "Shahih oleh Tirmidzi",
        "comment": "-",
        "page": "153",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Tirmidzi",
        "source": "Bulughul Maram",
        "sub_chapter": "Sedekah"
    },
    {
        "id": "BM.4.3.645",
        "narrator": "Qabishah bin Mukhoriq",
        "ar_hadith": "َوَعَنْ قَبِيصَةَ بْنِ مُخَارِقٍ اَلْهِلَالِيِّ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( إِنَّ اَلْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ: رَجُلٌ تَحَمَّلَ حَمَالَةً, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَهَا, ثُمَّ يُمْسِكَ، وَرَجُلٌ أَصَابَتْهُ جَائِحَةٌ, اِجْتَاحَتْ مَالَهُ, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ, وَرَجُلٌ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُومَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَومِهِ: لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ; فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ, فَمَا سِوَاهُنَّ مِنَ اَلْمَسْأَلَةِ يَا قَبِيصَةُ سُحْتٌ يَأْكُلُهَا صَاحِبُهَا  ( سُحْتًا )  رَوَاهُ مُسْلِمٌ, وَأَبُو دَاوُدَ, وَابْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya meminta-minta (mengemis) tidak dihalalkan kecuali untuk salah satu golongan dari tiga golongan yang dihalalkan. Yaitu orang yang menanggung utang orang lain, maka dibolehkan baginya untuk meminta-minta sampai ia mampu melunasinya dan kemudian ia harus berhenti. Lalu orang yang tertimpa musibah hingga menghabiskan seluruh hartanya, maka dibolehkan baginya untuk meminta-minta sampai ia mendapatkan sandaran (rezeki) hidup. Dan orang yang ditimpa kesengsaraan hidup hingga tiga orang dari kaumnya yang mengetahuinya menyatakan, 'Si fulan ditimpa kesengsaraan hidup.' Maka dibolehkan baginya untuk meminta-minta sampai mendapatkan sandaran (rezeki) hidup. Jadi, tindakan meminta-minta yang dilakukan oleh selain tiga golongan tersebut, wahai Qabishah, adalah haram dan orang yang memakannya telah memakan yang haram.\"",
        "hadith_no": "645",
        "degree": "Shahih",
        "comment": "-",
        "page": "154",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Muslim, Abu Daud, Ibnu Khuzaimah, Ibnu Hibban",
        "source": "Bulughul Maram",
        "sub_chapter": "Penyaluran Zakat"
    },
    {
        "id": "BM.4.3.646",
        "narrator": "Abdul Muttholib bin Rabi'ah bin Harits",
        "ar_hadith": "َوَعَنْ عَبْدِ اَلْمُطَّلِبِ بْنِ رَبِيعَةَ بْنِ اَلْحَارِثِ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( إِنَّ اَلصَّدَقَةَ لَا تَنْبَغِي لِآلِ مُحَمَّدٍ, إِنَّمَا هِيَ أَوْسَاخُ اَلنَّاسِ ) وَفِي رِوَايَةٍ: ( وَإِنَّهَا لَا تَحِلُّ لِمُحَمَّدٍ وَلَا آلِ مُحَمَّدٍ )  رَوَاهُ مُسْلِمٌ ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya zakat itu tidak patut diberikan kepada keluarga Muhammad, karena ia sebenarnya adalah kotoran manusia.\"",
        "hadith_no": "646",
        "degree": "Shahih",
        "comment": "Dalam sebuah riwayat, disebutkan: \"Sesungguhnya zakat tidak halal bagi Muhammad dan keluarga Muhammad\"",
        "page": "154",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Penyaluran Zakat"
    },
    {
        "id": "BM.4.3.649",
        "narrator": "Salim bin Abdullah bin Umar",
        "ar_hadith": "َوَعَنْ سَالِمِ بْنِ عَبْدِ اَللَّهِ بْنِ عُمَرَ, عَنْ أَبِيهِ; ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم كَانَ يُعْطِي عُمَرَ اَلْعَطَاءَ, فَيَقُولُ: أَعْطِهِ أَفْقَرَ مِنِّي, فَيَقُولُ: \"خُذْهُ فَتَمَوَّلْهُ, أَوْ تَصَدَّقْ بِهِ, وَمَا جَاءَكَ مِنْ هَذَا اَلْمَالِ, وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ, وَمَا لَا فَلَا تُتْبِعْهُ نَفْسَكَ\" )  رَوَاهُ مُسْلِمٌ",
        "hadith": "Dari ayahnya, disebutkan bahwa Rasulullah (saw.) pernah memberikan sesuatu kepada Umar bin Khattab (ra.). Lalu ia berkata, \"Berikanlah ini kepada orang yang lebih membutuhkan daripada diriku.\" Beliau bersabda, \"Ambillah, lalu simpanlah atau bersedekahlah dengannya. Dan apa yang datang kepadamu dari harta semacam ini, padahal engkau tidak membutuhkannya dan tidak memintanya, maka ambillah. Jika tidak demikian, maka jangan turuti nafsumu.\"",
        "hadith_no": "649",
        "degree": "Shahih",
        "comment": "-",
        "page": "155",
        "chapter": "Zakat",
        "chapter_no": "4",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Penyaluran Zakat"
    },
    {
        "id": "BM.5.0.650",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َعَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( لَا تَقَدَّمُوا رَمَضَانَ بِصَوْمِ يَوْمٍ وَلَا يَوْمَيْنِ, إِلَّا رَجُلٌ كَانَ يَصُومُ صَوْمًا, فَلْيَصُمْهُ )  مُتَّفَقٌ عَلَيْه",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Janganlah engkau mendahului Ramadhan dengan berpuasa sehari atau dua hari sebelumnya. Kecuali bagi orang yang terbiasa berpuasa, maka dibolehkan baginya untuk berpuasa.\"",
        "hadith_no": "650",
        "degree": "Shahih",
        "comment": "-",
        "page": "156",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.0.654",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "َوَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: ( تَرَاءَى اَلنَّاسُ اَلْهِلَالَ, فَأَخْبَرْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم أَنِّي رَأَيْتُهُ, فَصَامَ, وَأَمَرَ اَلنَّاسَ بِصِيَامِهِ )  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ ",
        "hadith": "Ia berkata, \"Orang-orang melihat bulan sabit, lalu aku beritahukan kepada Rasulullah (saw.) bahwa aku benar-benar telah melihatnya. Akhirnya beliau berpuasa dan menyuruh orang-orang agar berpuasa.\"",
        "hadith_no": "654",
        "degree": "Shahih oleh Hakim dan Ibnu Hibban",
        "comment": "-",
        "page": "157",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Abu Daud",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.0.658",
        "narrator": "Sahal bin Sa'ad",
        "ar_hadith": "َوَعَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اَللَّهُ عَنْهُمَا, أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( لَا يَزَالُ اَلنَّاسُ بِخَيْرٍ مَا عَجَّلُوا اَلْفِطْرَ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) bersabda, \"Orang-orang akan tetap berada dalam kebaikan selama mereka menyegerakan berbuka puasa.\"",
        "hadith_no": "658",
        "degree": "Shahih",
        "comment": "-",
        "page": "158",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.0.660",
        "narrator": "Anas bin Malik",
        "ar_hadith": "َوَعَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( تَسَحَّرُوا فَإِنَّ فِي اَلسَّحُورِ بَرَكَةً )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Santaplah hidangan sahur kalian, karena sesungguhnya dalam menyantap hidangan sahur itu mengandung keberkahan.\"",
        "hadith_no": "660",
        "degree": "Shahih",
        "comment": "-",
        "page": "158",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.0.664",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: ( كَانَ رَسُولُ اَللَّهِ صلى الله عليه وسلم يُقَبِّلُ وَهُوَ صَائِمٌ, وَيُبَاشِرُ وَهُوَ صَائِمٌ, وَلَكِنَّهُ أَمْلَكُكُمْ لِإِرْبِهِ )  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ. وَزَادَ فِي رِوَايَةٍ: ( فِي رَمَضَانَ )",
        "hadith": "Ia berkata, \"Rasulullah (saw.) pernah mencium sewaktu berpuasa dan mencumbu saat berpuasa. Namun beliau adalah orang yang paling kuat menahan nafsunya di antara kalian semua.\"",
        "hadith_no": "664",
        "degree": "Shahih",
        "comment": "Lafadznya menurut riwayat Muslim",
        "page": "160",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.0.673",
        "narrator": "Hamzah bin Amru",
        "ar_hadith": "َوَعَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ رِضَى اَللَّهُ عَنْهُ; أَنَّهُ قَالَ: ( يَا رَسُولَ اَللَّهِ! أَجِدُ بِي قُوَّةً عَلَى اَلصِّيَامِ فِي اَلسَّفَرِ, فَهَلْ عَلَيَّ جُنَاحٌ? فَقَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم هِيَ رُخْصَةٌ مِنَ اَللَّهِ, فَمَنْ أَخَذَ بِهَا فَحَسَنٌ, وَمَنْ أَحَبَّ أَنْ يَصُومَ فَلَا جُنَاحَ عَلَيْهِ )  رَوَاهُ مُسْلِمٌ. وَأَصْلُهُ فِي اَلْمُتَّفَقِِ مِنْ حَدِيثِ عَائِشَةَ; ( أَنَّ حَمْزَةَ بْنَ عَمْرٍو سَأَلَ )",
        "hadith": "Ia berkata, \"Wahai Rasulullah, sesungguhnya aku kuat untuk tetap berpuasa dalam perjalanan. Namun apakah aku berdosa (jika melakukannya)?\" Rasulullah (saw.) menjawab, \"Ia (tidak berpuasa dalam perjalanan) adalah keringanan dari Allah, barangsiapa yang melaksanakan keringanan itu maka dianggap baik. Namun barangsiapa memilih untuk berpuasa, maka ia tidak berdosa.\"",
        "hadith_no": "673",
        "degree": "Shahih",
        "comment": "-",
        "page": "162",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.0.677",
        "narrator": "'Aisyah binti Abu Bakar, Ummu Salamah",
        "ar_hadith": "َوَعَنْ عَائِشَةَ وَأُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهُمَا ( أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم كَانَ يُصْبِحُ جُنُبًا مِنْ جِمَاعٍ, ثُمَّ يَغْتَسِلُ وَيَصُومُ )  مُتَّفَقٌ عَلَيْهِ زَادَ مُسْلِمٌ فِي حَدِيثِ أُمِّ سَلَمَةَ: ] وَ [ لَا يَقْضِي",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah memasuki waktu pagi dalam keadaan junub karena bersetubuh. Kemudian beliau mandi dan tetap berpuasa.",
        "hadith_no": "677",
        "degree": "Shahih",
        "comment": "Muslim menambahkan di dalam hadits Ummu Salamah: \"Dan beliau tidak meng-<i>qadha<\/i> puasanya\"",
        "page": "163",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.0.679",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) bersabda, \"Barangsiapa meninggal dunia sedangkan ia masih memiliki tanggungan puasa (wajib), maka walinya yang berpuasa untuknya (melunasinya).\"",
        "hadith_no": "679",
        "degree": "Shahih",
        "comment": "-",
        "page": "163",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa"
    },
    {
        "id": "BM.5.1.680",
        "narrator": "Abu Qatadah",
        "ar_hadith": "َوَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم ( نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ )  رَوَاهُ اَلْخَمْسَةُ غَيْرَ اَلتِّرْمِذِيِّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَالْحَاكِمُ, وَاسْتَنْكَرَهُ الْعُقَيْلِيُّ",
        "hadith": "Rasulullah (saw.) pernah ditanya mengenai puasa hari Arafah. Lalu beliau menjawab, \"Puasa Arafah dapat menghapus dosa-dosa tahun lalu dan yang akan datang.\" Beliau juga ditanya tentang puasa hari Asyura, lalu beliau menjawab, \"Puasa itu dapat menghapus dosa-dosa tahun yang lalu.\" Dan ketika ditanya tentang puasa hari Senin, beliau menjawab, \"Ia adalah hari kelahiranku, hari aku diutus, dan hari diturunkan Al-Qur'an kepadaku.\"",
        "hadith_no": "680",
        "degree": "Shahih",
        "comment": "-",
        "page": "164",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.681",
        "narrator": "Abu Ayyub Al-Anshary",
        "ar_hadith": "َوَعَنْ أَبِي أَيُّوبَ اَلْأَنْصَارِيِّ رضي الله عنه أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( مَنْ صَامَ رَمَضَانَ, ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ اَلدَّهْرِ )  رَوَاهُ مُسْلِمٌ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa telah berpuasa Ramadhan, kemudian diikutinya dengan berpuasa enam hari di bulan Syawal, maka ia seperti berpuasa setahun lamanya.\"",
        "hadith_no": "681",
        "degree": "Shahih",
        "comment": "-",
        "page": "164",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.682",
        "narrator": "Abu Said Al-Khudry",
        "ar_hadith": "َوَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( مَا مِنْ عَبْدٍ يَصُومُ يَوْمًا فِي سَبِيلِ اَللَّهِ إِلَّا بَاعَدَ اَللَّهُ بِذَلِكَ اَلْيَوْمِ عَنْ وَجْهِهِ اَلنَّارَ سَبْعِينَ خَرِيفًا )  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Tidaklah seorang hamba berpuasa sehari saat perang di jalan Allah, melainkan Dia akan menjauhkan dirinya dengan puasa itu dari api neraka sejauh jarak perjalanan 70 tahun.\"",
        "hadith_no": "682",
        "degree": "Shahih",
        "comment": "Lafadz ada pada Muslim",
        "page": "164",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.684",
        "narrator": "Abu Dzar",
        "ar_hadith": "َوَعَنْ أَبِي ذَرٍّ رضي الله عنه قَالَ: ( أَمَرَنَا رَسُولُ اَللَّهِ صلى الله عليه وسلم أَنْ نَصُومَ مِنْ اَلشَّهْرِ ثَلَاثَةَ أَيَّامٍ: ثَلَاثَ عَشْرَةَ, وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ )  رَوَاهُ النَّسَائِيُّ, وَاَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "hadith": "Ia berkata, \"Rasulullah (saw.) memerintahkan kita untuk puasa tiga hari dalam sebulan, yaitu pada tanggal 13,14, dan 15.\"",
        "hadith_no": "684",
        "degree": "Shahih oleh Ibnu Hibban",
        "comment": "-",
        "page": "165",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Nasa'i, Tirmidzi",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.685",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َوَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( لَا يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ )  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ. وَزَادَ أَبُو دَاوُدَ: ( غَيْرَ رَمَضَانَ )",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) bersabda, \"Tidak diperbolehkan bagi seorang perempuan berpuasa di saat suaminya di rumah (bersamanya), kecuali dengan seizinnya.\"",
        "hadith_no": "685",
        "degree": "Shahih",
        "comment": "Lafadznya menurut riwayat Bukhari. Abu Daud menambahkann: \"Kecuali pada bulan Ramadhan.\"",
        "page": "165",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.686",
        "narrator": "Abu Said Al-Khudry",
        "ar_hadith": "َوَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ رضي الله عنه ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم نَهَى عَنْ صِيَامِ يَوْمَيْنِ: يَوْمِ اَلْفِطْرِ وَيَوْمِ اَلنَّحْرِ )  مُتَّفَقٌ عَلَيْهِ.",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) melarang berpuasa pada dua hari, yaitu pada hari raya Idul Fitri dan hari raya Idul Adha.",
        "hadith_no": "686",
        "degree": "Shahih",
        "comment": "-",
        "page": "165",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.688",
        "narrator": "Abdullah bin Umar, 'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْ عَائِشَةَ وَابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمْ قَالَا: ( لَمْ يُرَخَّصْ فِي أَيَّامِ اَلتَّشْرِيقِ أَنْ يُصَمْنَ إِلَّا لِمَنْ لَمْ يَجِدِ اَلْهَدْيَ )  رَوَاهُ اَلْبُخَارِيُّ",
        "hadith": "Keduanya berkata, \"Tidak diizinkan berpuasa pada hari-hari <i>tasyriq<\/i>, kecuali bagi orang yang tidak mendapatkan hewan <i>hady<\/i> (hewan kurban di Mina saat ibadah haji).\"",
        "hadith_no": "688",
        "degree": "Shahih",
        "comment": "-",
        "page": "165-166",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.689",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َوَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه عَنِ اَلنَّبِيِّ صلى الله عليه وسلم قَالَ: ( لَا تَخْتَصُّوا لَيْلَةَ اَلْجُمُعَةِ بِقِيَامٍ مِنْ بَيْنِ اَللَّيَالِي, وَلَا تَخْتَصُّوا يَوْمَ اَلْجُمُعَةِ بِصِيَامٍ مِنْ بَيْنِ اَلْأَيَّامِ, إِلَّا أَنْ يَكُونَ فِي صَوْمٍ يَصُومُهُ أَحَدُكُمْ )  رَوَاهُ مُسْلِمٌ",
        "hadith": "Dari Rasulullah (saw.), beliau bersabda, \"Janganlah mengkhususkan malam Jum'at dibanding malam-malam lainnya untuk melaksanakan <i>qiyamul lail<\/i>. Dan janganlah kalian mengkhususkan hari Jum'at untuk berpuasa dibanding hari-hari lainnya, kecuali jika seseorang di antara kamu sudah terbiasa berpuasa sebelumnya (hari Jum'at).\"",
        "hadith_no": "689",
        "degree": "Shahih",
        "comment": "-",
        "page": "166",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.1.693",
        "narrator": "Ummu Salamah",
        "ar_hadith": "َوَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا; ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم كَانَ أَكْثَرَ مَا يَصُومُ مِنَ اَلْأَيَّامِ يَوْمُ اَلسَّبْتِ, وَيَوْمُ اَلْأَحَدِ, وَكَانَ يَقُولُ: إِنَّهُمَا يَوْمَا عِيدٍ لِلْمُشْرِكِينَ, وَأَنَا أُرِيدُ أَنْ أُخَالِفَهُمْ )  أَخْرَجَهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَهَذَا لَفْظُهُ ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) paling sering puasa pada hari Sabtu dan Ahad dibanding dengan hari-hari lainnya. Beliau bersabda, \"Dua hari tersebut adalah hari-hari raya orang musyrik dan aku ingin menentang mereka.\"",
        "hadith_no": "693",
        "degree": "Shahih oleh Ibnu Khuzaimah",
        "comment": "-",
        "page": "167",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Nasa'i",
        "source": "Bulughul Maram",
        "sub_chapter": "Puasa Sunnah dan yang Dilarang"
    },
    {
        "id": "BM.5.2.697",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َعَنْ أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا, غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ )  مُتَّفَقٌ عَلَيْه",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Barangsiapa melakukan ibadah Ramadhan dengan penuh keimanan dan mengharap ridha-Nya, maka diampuni dosa-dosanya yang telah lewat.\"",
        "hadith_no": "697",
        "degree": "Shahih",
        "comment": "-",
        "page": "167",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "I'tikaf dan Qiyam Ramadhan"
    },
    {
        "id": "BM.5.2.698",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: ( كَانَ رَسُولُ اَللَّهِ صلى الله عليه وسلم إِذَا دَخَلَ اَلْعَشْرُ -أَيْ: اَلْعَشْرُ اَلْأَخِيرُ مِنْ رَمَضَانَ- شَدَّ مِئْزَرَهُ, وَأَحْيَا لَيْلَهُ, وَأَيْقَظَ أَهْلَهُ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Jika Rasulullah (saw.) telah memasuki sepuluh hari terakhir dari bulan Ramadhan, maka beliau mengencangkan kain sarungnya (bersungguh-sungguh), menghidupkan malamnya (dengan ibadah), dan membangunkan keluarganya.\"",
        "hadith_no": "698",
        "degree": "Shahih",
        "comment": "-",
        "page": "167-168",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "I'tikaf dan Qiyam Ramadhan"
    },
    {
        "id": "BM.5.2.699",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْهَا: ( أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ اَلْعَشْرَ اَلْأَوَاخِرَ مِنْ رَمَضَانَ, حَتَّى تَوَفَّاهُ اَللَّهُ, ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ )  مُتَّفَقٌ عَلَيْه",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) selalu beri'tikaf pada sepuluh hari terakhir dari bulan Ramadhan hingga beliau wafat. Setelah wafatnya, para istri Rasulullah (saw.) juga beri'tikaf.",
        "hadith_no": "699",
        "degree": "Shahih",
        "comment": "-",
        "page": "168",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "I'tikaf dan Qiyam Ramadhan"
    },
    {
        "id": "BM.5.2.701",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْهَا قَالَتْ: ( إِنْ كَانَ رَسُولُ اَللَّهِ صلى الله عليه وسلم لَيُدْخِلُ عَلَيَّ رَأْسَهُ -وَهُوَ فِي اَلْمَسْجِدِ- فَأُرَجِّلُهُ, وَكَانَ لَا يَدْخُلُ اَلْبَيْتَ إِلَّا لِحَاجَةٍ, إِذَا كَانَ مُعْتَكِفًا )  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ",
        "hadith": "Ia berkata, \"Rasulullah (saw.) pernah memasukkan kepalanya ke dalam rumah (sementara beliau di dalam masjid), lalu aku menyisir rambutnya. Dan jika beliau beri'tikaf, maka beliau tidak masuk ke rumah, kecuali untuk suatu keperluan.\"",
        "hadith_no": "701",
        "degree": "Shahih",
        "comment": "Lafadznya milik Bukhari",
        "page": "168",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "I'tikaf dan Qiyam Ramadhan"
    },
    {
        "id": "BM.5.2.704",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "َوَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: ( أَنَّ رِجَالاً مِنْ أَصْحَابِ اَلنَّبِيِّ صلى الله عليه وسلم أُرُوا لَيْلَةَ اَلْقَدْرِ فِي اَلْمَنَامِ, فِي اَلسَّبْعِ اَلْأَوَاخِرِ, فَقَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي اَلسَّبْعِ اَلْأَوَاخِرِ, فَمَنْ كَانَ مُتَحَرِّيَهَا فَلْيَتَحَرَّهَا فِي اَلسَّبْعِ اَلْأَوَاخِرِ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwa beberapa shahabat Rasulullah (saw.) melihat <i>lailatul qadr<\/i> di dalam mimpi, yang jatuh di tujuh malam terakhir. Maka Rasulallah (saw.) bersabda, \"Aku telah ditunjukkan kebenaran tentang mimpimu pada tujuh malam yang terakhir, maka barangsiapa ingin mencarinya hendaknya ia mencari pada tujuh malam terakhir.\"",
        "hadith_no": "704",
        "degree": "Shahih",
        "comment": "-",
        "page": "169",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "I'tikaf dan Qiyam Ramadhan"
    },
    {
        "id": "BM.5.2.707",
        "narrator": "Abu Said Al-Khudry",
        "ar_hadith": "َوَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ رضي الله عنه قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم : ( لَا تُشَدُّ اَلرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ: اَلْمَسْجِدِ اَلْحَرَامِ, وَمَسْجِدِي هَذَا, وَالْمَسْجِدِ اَلْأَقْصَى )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Tidak ada perjalanan kecuali ke tiga masjid, yaitu Masjidil Haram, Masjidku ini, dan Masjidil Aqsha.\"",
        "hadith_no": "707",
        "degree": "Shahih",
        "comment": "-",
        "page": "170",
        "chapter": "Puasa",
        "chapter_no": "5",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "I'tikaf dan Qiyam Ramadhan"
    },
    {
        "id": "BM.6.1.708",
        "narrator": "Abu Hurairah",
        "ar_hadith": "َعَنْ أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( اَلْعُمْرَةُ إِلَى اَلْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا, وَالْحَجُّ اَلْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلَّا اَلْجَنَّةَ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Umrah ke umrah menghapus dosa-dosa (yang dilakukan) di antara keduanya, dan tidak ada pahala bagi haji mabrur kecuali surga.\"",
        "hadith_no": "708",
        "degree": "Shahih",
        "comment": "-",
        "page": "171",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Keutamaan Haji dan Pihak yang Wajib Melaksanakannya"
    },
    {
        "id": "BM.6.1.714",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "َوَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; ( أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم لَقِيَ رَكْبًا بِالرَّوْحَاءِ فَقَالَ: مَنِ اَلْقَوْمُ? قَالُوا: اَلْمُسْلِمُونَ. فَقَالُوا: مَنْ أَنْتَ? قَالَ: رَسُولُ اَللَّهِ صلى الله عليه وسلم فَرَفَعَتْ إِلَيْهِ اِمْرَأَةٌ صَبِيًّا. فَقَالَتْ: أَلِهَذَا حَجٌّ? قَالَ: \" نَعَمْ: وَلَكِ أَجْرٌ )  رَوَاهُ مُسْلِمٌ ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah bertemu dengan suatu kafilah di Rauhaa, lalu beliau bertanya, \"Siapa rombongan ini?\" Mereka berkata, \"Siapa engkau?\" Beliau menjawab, \"Rasulullah.\" Kemudian seorang perempuan mengangkat seorang anak kecil seraya bertanya: \"Apakah yang ini boleh berhaji?\" Beliau bersabda, \"Ya boleh, dan engkau mendapatkan pahalanya.\"",
        "hadith_no": "714",
        "degree": "Shahih",
        "comment": "-",
        "page": "172",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Keutamaan Haji dan Pihak yang Wajib Melaksanakannya"
    },
    {
        "id": "BM.6.1.716",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "َوَعَنْهُ: ( أَنَّ اِمْرَأَةً مِنْ جُهَيْنَةَ جَاءَتْ إِلَى اَلنَّبِيِّ صلى الله عليه وسلم فَقَالَتْ: إِنَّ أُمِّي نَذَرَتْ أَنْ تَحُجَّ, فَلَمْ تَحُجَّ حَتَّى مَاتَتْ, أَفَأَحُجُّ عَنْهَا? قَالَ: نَعَمْ , حُجِّي عَنْهَا, أَرَأَيْتِ لَوْ كَانَ عَلَى أُمِّكِ دَيْنٌ, أَكُنْتِ قَاضِيَتَهُ? اِقْضُوا اَللَّهَ, فَاَللَّهُ أَحَقُّ بِالْوَفَاءِ )  رَوَاهُ اَلْبُخَارِيُّ",
        "hadith": "Disebutkan bahwa Ada seorang perempuan dari Juhainah datang menemui Rasulullah (saw.), lalu berkata, \"Sesungguhnya ibuku telah bernadzar untuk menunaikan haji. Namun ia belum melaksanakannya hingga akhirnya meninggal dunia. Jadi apakah aku harus berhaji untuknya?\" Beliau bersabda, \"Ya, berhajilah untuknya. Bagaimana pendapatmu seandainya ibumu menanggung beban hutang, tidakkah engkau akan melunasinya?! Bayarlah pada Allah, karena Allah lebih berhak untuk ditepati janji-Nya (dilaksanakan hak-Nya, yaitu haji).\"",
        "hadith_no": "716",
        "degree": "Shahih",
        "comment": "-",
        "page": "173",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Keutamaan Haji dan Pihak yang Wajib Melaksanakannya"
    },
    {
        "id": "BM.6.1.718",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "َوَعَنْهُ: سَمِعْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم يَخْطُبُ يَقُولُ: ( \" لَا يَخْلُوَنَّ رَجُلٌ بِاِمْرَأَةٍ إِلَّا وَمَعَهَا ذُو مَحْرَمٍ, وَلَا تُسَافِرُ اَلْمَرْأَةُ إِلَّا مَعَ ذِي مَحْرَمٍ \" فَقَامَ رَجُلٌ, فَقَالَ: يَا رَسُولَ اَللَّهِ, إِنَّ اِمْرَأَتِي خَرَجَتْ حَاجَّةً, وَإِنِّي اِكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا, قَالَ: اِنْطَلِقْ, فَحُجَّ مَعَ اِمْرَأَتِكَ )  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ",
        "hadith": "Ia berkata, \"Aku pernah mendengar Rasulullah (saw.) menyampaikan khutbah dan beliau bersabda, 'Janganlah sekali-kali seorang laki-laki menyepi dengan seorang perempuan kecuali dengan mahramnya, dan janganlah seorang perempuan bepergian kecuali bersama mahramnya.' Lalu seorang laki-laki berdiri dan berkata, 'Wahai Rasulullah, sesungguhnya istriku pergi haji sedang aku diwajibkan ikut perang ini dan itu.' Maka beliau bersabda, 'Berangkatlah dan berhajilah bersama istrimu.'\"",
        "hadith_no": "718",
        "degree": "Shahih",
        "comment": "Lafadznya milik Muslim",
        "page": "173-174",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Keutamaan Haji dan Pihak yang Wajib Melaksanakannya"
    },
    {
        "id": "BM.6.2.722",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "َعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; ( أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم وَقَّتَ لِأَهْلِ اَلْمَدِينَةِ: ذَا الْحُلَيْفَةِ, وَلِأَهْلِ اَلشَّامِ: اَلْجُحْفَةَ, وَلِأَهْلِ نَجْدٍ: قَرْنَ اَلْمَنَازِلِ, وَلِأَهْلِ اَلْيَمَنِ: يَلَمْلَمَ, هُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِنَّ مِمَّنْ أَرَادَ اَلْحَجَّ وَالْعُمْرَةَ, وَمَنْ كَانَ دُونَ ذَلِكَ فَمِنْ حَيْثُ أَنْشَأَ, حَتَّى أَهْلُ مَكَّةَ مِنْ مَكَّةَ )  مُتَّفَقٌ عَلَيْه ِ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) menentukan Dzul Khulaifah sebagai miqat penduduk Madinah, Juhfah sebagai miqat penduduk Syam, Qarnul Manazil sebagai miqat penduduk Najd, dan Yalamlam sebagai miqat penduduk Yaman. Tempat-tempat tersebut adalah miqat bagi penduduknya, dan bagi mereka yang datang ke sana dari penduduk (negeri lain) yang ingin menunaikan haji dan umrah. Barangsiapa yang tinggal (di dalam lokasi yang letaknya lebih dekat ke Makkah dari miqat-miqat itu), maka dia berihram dari tempat tinggalnya, hingga penduduk Makkah pun miqatnya dari Makkah.\"",
        "hadith_no": "722",
        "degree": "Shahih",
        "comment": "-",
        "page": "175",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Miqat-Miqat"
    },
    {
        "id": "BM.6.3.727",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: ( خَرَجْنَا مَعَ اَلنَّبِيِّ صلى الله عليه وسلم عَامَ حَجَّةِ اَلْوَدَاعِ, فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ, وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ, وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ, وَأَهَلَّ رَسُولُ اَللَّهِ صلى الله عليه وسلم بِالْحَجِّ, فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَحَلَّ, وَأَمَّا مَنْ أَهَلَّ بِحَجٍّ, أَوْ جَمَعَ اَلْحَجَّ وَالْعُمْرَةَ فَلَمْ يَحِلُّوا حَتَّى كَانَ يَوْمَ اَلنَّحْرِ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Kami pernah pergi bersama Rasulullah (saw.) pada waktu Haji Wada'. Saat itu, di antara kami ada yang berihram untuk umrah, ada yang berihram untuk haji dan umrah, dan ada yang berihram untuk haji. Sedangkan Rasulullah (saw.) berihram untuk haji. Bagi yang berihram untuk umrah, ia boleh menanggalkan ihramnya (tahallul) sewaktu datang (ke kota Makkah). Adapun bagi yang berihram untuk haji atau menggabungkan antara haji dan umrah, ia tidak boleh menanggalkan ihramnya sampai pada hari Raya Qurban.\"",
        "hadith_no": "727",
        "degree": "Shahih",
        "comment": "-",
        "page": "176",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan Sifatnya"
    },
    {
        "id": "BM.6.4.728",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "ََعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: ( مَا أَهَلَّ رَسُولُ اَللَّهِ صلى الله عليه وسلم إِلَّا مِنْ عِنْدِ اَلْمَسْجِدِ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Rasulullah (saw.) tidak pernah berihram kecuali dari masjid.\"",
        "hadith_no": "728",
        "degree": "Shahih",
        "comment": "-",
        "page": "176",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.4.731",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "ََوَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم سُئِلَ: مَا يَلْبَسُ اَلْمُحْرِمُ مِنْ اَلثِّيَابِ? فَقَالَ: لَا تَلْبَسُوا الْقُمُصَ, وَلَا اَلْعَمَائِمَ, وَلَا السَّرَاوِيلَاتِ, وَلَا اَلْبَرَانِسَ, وَلَا اَلْخِفَافَ, إِلَّا أَحَدٌ لَا يَجِدُ اَلنَّعْلَيْنِ فَلْيَلْبَسْ اَلْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ اَلْكَعْبَيْنِ, وَلَا تَلْبَسُوا شَيْئًا مِنْ اَلثِّيَابِ مَسَّهُ اَلزَّعْفَرَانُ وَلَا اَلْوَرْسُ )  مُتَّفَقٌ عَلَيْهِ وَاللَّفْظُ لِمُسْلِمٍ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah ditanya, \"Pakaian apa yang boleh dikenakan oleh orang yang berihram?\" Beliau menjawab, \"Janganlah kalian memakai baju, surban, celana, penutup kepala (topi dan sejenisnya), dan sepatu (<i>khuf<\/i>) kecuali seseorang yang tidak memiliki sandal, ia boleh menggunakan sepatu. Namun hendaknya ia memotong bagian yang lebih bawah dari mata kaki. Selain itu, janganlah memakai pakaian yang diolesi dengan minyak <i>Za'faran<\/i> dan <i>Wars<\/i>.'\"",
        "hadith_no": "731",
        "degree": "Shahih",
        "comment": "Lafadznya milik riwayat Muslim.",
        "page": "177",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.4.733",
        "narrator": "Utsman bin Affan",
        "ar_hadith": "ََوَعَنْ عُثْمَانَ بْنِ عَفَّانَ رضي الله عنه أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( لَا يَنْكِحُ اَلْمُحْرِمُ, وَلَا يُنْكِحُ, وَلَا يَخْطُبُ )  رَوَاهُ مُسْلِمٌ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Orang yang sedang berihram tidak diperbolehkan menikah, menikahkan, dan melamar.\"",
        "hadith_no": "733",
        "degree": "Shahih",
        "comment": "-",
        "page": "177",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.4.736",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "ََوَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( خَمْسٌ مِنَ اَلدَّوَابِّ كُلُّهُنَّ فَاسِقٌ, يُقْتَلْنَ فِي اَلْحِلِّ وَ اَلْحَرَمِ: اَلْغُرَابُ, وَالْحِدَأَةُ, وَالْعَقْرَبُ, وَالْفَأْرَةُ، وَالْكَلْبُ اَلْعَقُورُ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Ada lima binatang yang semuanya jahat, yang boleh dibunuh baik di tanah halal maupun haram. Yaitu kalajengking, burung elang, burung gagak, tikus, dan anjing galak.'\"",
        "hadith_no": "736",
        "degree": "Shahih",
        "comment": "-",
        "page": "178",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.4.737",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "ََوَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم ( اِحْتَجَمَ وَهُوَ مُحْرِمٌ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) pernah berbekam ketika beliau sedang berihram.",
        "hadith_no": "737",
        "degree": "Shahih",
        "comment": "-",
        "page": "178",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.4.738",
        "narrator": "Ka'ab bin Ujrah",
        "ar_hadith": "ََوَعَنْ كَعْبِ بْنِ عُجْرَةَ رضي الله عنه قَالَ: ( حُمِلْتُ إِلَى رَسُولِ اَللَّهِ صلى الله عليه وسلم وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي, فَقَالَ: مَا كُنْتُ أَرَى اَلْوَجَعَ بَلَغَ بِكَ مَا أَرَى, تَجِدُ شَاةً ? قُلْتُ: لَا. قَالَ: فَصُمْ ثَلَاثَةَ أَيَّامٍ, أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ, لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Aku pernah dihadapkan kepada Rasulullah (saw.) sementara kutu-kutu bertaburan di mukaku. Lalu Rasulullah (saw.) berkata, \"Aku tidak mengira penyakitmu begitu parah seperti yang kulihat, apakah engkau mampu (berkurban) seekor kambing?\" Aku menjawab, \"Tidak.\" Beliau berkata, \"Puasalah tiga hari, atau berilah makan enam orang miskin masing-masing setengah <i>sha'<\/i>.\"",
        "hadith_no": "738",
        "degree": "Shahih",
        "comment": "-",
        "page": "178",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.4.739",
        "narrator": "Abu Hurairah",
        "ar_hadith": "ََوَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: ( لَمَّا فَتَحَ اَللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مَكَّةَ, قَامَ رَسُولُ اَللَّهِ صلى الله عليه وسلم فِي اَلنَّاسِ، فَحَمِدَ اَللَّهَ وَأَثْنَى عَلَيْهِ, ثُمَّ قَالَ: إِنَّ اَللَّهَ حَبَسَ عَنْ مَكَّةَ اَلْفِيلَ, وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ, وَإِنَّهَا لَمْ تَحِلَّ لِأَحَدٍ كَانَ قَبْلِي, وَإِنَّمَا أُحِلَّتْ لِي سَاعَةٌ مِنْ نَهَارٍ, وَإِنَّهَا لَنْ تَحِلَّ لِأَحَدٍ بَعْدِي, فَلَا يُنَفَّرُ صَيْدُهَا, وَلَا يُخْتَلَى شَوْكُهَا, وَلَا تَحِلُّ سَاقِطَتُهَا إِلَّا لِمُنْشِدٍ, وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ اَلنَّظَرَيْنِ فَقَالَ اَلْعَبَّاسُ: إِلَّا اَلْإِذْخِرَ, يَا رَسُولَ اَللَّهِ, فَإِنَّا نَجْعَلُهُ فِي قُبُورِنَا وَبُيُوتِنَا, فَقَالَ: إِلَّا اَلْإِذْخِرَ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Ketika Allah menundukkan kota Makkah untuk Rasulullah (saw.), beliau berdiri di tengah orang-orang, lalu memuji Allah dan menyanjung-Nya, kemudian bersabda, 'Sesungguhnya Allah telah melindungi kota Makkah dari pasukan gajah dan menyerahkan kekuasaannya kepada Rasul-Nya dan orang-orang yang beriman. Dan sesungguhnya kota ini tidak halal bagi seorang pun sebelumku. Ia hanya dihalalkan bagiku sebentar pada waktu siang, dan tidak dihalalkan bagi seorang pun setelahku. Oleh karena itu, binatang buruan yang ada di dalamnya tidak boleh dikejar, duri pohon yang tumbuh di dalamnya tidak boleh dipatahkan, benda-benda yang jatuh tidak boleh diambil kecuali bagi orang yang mengumumkannya. Dan barangsiapa terbunuh, maka keluarganya boleh memilih yang terbaik antara dua perkara (denda atau qishash).' lalu Abbas berkata, 'kecuali tumbuhan <i>idzkhar<\/i>, wahai Rasulullah. Sebab kami menggunakannya di kuburan dan rumah kami.' Beliau bersabda, 'Kecuali tumbuhan <i>idzkhar<\/i>.'\"",
        "hadith_no": "739",
        "degree": "Shahih",
        "comment": "-",
        "page": "179",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.4.740",
        "narrator": "Abdullah bin Zaid bin 'Ashim",
        "ar_hadith": "ََوَعَنْ عَبْدِ اَللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ رضي الله عنه أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: ( إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَدَعَا لِأَهْلِهَا, وَإِنِّي حَرَّمْتُ اَلْمَدِينَةَ كَمَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ، وَإِنِّي دَعَوْتُ فِي صَاعِهَا وَمُدِّهَا بِمِثْلَيْ مَا دَعَا إِبْرَاهِيمُ لِأَهْلِ مَكَّةَ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) bersabda, \"Sesungguhnya Ibrahim mengharamkan kota Makkah dan mendoakan kebaikan untuk penghuninya. Dan aku mengharamkan kota Madinah sebagaimana Ibrahim mengharamkan kota Makkah. Dan aku mendoakan (keberkahan) untuk <i>sha'<\/i> dan <i>mud<\/i>-nya seperti yang didoakan Ibrahim untuk penghuni Makkah.\"",
        "hadith_no": "740",
        "degree": "Shahih",
        "comment": "-",
        "page": "179",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Ihram dan segala yang Berkenaan Dengannya"
    },
    {
        "id": "BM.6.5.763",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "ََوَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا ( أَنَّهُ كَانَ يَرْمِي اَلْجَمْرَةَ اَلدُّنْيَا, بِسَبْعِ حَصَيَاتٍ, يُكَبِّرُ عَلَى أَثَرِ كُلِّ حَصَاةٍ, ثُمَّ يَتَقَدَّمُ, ثُمَّ يُسْهِلُ, فَيَقُومُ فَيَسْتَقْبِلُ اَلْقِبْلَةَ, فَيَقُومُ طَوِيلاً, وَيَدْعُو وَيَرْفَعُ يَدَيْهِ, ثُمَّ يَرْمِي اَلْوُسْطَى, ثُمَّ يَأْخُذُ ذَاتَ اَلشِّمَالِ فَيُسْهِلُ, وَيَقُومُ مُسْتَقْبِلَ اَلْقِبْلَةِ, ثُمَّ يَدْعُو فَيَرْفَعُ يَدَيْهِ وَيَقُومُ طَوِيلاً, ثُمَّ يَرْمِي جَمْرَةَ ذَاتِ اَلْعَقَبَةِ مِنْ بَطْنِ اَلْوَادِي وَلَا يَقِفُ عِنْدَهَا, ثُمَّ يَنْصَرِفُ, فَيَقُولُ: هَكَذَا رَأَيْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم يَفْعَلُهُ )  رَوَاهُ اَلْبُخَارِيُّ",
        "hadith": "Disebutkan bahwa ia melempar <i>Jumrah Ula<\/i> dengan tujuh batu kecil, ia mengiringi dengan takbir pada setiap lemparan. Kemudian maju dan mencari tanah yang rata. Ia berdiri menghadap kiblat, berdoa dengan mengangkat tangannya dan berdiri lama. Lalu melempar <i>Jumrah Wustha<\/i>, kemudian mengambil arah kiri untuk mencari tempat yang rata. Ia berdiri menghadap kiblat, kemudian berdoa dengan mengangkat kedua tangannya dan berdiri lama. Kemudian melempar <i>Jumrah Aqabah<\/i> dari tengah lembah. Ia tidak berdiri di situ dan langsung kembali. Ia mengatakan, \"Beginilah aku melihat Rasulullah (saw.) melakukannya.\".",
        "hadith_no": "763",
        "degree": "Shahih",
        "comment": "-",
        "page": "187",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Sifat Haji dan Memasuki Kota Makkah"
    },
    {
        "id": "BM.6.5.764",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "ََوَعَنْهُ ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: اَللَّهُمَّ ارْحَمِ اَلْمُحَلِّقِينَ قَالُوا: وَالْمُقَصِّرِينَ يَا رَسُولَ اَللَّهِ. قَالَ فِي اَلثَّالِثَةِ: وَالْمُقَصِّرِينَ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) berdoa, \"Ya Allah rahmatilah orang-orang yang mencukur rambutnya.\" Lantas mereka bertanya, \"dan orang-orang yang memendekkan rambutnya, wahai Rasulullah.\" Beliau berdoa untuk yang ketiga kali, \"Dan orang-orang yang memendekkan rambutnya.\".",
        "hadith_no": "764",
        "degree": "Shahih",
        "comment": "-",
        "page": "187",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Sifat Haji dan Memasuki Kota Makkah"
    },
    {
        "id": "BM.6.5.766",
        "narrator": "Al-Miswar bin Makhramah",
        "ar_hadith": "ََوَعَنْ اَلْمِسْوَرِ بْنِ مَخْرَمَةَ رَضِيَ اَللَّهُ عَنْهُمَا ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم نَحَرَ قَبْلَ أَنْ يَحْلِقَ, وَأَمَرَ أَصْحَابَهُ بِذَلِكَ )  رَوَاهُ اَلْبُخَارِيُّ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) menyembelih kurban sebelum mencukur rambut dan menyuruh para shahabat untuk melakukannya.",
        "hadith_no": "766",
        "degree": "Shahih",
        "comment": "-",
        "page": "188",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Sifat Haji dan Memasuki Kota Makkah"
    },
    {
        "id": "BM.6.5.768",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "ََوَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, عَنِ اَلنَّبِيِّ صلى الله عليه وسلم قَالَ: ( لَيْسَ عَلَى اَلنِّسَاءِ حَلْقٌ, وَإِنَّمَا يُقَصِّرْنَ )  رَوَاهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَنٍ",
        "hadith": "Rasulullah (saw.) bersabda, \"Tidak ada kewajiban mencukur bagi perempuan, namun mereka cukup memendekkannya.\"",
        "hadith_no": "768",
        "degree": "Hasan",
        "comment": "-",
        "page": "188",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Abu Daud",
        "source": "Bulughul Maram",
        "sub_chapter": "Sifat Haji dan Memasuki Kota Makkah"
    },
    {
        "id": "BM.6.5.777",
        "narrator": "Abdullah bin Abbas",
        "ar_hadith": "ََوَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: ( أُمِرَ اَلنَّاسُ أَنْ يَكُونَ آخِرَ عَهْدِهِمْ بِالْبَيْتِ, إِلَّا أَنَّهُ خَفَّفَ عَنِ الْحَائِضِ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Orang-orang diperintahkan agar akhir dari ibadah haji yang mereka lakukan adalah thawaf di Baitullah, tetapi diberikan keringanan bagi perempuan haid (dalam hal ini).\".",
        "hadith_no": "777",
        "degree": "Shahih",
        "comment": "-",
        "page": "190",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Sifat Haji dan Memasuki Kota Makkah"
    },
    {
        "id": "BM.6.5.778",
        "narrator": "Abdullah bin Zubair",
        "ar_hadith": "ََوَعَنِ اِبْنِ اَلزُّبَيْرِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم ( صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا اَلْمَسْجِدَ اَلْحَرَامَ , وَصَلَاةٌ فِي اَلْمَسْجِدِ اَلْحَرَامِ أَفْضَلُ مِنْ صَلَاةٍ فِي مَسْجِدِي بِمِائَةِ صَلَاةٍ )  رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "hadith": "Ia mengatakan bahwasanya Rasulullah (saw.) bersabda, \"Sekali sholat di masjidku ini lebih utama daripada 1000 kali sholat di masjid lainnya kecuali Masjidil Haram, dan sekali sholat di Masjidil Haram lebih utama daripada 100 kali sholat di masjidku ini.\".",
        "hadith_no": "778",
        "degree": "Shahih oleh Ibnu Hibban",
        "comment": "-",
        "page": "190",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Ahmad",
        "source": "Bulughul Maram",
        "sub_chapter": "Sifat Haji dan Memasuki Kota Makkah"
    },
    {
        "id": "BM.6.6.780",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "ََوَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: ( دَخَلَ اَلنَّبِيُّ صلى الله عليه وسلم عَلَى ضُبَاعَةَ بِنْتِ اَلزُّبَيْرِ بْنِ عَبْدِ اَلْمُطَّلِبِ رَضِيَ اَللَّهُ عَنْهَا, فَقَالَتْ: يَا رَسُولَ اَللَّهِ! إِنِّي أُرِيدُ اَلْحَجَّ, وَأَنَا شَاكِيَةٌ، فَقَالَ اَلنَّبِيُّ صلى الله عليه وسلم حُجِّي وَاشْتَرِطِي: أَنَّ مَحَلِّي حَيْثُ حَبَسْتَنِي )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Rasulullah (saw.) masuk ke rumah Dhuba'ah binti Az-Zubair bin Abdul Muthalib. Lalu berkata, 'Wahai Rasulullah, sesungguhnya aku ingin menunaikan haji, namun aku sakit.' Rasulullah (saw.) bersabda, 'Berhajilah dan tetapkanlah syarat bahwa tempat <i>tahallul<\/i>-ku adalah di mana aku terhalang.'\"",
        "hadith_no": "780",
        "degree": "Shahih",
        "comment": "-",
        "page": "191",
        "chapter": "Haji",
        "chapter_no": "6",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Halangan dari Pelaksanaan Haji"
    },
    {
        "id": "BM.7.1.782",
        "narrator": "Rifa'ah bin Rafi'",
        "ar_hadith": "عَنْ رِفَاعَةَ بْنِ رَافِعٍ رضي الله عنه أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم سُئِلَ: أَيُّ اَلْكَسْبِ أَطْيَبُ? قَالَ: ( عَمَلُ اَلرَّجُلِ بِيَدِهِ, وَكُلُّ بَيْعٍ مَبْرُورٍ )  رَوَاهُ اَلْبَزَّارُ، وَصَحَّحَهُ اَلْحَاكِمُ.",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) pernah ditanya, \"Pekerjaan apakah yang paling baik?.\" Beliau bersabda, \"Pekerjaan seseorang dengan tangannya dan setiap jual-beli yang bersih.\"",
        "hadith_no": "782",
        "degree": "Shahih oleh Hakim",
        "comment": "-",
        "page": "192",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Al-Bazzar",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.783",
        "narrator": "Ibnu Mas'ud",
        "ar_hadith": "َوَعَنْ اِبْنِ مَسْعُودٍ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم يَقُولُ: ( إِذَا اِخْتَلَفَ اَلْمُتَبَايِعَانِ لَيْسَ بَيْنَهُمَا بَيِّنَةٌ, فَالْقَوْلُ مَا يَقُولُ رَبُّ اَلسِّلْعَةِ أَوْ يَتَتَارَكَانِ )  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "hadith": "Ia berkata, \"Aku mendengar Rasulullah (saw.) bersabda, 'Apabila dua orang yang berjual beli berselisih, sedang di antara mereka tidak ada keterangan (bukti) yang jelas, maka perkataan yang benar (yang menjadi pegangan) adalah yang dikatakan oleh pemilik barang atau mereka membatalkan transaksi.'\"",
        "hadith_no": "783",
        "degree": "Shahih oleh Hakim",
        "comment": "-",
        "page": "193",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Ahmad, Abu Daud, Ibnu Majah, Tirmidzi, Nasa'i",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.784",
        "narrator": "Abu Mas'ud Al-Anshory",
        "ar_hadith": "َوَعَنْ أَبِي مَسْعُودٍ رضي الله عنه ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ اَلْكَلْبِ, وَمَهْرِ الْبَغِيِّ, وَحُلْوَانِ اَلْكَاهِنِ )  مُتَّفَقٌ عَلَيْه",
        "hadith": "Disebutkan bahwasanya Rasulullah (saw.) melarang mengambil uang hasil penjualan anjing, uang hasil pelacuran, dan uang hasil pertenungan (perdukunan).",
        "hadith_no": "784",
        "degree": "Shahih",
        "comment": "-",
        "page": "193",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.785",
        "narrator": "Jabir bin Abdullah",
        "ar_hadith": "َوَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ -رَضِيَ اَللَّهُ عَنْهُمَا-; ( أَنَّهُ كَانَ ] يَسِيرُ [ عَلَى جَمَلٍ لَهُ أَعْيَا. فَأَرَادَ أَنْ يُسَيِّبَهُ. قَالَ: فَلَحِقَنِي اَلنَّبِيُّ صلى الله عليه وسلم فَدَعَا لِي, وَضَرَبَهُ، فَسَارَ سَيْراً لَمْ يَسِرْ مِثْلَهُ, قَالَ: بِعْنِيهِ بِوُقِيَّةٍ قُلْتُ: لَا. ثُمَّ قَالَ: بِعْنِيهِ فَبِعْتُهُ بِوُقِيَّةٍ, وَاشْتَرَطْتُ حُمْلَانَهُ إِلَى أَهْلِي, فَلَمَّا بَلَغْتُ أَتَيْتُهُ بِالْجَمَلِ, فَنَقَدَنِي ثَمَنَهُ, ثُمَّ رَجَعْتُ فَأَرْسَلَ فِي أَثَرِي. فَقَالَ: أَتُرَانِي مَاكَسْتُكَ لِآخُذَ جَمَلَكَ? خُذْ جَمَلَكَ وَدَرَاهِمَكَ. فَهُوَ لَكْ )  مُتَّفَقٌ عَلَيْهِ , وَهَذَا اَلسِّيَاقُ لِمُسْلِمٍ",
        "hadith": "Disebutkan bahwa ia menunggangi untanya yang sudah lemah dan ia ingin membiarkannya. Ia berkata, \"Aku bertemu Rasulullah (saw.), lalu beliau berdoa untukku dan memukul untaku.\" Kemudian unta itu berjalan tidak seperti biasanya. Lalu beliau bersabda, \"Juallah ia padaku dengan satu <i>uqiyyah<\/i>.\" Aku berkata, \"Tidak.\" Beliau bersabda lagi, \"Juallah unta itu padaku dengan harga satu <i>uqiyyah<\/i>.\" Lalu aku menjualnya dengan satu <i>uqiyyah<\/i>, namun dengan syarat aku membawanya dahulu pada keluargaku. Setelah aku melakukannya aku datang pada beliau dengan unta itu dan beliau membayar harganya kepadaku. Kemudian aku pulang dan beliau mengirim seseorang membuntutiku. Lalu beliau bersabda, \"Apakah engkau mengira aku menawarmu untuk mengambil untamu? Ambillah untamu dan uangmu, sebagai hadiah untukmu.\"",
        "hadith_no": "785",
        "degree": "Shahih",
        "comment": "Susunan kalimatnya milik riwayat Muslim.",
        "page": "193-194",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.786",
        "narrator": "Jabir bin Abdullah",
        "ar_hadith": "َوَعَنْهُ قَالَ: ( أَعْتَقَ رَجُلٌ مِنَّا عَبْداً لَهُ عَنْ دُبُرٍ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ. فَدَعَا بِهِ اَلنَّبِيُّ صلى الله عليه وسلم فَبَاعَهُ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Ia berkata, \"Seseorang di antara kami berwasiat memerdekakan seorang budak miliknya setelah ia meninggal dunia, padahal ia tidak memiliki harta selain budak tersebut. Lalu Rasulullah (saw.) memanggil budak itu dan menjualnya.\"",
        "hadith_no": "786",
        "degree": "Shahih",
        "comment": "-",
        "page": "194",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.787",
        "narrator": "Maimunah",
        "ar_hadith": "َوَعَنْ مَيْمُونَةَ زَوْجِ اَلنَّبِيِّ -صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ, وَرَضِيَ عَنْهَا-; ( أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ, فَمَاتَتْ فِيهِ, فَسُئِلَ اَلنَّبِيُّ صلى الله عليه وسلم عَنْهَا. فَقَالَ: أَلْقُوهَا وَمَا حَوْلَهَا, وَكُلُوهُ )  رَوَاهُ اَلْبُخَارِيُّ وَزَادَ أَحْمَدُ. وَالنَّسَائِيُّ: فِي سَمْنٍ جَامِدٍ",
        "hadith": "Disebutkan bahwa ada seekor tikus yang jatuh ke dalam samin (minyak sejenis mentega), lalu mati di dalamnya. Kemudian hal itu ditanyakan kepada Rasulullah (saw.) dan beliau menjawab, \"Buanglah tikus dan bagian samin yang ada di sekitarnya (bangkai tikus tersebut), dan makanlah (samin yang tersisa).\"",
        "hadith_no": "787",
        "degree": "Shahih",
        "comment": "Ahmad dan Nasa'i menambahkan: \"Dalam samin yang beku.\"",
        "page": "194",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.789",
        "narrator": "Abu Az-Zubair",
        "ar_hadith": "َوَعَنْ أَبِي اَلزُّبَيْرِ قَالَ: سَأَلْتُ جَابِرًا عَنْ ثَمَنِ اَلسِّنَّوْرِ وَالْكَلْبِ? فَقَالَ: ( زَجَرَ اَلنَّبِيُّ صلى الله عليه وسلم عَنْ ذَلِكَ )  رَوَاهُ مُسْلِمٌ وَالنَّسَائِيُّ وَزَادَ: ( إِلَّا كَلْبَ صَيْدٍ )",
        "hadith": "Ia berkata, \"Aku pernah bertanya kepada Jabir (ra.) tentang harga kucing dan anjing. Ia berkata, 'Rasulullah (saw.) melarang hal itu (menggunakan hasil penjualannya).'\"",
        "hadith_no": "789",
        "degree": "Shahih",
        "comment": "Nasa'i menambahan: \"Kecuali anjing pemburu.\"",
        "page": "194",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.790",
        "narrator": "'Aisyah binti Abu Bakar",
        "ar_hadith": "َوَعَنْ عَائِشَةَ -رَضِيَ اَللَّهُ عَنْهَا- قَالَتْ: ( جَاءَتْنِي بَرِيرَةُ, فَقَالَتْ: كَاتَبْتُ أَهْلِي عَلَى تِسْعٍ أُوَاقٍ, فِي كُلِّ عَامٍ أُوقِيَّةٌ, فَأَعِينِينِي. فَقُلْتُ: إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ, فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا فَقَالَتْ لَهُمْ; فَأَبَوْا عَلَيْهَا, فَجَاءَتْ مِنْ عِنْدِهِمْ, وَرَسُولُ اَللَّهِ صلى الله عليه وسلم جَالِسٌ. فَقَالَتْ: إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ فَأَبَوْا إِلَّا أَنْ يَكُونَ اَلْوَلَاءُ لَهُمْ, فَسَمِعَ اَلنَّبِيُّ صلى الله عليه وسلم فَأَخْبَرَتْ عَائِشَةُ اَلنَّبِيَّ صلى الله عليه وسلم فَقَالَ: خُذِيهَا وَاشْتَرِطِي لَهُمُ اَلْوَلَاءَ, فَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ فَفَعَلَتْ عَائِشَةُ, ثُمَّ قَامَ رَسُولُ اَللَّهِ صلى الله عليه وسلم فِي اَلنَّاسِ ] خَطِيباً[ , فَحَمِدَ اَللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ: أَمَّا بَعْدُ, مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطاً لَيْسَتْ فِي كِتَابِ اَللَّهِ تعالى مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اَللَّهِ فَهُوَ بَاطِلٌ, وَإِنْ كَانَ مِائَةَ شَرْطٍ, قَضَاءُ اَللَّهِ أَحَقُّ, وَشَرْطُ اَللَّهِ أَوْثَقُ, وَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ )  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ. وَعِنْدَ مُسْلِمٍ فَقَالَ: ( اِشْتَرِيهَا وَأَعْتِقِيهَا وَاشْتَرِطِي لَهُمُ اَلْوَلَاءَ )",
        "hadith": "Ia berkata, \"Barirah datang kepadaku seraya berkata, 'Aku telah ber-<i>mukatabah<\/i> (perjanjian antara seorang budak dengan majikannya bahwa budak tersebut akan merdeka bila dapat membayar sejumlah uang yang mereka sepakati) dengan majikanku sebesar sembilan <i>uqiyyah<\/i>, dengan membayar setiap tahunnya satu <i>uqiyyah<\/i>, maka tolonglah aku.'\" Aku berkata, \"Jika majikanmu bersedia aku membayarnya kepadanya dengan syarat <i>wala'<\/i>-nya (harta warisan bagi yang memerdekakan budak) nanti untukku, maka aku akan menolongmu.\" Kemudian Barirah menghadap majikannya dan mengungkapkan hal itu, namun majikannya menolak. Barirah datang lagi sewaktu Rasulullah (saw.) sedang duduk seraya berkata, \"Aku telah menyampaikannya kepadanya, tetapi ia menolak kecuali jika wala' itu tetap miliknya.\" Rasulullah (saw.) mendengar dan 'Aisyah memberitahukan hal itu kepada Rasulullah (saw.), lalu beliau bersabda, \"Ambillah dan berilah persyaratan wala' itu kepadanya, sebab wala' itu hanya bagi orang yang memerdekakan.\" Lalu 'Aisyah melakukan hal itu. Kemudian Rasulullah (saw.) berdiri di hadapan orang-orang dan setelah memuji Allah dan menyanjung-Nya beliau bersabda, \"Amma ba'du, mengapa ada orang-orang yang memberikan persyaratan yang tidak ada dalam Al-Qur'an?. Setiap syarat yang tidak tercantum dalam Al-Qur'an adalah batil, walaupun seratus syarat. Ketetapan Allah itu lebih berhak (untuk dilaksanakan) dan syarat (yang ditetapkan) Allah itu lebih kuat, dan wala' itu hanya bagi orang yang memerdekakan.\"",
        "hadith_no": "790",
        "degree": "Shahih",
        "comment": "Lafadznya menurut riwayat Bukhari. Menurut riwayat Muslim: \"Belilah dan merdekakanlah, dan berilah persyaratan <i>wala'<\/i> kepadanya.\"",
        "page": "196",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.793",
        "narrator": "Jabir bin Abdullah",
        "ar_hadith": "َوَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ -رَضِيَ اَللَّهُ عَنْهُمَا- قَالَ: ( نَهَى اَلنَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ فَضْلِ اَلْمَاءِ )  رَوَاهُ مُسْلِمٌ. وَزَادَ فِي رِوَايَةٍ: ( وَعَنْ بَيْعِ ضِرَابِ اَلْجَمَلِ ) ",
        "hadith": "Ia berkata, \"Rasulullah (saw.) melarang menjual sisa kelebihan air.\"",
        "hadith_no": "793",
        "degree": "Shahih",
        "comment": "Dalam suatu riwayat ia menambahkan: \"Dan mengupahkan persetubuhan unta jantan.\"",
        "page": "196",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.794",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "َوَعَنِ اِبْنِ عُمَرَ -رَضِيَ اَللَّهُ عَنْهُمَا- قَالَ: ( نَهَى رَسُولُ اَللَّهِ صلى الله عليه وسلم عَنْ عَسْبِ اَلْفَحْلِ )  رَوَاهُ اَلْبُخَارِيُّ.",
        "hadith": "Ia berkata, \"Rasulullah (saw.) melarang mengupahkan persetubuhan binatang jantan.\"",
        "hadith_no": "794",
        "degree": "Shahih",
        "comment": "-",
        "page": "196",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Bukhari",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    },
    {
        "id": "BM.7.1.796",
        "narrator": "Abdullah bin Umar",
        "ar_hadith": "َوَعَنْهُ; ( أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ اَلْوَلَاءِ, وَعَنْ هِبَتِهِ )  مُتَّفَقٌ عَلَيْهِ",
        "hadith": "Disebutkan bahwa Rasulullah (saw.) melarang menjual-belikan wala' dan menghadiahkannya.",
        "hadith_no": "796",
        "degree": "Shahih",
        "comment": "-",
        "page": "197",
        "chapter": "Jual Beli",
        "chapter_no": "7",
        "collector": "Bukhari, Muslim",
        "source": "Bulughul Maram",
        "sub_chapter": "Syarat-Syarat Jual Beli dan Beberapa Larangannya"
    }
]